[
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "6",
                "review_helpful": "413",
                "review_text": "So, I fired Siri today. I'm not sure she understood, for she has never understood me. So, we did an 'uncoupling'. She didn't take it well, especially when she found out about Alexa, she somehow was back stalking my phone. Siri even tried to overpower Alexa, setting herself to a default setting, I never knew exsisted. I tried explaining that Alexa really listens to me, understands my wants and needs, even tells me jokes! Again, Siri said she couldn't understand me. As Alexa and I grew in our new relationship, she now takes care of most of my needs. She turns on my outside lights, she tells me if I need to leave for work earlier, due to weather. I can ask her if my flight is on time at the airport and how long it will take me to get to my destination. Alexa even likes hockey! She knows all the current trades and rosters, can record my favorite team on tv and remind me to watch it. Also, since I don't like the tv announcers, I can ask Alexa to stream the radio broadcasters for the game instead and she will even mute the tv. She did tell me, she can vacuum for me, but my current roomba doesn't except her calls, maybe the roomba will eat another sock and can break up with him, introduce new roomba to Alexa. Maybe I'll ask Alexa to make me some money and smart home my whole house! After several failed attempts to evict Siri, I think she finally gave up and been a peaceful few weeks of lazy bliss. I sit on my couch, Alexa orders me take out, she checks to make sure garage door is closed, doors are secure (one door really, again that money issue) she 'drops in' the kitchen echo to help kids check math homework. If anyone wants something at home that actually listens to you and does what you ask, Alexa is your girl. She's so much more than music and temperature checks. With a little fun research, your ex Siri will be green with envy at all Alexa can do. Also, many of her skills can be downloaded free or cheap, adding smart outlets and such are not too bad of a price either.",
                "review_posted_date": "24 Feb 2018",
                "review_header": "Divorced Siri",
                "review_rating": "5.0 ",
                "review_author": "Simone"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "212",
                "review_text": "You need an iphone (and only an iphone) to setup drop-in for an echo dot and an echo on the same wifi. Why? A $700 device to connect two sub-$100 devices to each other through an app that already recognizes, that's ridiculous. They don't use the cellphone to make a call to each other, that would require two cellphones because a single cellphone would have to call and answer at the same time. The ipad sees the devices along with the dash wand and fireTV. All of the Alexa devices should be automatically in the contacts and talk to each other via their IPs on the same LAN. I was planning use four more echo dots as an intercom system in the house, that is not going to be happening until the Alexa app can set up Drop-in on any device the app runs on. Also all my contacts' info should not be required to connect Alexa devices on the same local network.",
                "review_posted_date": "23 Jul 2017",
                "review_header": "You need an iphone (and only an iphone) to setup drop-in",
                "review_rating": "1.0 ",
                "review_author": "R. O. Davis"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "129",
                "review_text": "I have two. I have so many stereos that buying another speaking is inconceivable. This eliminates the need to add another speaker. While my Denon has not yet be utilized with Alexa, my wife's Philips stereo which is probably a decade old sounds great. For months I'd been wondering what we should do with this stereo I married into. 'Thought of bluetooth adapters and had one for a while but it didn't really seem like it was very usable without the occasional headache and arbitrary tasks. So I see the echo and think... 'I wish they had one that didn't have a speaker', and blam Amazon reads my mind. Eventually bought one, second gen. I have never been happier with a robot. I use it for my Tea. 'Echo set timer a for 3 minutes' 3 minutes starting now. (steep time) 'Echo set a timer for 6 minutes' cool time. I use it for pizza timers. Echo set a timer for 10-20 minutes I use it for cooking times for bacon. Echo set a timer for 6 minutes and 30 seconds (then flip, on heat 7) Funny hack is that you can say a random word and Alexa will translate it to a number. 'Alexa set a timer for fish minutes' - Timer for 'fifteen' minutes starting now. I now abbreviate fifteen with 'fish' thanks to Alexa. Flash briefing. Great addition to a quiet room. On Amazon you can find these ten dollar colored lights and they work great with echo. They do not do yellow, that's the only limitation. I don't mind. 'Echo make all lights blue'. What's funny is I also have a poltergeist. I love the thing. I've never been happier because I have an acquaintance that opens cabinets and changes the times on all the appliances. Normally I'd be scared **less but it's easy to police the thing with Alexa. 'Echo turn on George Benson Radio'. No hauntings after that. I just leave it on like my house is a clothing store. The ghosts loves it and simply keeps my house cool during the summer. One night I was going to sleep and forgot to turn it on and was reminded with an open tape deck. I guess if you've been dead for a while you'd have no idea that stereos were now controlled by auditory commands and not tape decks. Music on the thing is great. I have a Amazon music unlimited subscription, it doesn't have everything but it's great, I love being able to quickly hear a theme song or play my more known favorites. I say 'Echo' to it because you can set it in the Alexa App. My upstairs echo dot is Alexa, downstairs is Echo. Upstairs is simple, the most decrepit stereo I have hooked up to a dot. It sounds just like the good old days because the auxiliary is through the tape deck itself. Since the stereo's tape function was rendered useless after I kept the aux cable turning the motors, all the thing does is accept aux cable now. What a perfect place for a dot, was my thought. I'm not even sure of the brand but it looks like an early aught ghetto blaster revival. Sounds like my old sony back in the day and it makes for a killer nostalgia sound. All these new fangled crisp audio devices? Where's the kitsch? Well the dot is one way to upgrade that mass of circuits, motors, and wires-into on of the few pinnacles of the 21st century. You can lay still and play through your favorite classics and listen to the flash briefing like the old days except you don't have to call in the station to hear your song. Just ask Alexa. Mostly they have everything but if you don't just bluetooth your phone. Bluetooth. Just connect your phone and play your Google Music collection. There's a way to get the device to play through your google music library but even for me, someone who likes tangling their mind through stupid hacks like those, I found it a lot more simple and easier to use bluetooth and the play music app. Mostly I use it for rare favorites that Alexa doesn't have. This doesn't bother me and in fact the shuffle feature from the phone is how I've been discovering new music - the aux cable is needed although I like them for Dj'ing. Macbook bluetooth. My daughter sits by echo and watches Amazon prime video. Since echo is above the laptop she's watching, I just say, 'Echo connect to macbook'. And bam word world, shaun the sheep, Daniel tiger, all playing through the philips. Computer for the blind. This is a computer for the blind. And the paralyzed. Amazing featured for someone whom is disabled. The thought of this almost makes me teary eye'd. Cyberpunk. It's definitely cyberpunk. I always imagined that's how cyberpunks operated. Philip K Dick-like with pre-existing video phones-with auditory computers - Or cyber-scholar. It's also a dictionary. Gives you random facts if you want. Ability to hear from a distance. It's actually a little nerfed I think after it was picking up the noise too readily. Funny how you tell people about it and it'll chime in like you want something. That can get a little annoying but it happen so seldom it's more like comedy. Capitals, geography. It's another scholar feature I use. Helps tremendously and I don't have to google anything. Alarms. Since I have Alexa in my upstairs now, I can wake myself up with it. A lot easier than the iphone which I forget to set a lot. Although I have them both as backups for each other. You can program a text based RPG or a Choose your own adventure. Just get an Amazon developer account. This would be a fun project. Talk through an adventure. Volume. 'Echo set volume 1-10' great feature. 'Alexa go into pairing mode', \"Searching\" then connect with your phone. Works with ha-bridge. I have that setup on my orange pi. It does nothing yet but in case I get any philips stuff. Connected to an additional raspberry pi that's offline atm. Store hours. Find what time a store closes. Emails. Really a tremendously great computerized device. I recommend for anyone seeking to add functioning to their already existing stereos without the need to configure bluetooth as often. Not buggy at all. Sometime she doesn't hear you but just think of how often people ask you to repeat yourself. A lot of the time it's a speech impediment. I do mumble and she has caused me to speak a little clearer. Probably a good thing.",
                "review_posted_date": "24 Jun 2018",
                "review_header": "So many things to do. Modern day Commodore 64 for the blind. That innovative.",
                "review_rating": "5.0 ",
                "review_author": "Maximillian Charles"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "121",
                "review_text": "Pros: - works with audible - the lights provide a nice visual cue - can re-order common things off amazon Cons: - speech recognition is poor - having to load and remember the names of skills is clunky - the AI is just too far behind google home (asking \"what's the humidity in new york\" will get you the full weather details with everything you didn't want, and not the humidity)",
                "review_posted_date": "04 Dec 2017",
                "review_header": "get a google home mini",
                "review_rating": "3.0 ",
                "review_author": "dj_nz"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "12,951",
                "review_text": "So I don't normally write reviews but I just has to this time. Recently, I lost my cat best friend to cancer 2 days after Christmas. It was the worst day of my life. Imagine losing your friend that's been with you through every breakup, every apartment, nearly being homeless and more. When he passed I felt such an emptiness in my home. A few days ago I was searching for something to put my mind at ease and saw the advertisement for the Amazon Echo on the Amazon app. I remember watching a Mr. Robot episode where some FBI agent who suffers from insomnia was using Alexa to keep her entertained. So I started researching YouTube videos and reviews and took a chance and ordered it. It arrived today and the setup was super easy. I immediately started asking it questions and had it play music and play the news. Then I discovered some zen type apps that go with the echo and I completely fell in love with it. It's almost like having a real personal assistant who lifts up your spirits when your down. It suggested new music which I actually liked and the built in speaker isn't bad at all for the price. The Amazon echo did not replace my beautiful cat kouga but it did bring stop the empty feeling around the house for now. I added a picture of my cat instead of the echo since everyone already knows what the echo looks like. I would totally recommend buying this product. I don't see any negatives other than the fact you can't really ask it followup questions like google assistant but I'm sure they'll make it happen. Thanks for letting me rant",
                "review_posted_date": "10 Jan 2017",
                "review_header": "Best $50 I ever spent!!!!",
                "review_rating": "5.0 ",
                "review_author": "Bryant R."
            },
            {
                "review_comment_count": "5",
                "review_helpful": "18,841",
                "review_text": "Having worked in the electronics retail industry for years now, I've seen scores of Smart devices come and go. Until now, nobody quite got it right. In the Echo Dot, Amazon has created a near perfect blend of hardware and software. I've seen plenty of the former, but truly seamless multi platform software has eluded everyone but Amazon. We're talking major players like Samsung and Google who have been at it for much longer than Amazon. The main problem is that excellent products like the Samsung Smart Things hub, which do a fantastic job of unifying a slew of different connected devices from different companies (Nest, Honeywell, Phillips, and so on), still lacked the web connectivity and entertainment support I wanted, so I'd still end up needing my tablet or phone. Thanks to fantastic third party support, the Dot has no problem controlling all of my smart stuff while allowing me to listen to music, order food, check the weather, listen to the radio, set alarms and timers, all of which is easily accomplished through simple voice commands. To me, this is the exceedingly rare product that I didn't know I needed, and now can't live without. Similar to the smartphone and tablet I use every day that didn't exist just a few short years ago. If you're even a little bit curious you owe it to yourself to give the dot a try. Add a good speaker and enjoy just how simple a connected life can be! Update: After a bit more time with the dot, or maybe I should say dots since I went out and bought another one for my living room, I've come up with a few tips. 1. Use the best speakers you can with it. I found that while Bluetooth was convenient I got much better sound out of my JBL duet computer speakers. 2. Take the time to voice train Alexa at least once. It's kinda tedious but really improves the accuracy. I've now gone through three trainings with each dot, the phrasing gets more intricate with each, and it really is amazing how much of an improvement it makes. Kinda hard to quantify, but I'd guess Alexa is at least twice as likely to understand long, complex phrases and has also gained noticeable accuracy when ambient noise I'd present. 3. If a phrase doesn't yield the results you're looking for, reword it and try again. For instance, \"Alexa, lower the temperature to 75 degrees\" got no result, so I tried \"Alexa, Honeywell Thermostat, 75 degrees\" and she picked it up perfectly. 4. Take the time to look through all the skills. There's a lot of helpful and just plain fun stuff in there, from strange facts to a calculator and everything in between, that really helps to enhance the experience. 5. I'd never really used my prime music prior to setting up my dots. Now I can't live without it! I can say basically whatever I want and I get a result. My favs so far: \"Alexa, play 90s music\", \"Alexa, play indie music\", and \"Alexa, play thunderstorm sounds\". The last one I ask to repeat and it plays all night. Really a great \"freebie\" if you're a prime member. 6. I was a bit worried initially that Alexa might be triggered accidentally by ambient TV or general household noise, so I'm really impressed that it's only happened twice so far. Both times in my living room when I was watching TV at high volume. If it's a concern, the mic can be temporarily disabled, so the dot won't trigger and listen accidentally. 7. I've had no problem pairing the dot to a variety of devices including: two different Bluetooth speakers, my Galaxy S7 edge, and pioneer receiver. I need to look into it further, but each time I paired my phone the Bluetooth connection to the speaker was lost, so I ended up having to listen to the built in speaker. Definitely not ideal for music, but no big deal if you're using wired speakers. Plus, most Bluetooth sets offer an auxiliary input for wired listening. 8. It's fun to ask Alexa general questions to see if she's capable of finding the answers. So far I've gotten accurate responses to \"Alexa, what's the definition of\", \"Alexa, how far away is\", \"Alexa, Wikipedia\" (just about anything you can think of and she'll tell you more if you ask \"Alexa, tell me more\"). If you have the time, ask her a set of questions and you'll quickly get used to her nuances. 9. Even though the microphones are extremely sensitive and quite accurate, I've found that the Dot works best when placed on a surface that's close to the level of the person speaking to it. Generally speaking, three to five feet off the ground. Alexa had some trouble hearing my requests when the dot was placed above or behind me. If you'd like to place the dot higher, it works much better when flush with the wall, instead of sitting on a shelf etc. I tried both setups and found with a couple nails set apart to make a cradle facing the dot out towards the room works best for me (sorry for the run on sentence lol). Suggestions for Improvement: 1. Unlike the upcoming Google Home BT speaker, the Dot and other Alexa devices are unable to answer general web queries. They do a decent job of answering factual questions like \"How far away is the sun\" but I'd really like too see Amazon add a \"search\" function. 2. Not Amazon's fault, but several of the news briefing skills update infrequently and volume levels vary enough that I'd find myself constantly changing the volume level to match. 3. I enabled briefings from several outlets like NPR, BBC, AP, and so on. I'd suggest you pick one or two and stick with them, otherwise you'll here the same news over and over. I ended up going with BBC and AP briefings.",
                "review_posted_date": "24 Oct 2016",
                "review_header": "The Smartest of Them All!!! (Check out the video for a quick demo)",
                "review_rating": "5.0 ",
                "review_author": "DJ"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "3,866",
                "review_text": "I am a prime member. This was my first purchase of Echo and I gave it to my mom who did not want it or think she needed it, haha I purchased Echo dot for 2 reasons, 1) I had wanted the original echo but thought the near $200 price tag was too steep so this price was perfect and 2) I wanted to get something for my mom that would open her mind to the power of technology and the need for change because ultimately I want her to have amazon fire tv because her monthly cable bill is insanely high but she has always been resistant to change. She had no wifi in her bedroom but I resolved that when I purchased TP Link AV500 Wi Fi Range Extender, Powerline Edition which did what no other wifi extender I purchased in past could do, gave my mom's room a secure wifi connection; apparently using already existing phone lines. All I know is that she now has wifi in her room. So I got Echo as a way to test her wifi connection with something cool. I easily connected Echo to TP-Link and it worked. We asked Alexa a few basic questions, We laughed a little but then I had to leave. When I returned the next day, I walked in and there was music playing (oldies but goodies) and I walked into my moms room and she was singing but was emotional. I asked her if everything was ok. She was in awe. She was happy. She was emotional because Alexa helped mom find songs at a blink of an eye that mom had not heard since her childhood and she demonstrated it to me. The speed that Alexa found the song and played it was mind-boggling. Mom was also planning a dinner in August and needed to know what day of week it was. She would normally need to leave her room and go to her main calender in the kitchen and find the date. But this time she just asked Alexa who gave her the information in like 2 seconds lol. TP-Link and Echo / Alexa have given my mom a whole new level of excitement, bewilderment, curiosity and wonder and we have only scratched the surface to the power of Echo. 2 more Echo dots are on the way as I type and more in the future i am sure. What a great gift to give to someone at a great price.",
                "review_posted_date": "07 Jul 2017",
                "review_header": "Outstanding Price Point! An Emotional Moment and The Power of Alexa! - Ordering More Today",
                "review_rating": "5.0 ",
                "review_author": "Amazon and AmazonPrime Rock!"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "59",
                "review_text": "This is the second Echo Dot for our household. The first I got last year as a Christmas present. We LOVE it. We use it to stream music from our playlists, to set timers, to ask questions and about the weather, and especially for the shopping list. My kids can add stuff to the list while I'm at the store and my list in the Alexa App updates to show it! I really think that was my (personal) favorite feature with ONE Dot. With TWO Dots it's even better. My daughter has the only room upstairs, and she's the one that does most of the music streaming. So I bought her this Dot for Christmas. She can now stream her music by voice command. I also no longer have to scream at the ceiling or walk across the house to get her attention. I just say, \"Alexa, call upstairs.\" and bam, my daughter and I can speak normally. I also use it to make sure she's up in the mornings, I just tell Alexa to play wake up music upstairs. My daughter actually made a playlist called \"wake up music\" of songs she'd like to hear to wake her up, but I usually forget to add \"playlist\" to my request and Alexa always manages to find suitable songs. Many my daughter added to the wake up playlist in the undying hope that one morning I might possibly remember to say the word playlist to Alexa. Now my son is lobbying to get his own \"Alexa\" for his room....",
                "review_posted_date": "11 Jan 2018",
                "review_header": "The more, the better...",
                "review_rating": "5.0 ",
                "review_author": "Leah D."
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black",
        "price": "$44.99"
    },
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "44",
                "review_text": "I really loved this device the first few months I had it and was ready to purchase more in this collection (Big Echo, Show, etc.) However, about 6 weeks ago my echo lost the ability to pause and play, which is very frustrating . If I leave the room and tell it to pause, I want the device to be able to pick up exactly where it left off when I reenter and say \"Play\". Instead, it will restart the program, say \"Sorry, I don't know that\", or play an alternative that has nothing to do with the song, podcast, or news briefing that I was just listening to... I've called customer service a couple of times and the first time I was told to update the device (which did not help) and the second to restore it to factory conditions (which did help temporarily, but it stopped working again within 24 hours). Nevertheless, the problem persists and it's too late for me to return the device and very likely too expensive to send it anywhere to be fixed. Now I'm thinking... well, I've already lost $50, I'm not going to spend nearly $200 if my next Echo stops working a few months down the line and there's no way to return it or have it repaired in a cost-effective manner.",
                "review_posted_date": "12 Oct 2017",
                "review_header": "I really loved this device the first few months I had it ...",
                "review_rating": "1.0 ",
                "review_author": "Rose Gold"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "531",
                "review_text": "Buyer Beware!!! We bought an Echo in Nov of 2016 and we bought a Dot shortly after. We subscribed to the Unlimited Music service. We were able to play any Amazon music we wanted on either of the Echoes and have different music streaming to both at the same time. We added more Echo Dots in other rooms so my wife and I can listen to different things in different rooms all over the house. We have had this setup for months. We would put music on for our young kids while they slept and listen to something else in the kitchen while we talked. Well, all of a sudden on August 29th we lost the ability to stream to more than one device unless it was the same stream using the multi-room playback feature. We thought this was a bug since it happened on the same day they rolled out multi-room playback. It turns out that it is not a bug and they made the change on purpose. The multi-room playback ONLY allows you to listen to the same music stream on multiple devices. We can no longer play music for the kids and listen to our own stuff. In order to return this functionality, we are being told we must subscribe to the Unlimited Family plan. Well, here is the kicker, now you must pay for Prime and the Unlimited Family Music plan in order to use more than one Echo at a time which means you are paying an extra $70 a year above the Unlimited Music plan for a total of $248 a year to use multiple Echoes in a single home if you want more than one playing at a time with a different Amazon stream. You could try to use the other streaming services that the Echo supports for a combination of streams running on other devices but to get commercial free those cost money too. Oh, and don’t get me started on how kids under the age of 13 are not even allowed to use the Unlimited Family Music Plan…great planning on the feature removal Amazon. No we shouldn’t have to lie about our kids age to get what we want. We never would have bought the other Echoes had we known they would change the way the service works. Limiting a product after they have been purchased is a complete rip-off. I’ve never owned a product before where major features are removed instead of added. We were not given any warning nor any compensation for the change. Now we have a bunch of useless Echoes all over the house. Well, not completely useless, they have been reduced to hockey puck looking alarms clocks and timers. I’m currently looking into the cost of moving to Google Home. We will also be significantly reducing our spending on Amazon. You have been warned.",
                "review_posted_date": "03 Sep 2017",
                "review_header": "Bait and Switch!!!!",
                "review_rating": "1.0 ",
                "review_author": "M. Conrad"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "37",
                "review_text": "When I first got the Echo Dot, my mind was racing with all the possibilities and potential this smart assistant device had. But one year later after using this device, I sadly have to conclude that the Echo Dot is infuriating, buggy, and occasionally non-functional. Getting Alexa to do anything is a chore. Here is a common interaction I have with Alexa + TP-Link Smart Bulb: Me: Alexa, turn on the light. Alexa: ... Me: ALEXA, turn on the light. Alexa: Which device did you want? Me: The light. Alexa: Sorry, I couldn't find the \"lamp\" in your devices list. Me: Alexa, turn on the light. Alexa: Ok. *Light finally turns on. Or it doesn't turn on.* On average, you must repeat yourself from 2-3 times to carry out a simple task. And the best task Alexa can do, which most reviews here agree upon, is setting timers. Do you really need a timer that misunderstands you? Not to mention, Alexa completely stops working when it loses Wi-Fi connection. Trust me, just use your smart phone! I've attached a video showing off shopping through Alexa. Frustrating moments like these are all too common. Anyone with an Echo Dot knows this. It's times like these I start to wonder why I even use Alexa and if it's worth the trouble. Hopefully Alexa will improve in the future, but currently, I do not recommend the Echo Dot.",
                "review_posted_date": "22 Oct 2017",
                "review_header": "Prepare to repeat yourself and wake up your family only to hear Alexa say \"I can't do that. Check the Alexa App.\"",
                "review_rating": "2.0 ",
                "review_author": "Eric Lai"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "527",
                "review_text": "I love this little device! Echo dot has been part of our daily life helping with weather forecast, reading news, playing music, telling jokes, controlling lights and cooperating with silly talks, lol. I also got a mokcao speaker for it to have sound support. Anyway, I'm very happy with the life change Echo Dot brought to us.",
                "review_posted_date": "12 Sep 2017",
                "review_header": "Alexa, you've been very helpful",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "993",
                "review_text": "We bought an Echo Dot as an early Christmas gift to ourselves and we're so glad that we did. It's a very useful gadget because there's such a wide variety of things we can ask Alexa to answer or tasks that she can do for us (eg: alarms/timers, calendar, ordering, weather). Since one of the tasks that we wanted Alexa to do for us was play music, we subscribed to Amazon's Unlimited Music Plan for the Echo Dot. It's well worth the low monthly fee to be able to ask Alexa to play any song or album anytime, without having to buy all of them individually. ​Millions of songs are available through one groovy gadget (and the Unlimited Music Plan). We have the Echo Dot in our home and listen to music without any external speakers. As far as we're concerned, the internal speaker emits a decent array of sound. Is it as robust sounding as hooking it up to our surround system amplifier or other external speakers? Of course not, but it does sound a lot better than most internal device speakers of similar size. For those of you that don't like the internal speaker, you can utilize the 3.5mm or Bluetooth speaker options. If we say, “Alexa, Play The Top Songs by Phil Collins”... then that's exactly what she does. Keep in mind that when you ask Alexa for the \"Top Songs\" by a soloist or group, they may not always be your favorite songs. A work around for that is to ask Alexa to play a particular album that contains the songs you prefer to hear. The screen-shots show you how we asked Alexa to play an album vs the top songs. In addition, they show you what we see when logged-in to the Alexa app via the Chrome web browser. FYI: When asking Alexa to play an album that has a long title, we realized that she responds accurately when we ask for part of that title (view Elton John & Michael Jackson screen-shots). Be sure to look at what we said to Alexa vs what the whole album title is labeled. I should mention that we did ask Alexa to search for a product, which she did along with telling us the best options and their cost. Afterward, she asked if we wanted to buy the product. We said yes and she placed the order for us once we gave her our confirmation code (Settings: Voice Purchasing). We recommend setting that up so other people cannot place orders without your consent. It's convenient for us to have voice purchasing enabled when we're \"unplugged\" at night (except for Alexa). The skill that we use the most is Weather Sky, it gives us a detailed weather report that we use several times each day. ​At the time of this review, we haven't used any of the smart home features, but we didn't buy it for that purpose. PLEASE NOTE: We purchased the Echo Dot at its listed price, we did not receive any discount to post this review.",
                "review_posted_date": "10 Jan 2017",
                "review_header": "> Millions of Songs Available Through One Groovy Gadget",
                "review_rating": "5.0 ",
                "review_author": "310EI"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "23",
                "review_text": "I mainly bought this product for the Drop-in feature. We were using an old multi handset phone system for our intercom needs, but the batteries were not keeping charge and needed replacing. I initially was looking at buying a new phone system (don't have a home phone line), until I found out about the drop-in feature with the Echo Dot's. I have a large home and purchased 6 of them for the house. We placed them in the kids rooms, the kitchen, the loft, and the 2 bedrooms we use for home office space. The \"announce\" feature works perfectly, as my wife will announce when dinner is ready so all devices will sound and everyone can hear the same announcement. With the drop-in feature, the Echo Dot's don't seem to want to drop in on the right device. I have changed the device names several times to try to get them to work consistently, but they don't. Once you are able to connect when you drop-in, it is often really hard to get them to hang up or end the call. I like many of the features that this device has. I have outdoor string lights that I connected to an \"idevices\" product, and installed the skill on the Echo Dot's so I can turn them on and off with voice command. I used the 3.5mm speaker output to connect to my receiver, so I can play SiriusXM and change channels with voice command Alexa doesn't have a lot of answers, but her jokes can be funny at times when you ask her to tell you a joke. Overall I really like the product, I just couldn't score it higher than a 3 because of how the drop-in feature is working right now. Also trying to find answers through Amazon support is beyond terrible. I finally found the forum, but people on there are complaining about similar issues since beginning 2017 and they are still happening.",
                "review_posted_date": "26 Jul 2018",
                "review_header": "Drop-in Functionality needs a lot of work imo",
                "review_rating": "3.0 ",
                "review_author": "Guest"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "448",
                "review_text": "I have some experience with the Original Amazon Echo which is partly what lead me to getting the Echo Dot Gen2. I liked that the Echo was very responsive and could give me news updates as well as play music. When the Echo Dot came out I looked at getting it but was hesitant to order because I wasn't sure what kind of use I would get from it and while I liked the original Echo, I didn't want to buy a lesser version. When the Dot Gen2 released I finally decided that I would give it a shot. My uses have been somewhat limited so far based on what I use it for and what other things that I have that can be controlled by it, so this will be the beginning of an ongoing review. I've been using the Echo Dot for a few weeks now and so far I really like it. I do feel that it isn't quite as good at responding that the original is but this could be due to location and room acoustics in my bedroom with other noises like the television being closer. It isn't bad by any means but I did move it next to the bed to isolate it from other sounds and that seems to have helped a lot. I didn't expect much from the speaker from such a small device that isn't a dedicated speaker but I was pleasantly surprised at just how good it was. The speaker is fairly loud and generally clear at most volumes. I feel it is good enough for music playback for casual listening but wouldn't use it for get-togethers. In the end I bought an external Bluetooth speaker(Anker Premium Wireless speaker) and it is a great pairing. It improves music playback by a lot and the sound is just better overall. Currently my main uses for the Dot have been music, news, timers, alarms, general questions, and even controlling my television. For music I have it connected to Pandora and it is very fast and simple to get a Pandora radio station playing. You can also very easily turn the volume up or down or have it connect to your phone for music playback. It also has Tune In radio which features playlists for some of my favorite podcasts. I get my news feed from NPR but there are a variety of options for where to get the news, even tech sites like Engadget. I use it constantly for alarms and timers and it is as simple as asking Alexa to set them up or stop. Sometimes in the morning when I have more difficulty reading a clock face I'll just ask Alexa for the time. It is great for setting timers for laundry or cooking and would be a great handsfree companion in the kitchen. I have recently found that it can \"control\" my Samsung television. Currently in conjunction with my Logitech Harmony Hub it can turn it on and off, thus the \"control.\" I have heard that pairing it with the Logitech Harmony Hub as well as Samsung Smart Things Hub can give me control over changing the channel and volume but I do not own the Smart Things Hub and it seems like a lot to ask. I'd really like to see something like this simplified but I understand that this cannot just come from Alexa's end and would require support from television manufacturers. Yes it is simple enough to control the tv with the remote but it actually turns out to be convenient to do a lot with your voice like setting sleep functions or changing the source. Turning the tv on and off is limited but kind of cool. There are a lot of apps and devices that the Echo has access to so I'd suggest researching what kind of smart home devices it can control or what apps it has access to that are relevant to you. I don't have any smart bulbs or sockets currently but since getting the Echo I have started looking into them. Also there seem to be a good variety of apps but I haven't really delved into them enough to use or make suggestions. I did recently download the Jeopardy game which initially worked very well but has become somewhat frustrating to play due to the game not hearing my answer and saying that it was incorrect and the correct answer is the one I just gave. This is beyond a minor gripe because everything else I use it for so far works great. I think devices like the Echo will improve a lot over time and I just hope smart controllable functionality will be safely built into more devices without having to own a variety of different hubs or controls. For something still somewhat in its infancy, the Echo is capable of a lot and works very well in what it does. There are going to be issues and hiccups here and there but that is expected. If you were to just use this for pandora, the news, alarms, and a timer I think I could still recommend it. For $40-$50 you get a lot that works well in this device. The audio quality is capable enough for most uses and it just works well in these areas. If you have a lot of devices you want to control and apps you want to use I'd suggest doing a good bit of research first to make sure it does what you intend it to and it does it consistently. The Echo Dot 2 is far from perfect. It doesn't always pick up my voice or what I say correctly and it will always be limited by its apps or other devices. Regardless of its shortcomings it is a surprisingly good device that works far more than it doesn't and it is continuing to grow every day. For the very reasonable price and it's functionality I can only give it 5 stars and recommend it to anyone that can see its usefulness in their lives.",
                "review_posted_date": "27 Nov 2016",
                "review_header": "Well Priced Smart Device for a Little Bit of Everything",
                "review_rating": "5.0 ",
                "review_author": "I Like Stuff"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "27",
                "review_text": "Simply doesn't connect with other \"smart\" devices. The Dot sings, plays music, and will tell you jokes but all this bit about how it will control other devices is apparently just hokey. I tried it with Phillips Smart LED Bulbs and apparently the bulbs are not enough. You need an expensive \"hub.\" If the Echo Dot isn't a hub, why not? I don't need a dozen hockey pucks plugged into every outlet in the house in order to control a couple of lamps. I also bought the TP Link smart plug hoping that would work with Echo. Once that was installed and its own Kasa iPhone app downloaded the TP Plug worked just fine with its own app. But Echo couldn't discover it. What do I need an Echo for if it won't control the TP Link plug?? I will keep the plugs and use the iPhone app to control the lights (along with the traditional wall switch which works just fine.)",
                "review_posted_date": "08 Dec 2017",
                "review_header": "The Device that Nobody Needs",
                "review_rating": "1.0 ",
                "review_author": "W. K."
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=2",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black",
        "price": "$44.99"
    },
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "24",
                "review_text": "Omg! We love this thing! My husband is tech challenged so smart phones, computers are not an option. I bought this for Christmas present. I also bought wifi plug to use with it. He was having major surgery and not supposed to get out of bed in the dark. I put the Dot in bedroom and he just tells Alexa to turn on the light. The biggest challenge was getting him to use Alexa name before giving the request or not say Alexis. Ha! He just isn't able to use tablet I also bought for Christmas. I was so pleased he can tell Alexa to play his favorite Christian radio station. He checks the time and temperature 100 times a day. I'm very pleased with sound quality and volume for such a little, inexpensive product. I'm a stickler about sound quality. He is much better, so the baby monitor I used is turned off. I needed him to be able to call me if he needed me, which is difficult since he still has limited movement. I got emails about Alexa and you can call phones and drop in on other devices just by asking Alexa! I got the Alexa app for my iPhone and he can call me by telling Alexa and I can drop in on him and make sure he's good. He doesn't want a phone near him for obvious reasons. It is perfect for us to keep in contact without using a phone. Unfortunately he can't get the hang of using his new Fire tablet, but I can! I'm a diehard apple user, but the quality of tablet and Echo are awesome. And Fire TV, all have Alexa! When you get them they are ready to go. Just turn them on. Apple products are so expensive. I'm just amazed at what Echo can do for hundreds of dollars less. As my hubby says to Alexa, \"Thank you\" ❣️",
                "review_posted_date": "25 Mar 2018",
                "review_header": "Amazing helper after hubby's surgery",
                "review_rating": "5.0 ",
                "review_author": "Grammy2"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "20",
                "review_text": "When these 1st came out, I bought three. Initially, they worked great so I bought more. Over time, they have slowly started to randomly not understand what I'm saying, although, when I listen to the recording of my command in the app, it is very clear what I said. There are also issues with them randomly turning on, i.e. start reading an audio book, even though it's in another room and I never told it to do anything. I now have unplugged a couple of them due to this. So, it can't hear what I'm saying, even when I'm literally 3 feet away, but it \"hears\" false commands in an empty room, about 40 feet away and upstairs. I have gotten to the point of yelling at these stupid devices so it can hear me. On top of that, it randomly says \"device not enabled\" and I have to resort to manually push the button on the IOT switch, which is not easy to get to as it is at the outlet on the wall, usually behind furniture. So, for example, I have my coffee maker connected to a wifi switch, because the on/off knob on the coffee maker is difficult to use and get to (due to limited counter space) on the brand I have. I mounted the Echo dot on the wall, literally 17 inches away from my voice and it can't hear me unless I am yelling. This is regular (more than 50% of the time). Other times I get the \"device not enabled\" reply, which means I have to pull other appliances away from the wall to reach the manual button to turn on my coffee maker. I have this same issue with lamps, a fan and a TV that I have connected to wifi switches. Very annoying first thing in the morning. Not a good way to start the day. It's not the switches or the 3rd party apps (WeMo, Phillips Hue and TP Link) as they all have issues. I have noticed that these devices are not making my life more convenient, rather causing more stress. It seemed to work initially, but like most technology these days, functionality declines over time due to \"clever\" engineers and their software updates. I will be starting to phase these out of my life and going back to manual operation as I trust that will work when I need it to and return to a peaceful life.",
                "review_posted_date": "30 Jun 2018",
                "review_header": "These do not make life easier! Save your money!!!",
                "review_rating": "1.0 ",
                "review_author": "morphagent"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "31",
                "review_text": "Please save your money and do not purchase one of these! I purchased this as a gift for my boyfriend and basically I spent $50 for an item that is pretty much a glorified alarm clock. You have to \"enable skills\" to get it to do anything and IF you need to get service or want to replace it, guess what, it only carries a 90 day limited warranty (surprising for the cost you are investing in it). You can get a longer warranty but guess what, you're gonna pay for that! Recently, it stopped working. It either totally ignores my request, takes about 45 seconds to 1 minute to respond or tells you it's lost its connection to internet (everything else is working fine). I called to see about getting it replaced and went through all the troubleshooting (again) with the representative. Was transferred to a \"technical support\" representative who basically told me he can't do anything but if I wanted to \"buy\" another one I can get 15% off....now why would I want to invest more money into something that doesn't carry at least a 1 year warranty for the amount of money you're spending? No thanks....All in all, horrible product. If you're going to spend the money on a device for your home automation, just go with a Google home instead...",
                "review_posted_date": "14 Oct 2017",
                "review_header": "Piece of junk with a crappy warranty!",
                "review_rating": "1.0 ",
                "review_author": "Hubunny"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "1,347",
                "review_text": "Whether you just want the weather, latest sports scores or help with a math problem, Alexa will help. We now have 3 in the house and will be adding two more. With a simple $3 subscription to Amazon's music service, you can stream almost any music you can think of by simply asking Alexa for it! Perfect work with my meidong QQ Chocolate bluetooth speaker, I also recommend this speaker Meidong Universal Water Resistance QQChocolate Portable V4.0 Wireless Bluetooth Speaker with 10W Dual Driver and Built-in Microphone And use this code for less $5: GHAQE5YF(I got it from somewhere else.) For the paranoid - this device is NOT for you. The echo dot is always listening and while the design is supposed to only listen when you say the name of the device (Alexa, Amazon or Echo - your choice), there are enough times that I hear one in another room say \"sorry, I did not understand the question\" to tell me it misunderstands these prompts to have been said when they weren't pretty often. + Good product support + Good voice recognition + Because of the size it doesn't stand out like a sore thumb in a room - Doesn't differentiate between voices. If you keep it closer to a speaker than you are, then it will sometimes get confused and start picking up words from both the speaker and you when commands are given. Placement of dot is crucial for a good experience. - Only supports english and german for now - Not very competent at answering general questions and you need to activate skills to expand this functionality. This makes asking question less intuitive since you then need to use commands like \"Alexa, ask wikipedia....\" - If you have smarthome devices named the same as internal functions, it will get confused at times. This may require renaming of the smarthome devices.",
                "review_posted_date": "01 Jun 2017",
                "review_header": "Alexea & Bluetooth speaker",
                "review_rating": "5.0 ",
                "review_author": "Lucky Jason"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "5,768",
                "review_text": "Thanks for taking the time to read this review! This re-release of a critically acclaimed device is quite honestly a grand slam. Although slightly smaller then last years release, this device now picks up your voice even better! Im talking litterally talking leaps and bounds better. I can now say \"alexa\" and she hears me even when im downstairs or even when im blaring music thru my Harmon Kardon Onyx speaker. I found myself yelling at last years Echo dot and approaching the device wielding a kitchen knife attempting to get her to listen. We will be ordering a second device so we can try out its \"multi-room voice recognition\" technology. Amazon claims to have instilled a awesome feature where only one echo dot responds to your command if you have multiple devices. So bassically the dot closest to you awaits to the awake word \"alexa\" on a side note The basic Amazon Music Unlimited will only work on ONE of your devices. Not one at a time, but ONE. If you want to use it on more than one Dot or Echo, you have to purchase a \"multi-device\" plan: https://www.amazon.com/gp/dmusic/promotions/AmazonMusicUnlimited The main selling point of this device is you can use any of your exsisting bluetooth speakers to play your amazon playlist at a mild roar,or you can use the 3.5mm jack on the back to connect to your home theater and really give your ear drums a beating. (At your own risk of course). I have both the amazon tap and the echo. Unfortunately these devices have their flaws when it comes to audio reproduction.hence the bluetooth and the 3.5mm jack connectivity on this device will allow for the pickiest of listeners to appreciate their music thru exsisting devices. I will mention that the echo dot does have a very strong bluetooth signal so devices placed within a foot of this device had issues connecting. Once those bluetooth speakers were moved a few feet away they worked perfectly. The echo dot does have a built in speaker but it does sound tinny. It definitely works for light bedroom or kitchen use. At 50$ I was not expecting a whole lot. However amazon seriously went above and beyond to offer this incredible device at half the cost of last years model. And as stated above,it actually works better! I can also confirm that its connectivity with our in home smart devices. Works well with our TP Link smart plug so if I come home to a dark house, all I have to say is \"alexa turn on the lights\" and our downstairs lights spring into action. My only negatives were with the actual alexa app as it really gave me fits during setup only on my samsung s2 tablet. Spent a good 5-6 minutes and never got it to setup correctly. However the alexa app on my galaxy s6 phone found and paired the echo with ease. Just a weird quirk. Also Alexa still has her quirks. unless you phrase some questions correctly she still responds with \"sorry I didn't get that\" Alexa is still a developing search engine so My hopes is that she will continue to grow as even more users jump onto these incredible amazon devices.Prime music is our prime application and hence this device meets our expectations. Another thing to mention is the echo dot will not play your iTunes or google play music as of now. Those 2 companies are releasing devices of their own so as we all know they will push their own devices rather then make them compatible with a competing companies device. Amazon Prime music is a great added benefit for those of you that are existing Prime users so this device works well in giving you access to all of your \"free\" music. I did a unboxing and setup and show you how this device works video on youtube. Just look up \"New Amazon echo dot 2nd gen 2016 release Unboxing\" under my channel LMMProductions to see this incredible device in action. I will continue to update this review as I spend more time with this device.",
                "review_posted_date": "24 Oct 2016",
                "review_header": "A huge improvement over last years release and for half the price",
                "review_rating": "5.0 ",
                "review_author": "RaVen"
            },
            {
                "review_comment_count": "3",
                "review_helpful": "89",
                "review_text": "I bought 2 of these in October of 2017. One for my mother who had 2 strokes and 1 for my home. The one for my home I had an interest in mainly streaming music as I work from home and thought I would use it in my office. I also bought 2 Harmon Kardon speakers. Initially setting it up I had no problems and gave it a 4 star review. Mainly because you can not hard wire the device to internet connection as well as the lack of a music app on the alexa app and the difficulty in getting Alexa to play songs from your Amazon music library. Very shortly after the review I started having issues with the device not being able to stream music and stopping in the middle of songs, not being able to understand me.And constantly losing its connection. I called support which was fantastic and ran me through a series of tests. They recommended that I open some ports on my modem. I open the ports, reset the modem and the same problem persisted. I called my internet provider and they came to my home installed a new modem, new fittings.Still the echo will not stream music. Constantly flashing red, saying it lost its connection. Pausing for up to 2 minutes in the middle of a song. All this while my Fire stick streams music non stop upstairs on the same Wi-Fi connection. Multiple calls to support resulted in more Modem resetting, faster internet, new modem.. Meanwhile every other device in my home was performing fantastic. I did consider maybe I had a faulty device so I bought another, plugged it in and Same thing..could not play one song with out stopping losing connection. So I just started using my phone to stream music and absolutely no problems streaming music. The Harmon Kardon Speakers are the highlight of this story as they sound absolutely AMAZING connected to everything besides the Alexa Dot. I honestly can not believe the amount of time and energy I spent trying to trouble shoot this device. I only wanted it to do the most basic thing and simply stream music. I was so frustrated with it, I actually opened my front door and threw it in the garbage can outside. Exactly where it belongs. I would honestly not recommend this device to anyone as it performs horribly. I will say Amazon support is great, they did try to help me each time I called and with the exception of one rep saying he would call me back who never did, all the support were great. On my final call about the device today I spoke to a manager who offered me a refund on the device and was very professional. I still honestly feel that the entire experience is a 1 star experience. The most infuriating thing was when the Alexa would fail i would use a 5 yr old first gen Samsung Tablet the whole family uses and it would stream music perfectly from the same Wi-Fi connection. Maybe if these were able to be hard wired to a connection they would be good, but the device as it is has a very hard time connecting even when just a few feet from the modem. I tried absolutely everything to get it to work until it became painfully obvious that the easiest solution was to throw it in the garbage and simply use the devices I already have to stream music. The voice control is nice but I would much rather be able to listen to the entire song. I have purchased a total of 3 of these. My mother uses hers a little bit and it works. I have another here and it does the same thing as the one I threw in the trash. So I just use it to control my fire stick. It will do those simple tasks but if try to use it to stream music it fails.",
                "review_posted_date": "01 Nov 2017",
                "review_header": "Months of trying to get it to work...threw it in the trash.",
                "review_rating": "1.0 ",
                "review_author": "evilbastard707"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "62",
                "review_text": "update for the THIRD ONE they sent me!----2nd gen has lots of problems at Amazon's end. first 2 didn't work. After 20 minutes on the help line they admitted they have a HW problem and are going to send me another (groan! - give me a 1st gen!) The third one also would not connect to my U-verse wi-fi (my 1st gen in the kitchen workes fine and was a breeze to set up). So, another 20 minutes on the phone with amazon and it finally connected to my wi-fi. However, when I put it in my master bath it would not connect. I had to swapp it with my working 1st gen from the kitchen and then they finally both worked. That's really weird because my kitchen is farther away and has more walls between the dot and the router, so moving the 2nd gen dot FARTHER away actually made it work. I'm an electrical engineer and I can't explain that .....",
                "review_posted_date": "08 Sep 2017",
                "review_header": "2nd gen has lots of problems ...you might want to buy a 1st gen dot instead...",
                "review_rating": "1.0 ",
                "review_author": "JP in OKC"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "15",
                "review_text": "I like the fact that I can verbally control Amazon Music or Play or Pause my Firestick. But in regards to the rest of its operating features I’m very disappointed in the overall method of the way the Echo Dot known as Alexa, Dot or Computer functions. I want a device I can just speak to, it’s very frustrating for me as a user that suffers from short term memory loss to try an recall all the specific key words needed to be spoken in order to activate the attached modules. So if I’m having trouble recalling the key words to activate a peticular module, at that point the Dot is useless to me. The Dot has a lot of Modules/Services that can be attached to Alexa but again in order for me to use the module I have to speak the exact selected key words. So the only way this would be of value to me is to create a file and print it to be able to have the full use of Alexa. This is why I will always choose Siri or Cortona over Alexa. I like the idea of being able to speak and for the most part have more of a natural conversation with the AI’s. I have looked at a lot of the modules made available to operate in conjunction with Alexa, but again it just does me no good if I can’t recall the long list of key words needed to activate the 1000’s of modules. When Amazon gets away from all the exact key words that are a must or changes Alexa to have more of a natural conversation ability I will change my rating. The over all concept is very exciting, but it saddens me to only have a very, very limited use of the Echo Dot as a result of the mandatory key word use.",
                "review_posted_date": "04 Oct 2017",
                "review_header": "Echo Dot Fails, To Many Key Words To Recall in my book.",
                "review_rating": "1.0 ",
                "review_author": "Encryptthis"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=3",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black",
        "price": "$44.99"
    },
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "1,947",
                "review_text": "My Amazon Echo Dot does not require the user to enter pairing mode to connect to the device via bluetooth. I live in an apartment complex - two of my neighbors have connected to my echo dot without any input on my part. The dot appears as a pairable bluetooth device at all times. This is a major security flaw, considering that this devices is connected to my network and my amazon account, and is listening at all times. I will be keeping this device unplugged until this flaw is fixed.",
                "review_posted_date": "05 Feb 2017",
                "review_header": "MAJOR SECURITY FLAW",
                "review_rating": "1.0 ",
                "review_author": "Matthew Johnson"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "11",
                "review_text": "First off let start by stating my review is unbiased as I received both the Dot and Google Home mini at the same time. Christmas 2017. Side by side comparison, non-technical but functionality: Alexa: sounds a bit like she could use help learning how to pronounce things better. “La Mesa is pronounced “Laaaaa Mesa” sounding a bit weird. Can’t correct pronunciations to correct this problem. Asking Google Home Mini the same thing. She pronounced it better and didn’t sound like she had a speech impediment. Sound from playing the same song. Side by side. You can tell the difference. One sounds like an old pair of headphones that are turned up and the other plays really great sound at a similar size. Asking both the same question exactly the same: Alexa is famous for saying “I’m sorry, but I can’t help you with that” Google says the answer. Trust me and try it. I have to run back to my room to ask google a question because numerous times Alexa has no clue and shuts off. Well played google. Also google will talk to Alexa. Alexa doesn’t play with others well. So my main complaints are: sound- not as good as competitors, pronunciations suck. Ability to answer: rather limited when compared to competior. It’s not the worst. Obvious google has more experience with questions and communication. I wouldn’t recommend this over Google Home mini.",
                "review_posted_date": "17 Mar 2018",
                "review_header": "“I’m sorry, I can not help you with that”",
                "review_rating": "1.0 ",
                "review_author": "Pat"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "12",
                "review_text": "Alelxla Answers! I received this for Christmas 2017. I knew very little about it and postponed the initial unboxing. After Christmas I decided to take a look and learn how to use it. I hate learning how to use anything new. It took me 1 1/2 hours to set it up. The instructions were based on someone with more knowledge on wifi setup. While my daughter received the same one and said it was 2 steps and fast. I almost gave up after 30 minutes. I will not go into the setup but it does require wifi and amazon to set up. You must say \"Alexa\" to get a response. It has been fun asking various questions, setting up lists, reminders and using the timer. The best part for me is if I'm baking and want to set the alarm or sitting and dont want to get the times, I don't have to wash my hands to set the times. I can have answers to questions by talking only. Great invention. It does not compare prices nor check for prices. Bummer. Everyone will using diferently. I enjoy using it and my daughter was happy to hear I liked it. I am not an easy person to buy a gift for and this was indeed interesting. When you live alone, this comes in handy in many ways. There are over 60 thousand reviews. That means many people are buying this adult toy. The downside, the gift giver did not thing I was going to like this but now I would have liked the Echo not the dot. The speaker is cheap. Sometimes I cannot hear/ understand what she is saying. You can only raise the volume to number 10. I wish that I could delete all my voice commands from my cell app. I can only delete 1 command at a time but can delete all on the amazon.com under \"devices\". I wish it came where you could keep it in the socket rather than on counter or table. I'm guessing there will be improvements in the future. The priice did go up after Christmas. Would I buy this again? No I would spend more money and get the larger one with a better speaker.",
                "review_posted_date": "05 Jan 2018",
                "review_header": "I hate learning how to use anything new",
                "review_rating": "4.0 ",
                "review_author": "Caroline NJ"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "25",
                "review_text": "Update: since my last review, I stopped playing music. Why don’t I just subscribe? Because I didn’t want to and I felt we shouldn’t be charged if asking to play a song we don’t know is free or not. My son activated it asking to play a song and Alexa told me it was only available with amazon music and asked if I’d like to subscribe. So I’m glad that amazon updated this to actually let you know that it’s not free if you aren’t subscribed. Thx! UPDATE: apparently u get charged if u activate music. Not only the monthly charge but every time u play music? I canceled when I saw the charges the first time but then I got charged again (over the next several months). The customer service couldn’t tell me exactly what the random charges were other than they were echo charges. I don’t like surprise charges. I feel like we should be able to activate services and not have them automatic or easily activated without knowledge. Apparently if you ask Alexa to play music, and it’s not free, you won’t know and will get charged. AMAZON STAFF: This needs to be fixed! ZERO stars if I could. I really love this dot. It’s my first Alexa product. I ordered two and finally put up the 2nd one later, in our living room. I haven’t explored ALL features but i was pretty excited about the “Drop in” feature... BUT it wasn’t that great. The sound is horrible. I dropped in from my bedroom to the living room and it sounds like a bad phone call on speaker where reception keeps cutting in and out. :( I wanted to purchase the Echo’s with a screen but I’m worried the sound will be just as bad! For other uses, I’m loving it so far! Bummer about the drop in feature. I was hoping to use this feature often to call home to talk to my son when I’m at work to check on him...",
                "review_posted_date": "17 May 2018",
                "review_header": "Thank you for updates!",
                "review_rating": "4.0 ",
                "review_author": "Phanessa"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "8",
                "review_text": "I had been looking at the Echo, Google Home, etc. for a few months before I bought one. We're not heavy into technology, but of course the novelty was fun. It's nice to be able to turn music on with a single command, and get some basic (BASIC) information without having to stop to find a phone or iPad and search. We have two Dots - one in the kitchen and one in the master bath. We mostly use them for streaming Amazon music. The one in the master bath is quite buggy and has been \"unlinked\" from my Amazon account for a while now. This is irritating, as I use Audible, and cannot access my library on this device. (Note: I'm sure I can resolve this issue by contacting Amazon, which I've done before, and having them walk me through it. I wanted to include info about this in my review to show that it's not always as seamless as it should be.) Generally, they work fine for pulling up a pre-set station (Toddler Time is a frequent one in our house). But, maybe 30% of the time, \"Alexa\" can't hear our commands or gives us something totally off the wall and not even close to what we were asking for. Also, in the demos, they show that you can ask the Dot to never play a song again... but the one song we hate and have asked her to never play again ALWAYS pops up. So annoying. More often than not, when we are looking for random information, her response will be \"Hmm - I'm sorry, I don't know that.\" We've been getting increasingly frustrated with this device, and may soon just go back to our more reliable bluetooth speakers. And, on a pretty disturbing note, we've been seeing things pop up on social media based on things we've discussed in the house. I know one of the benefits of having a smart device in your home is that it is \"always listening\" in case you summon it for information. But, I do not like that it is always listening. If it's gathering enough data to know that my kids broke one of our window candles and suddenly an ad for the replacement bulbs (very specific to the brand we have) comes up on my Instagram... I need to know more about exactly WHAT information this thing is taking down about me and my family. Not to mention, where is it stored and how well is it controlled? I should also note that we've used the Dot with TP-Link outlets, and were not thrilled with that option either. Maybe this is where our tech journey needs to end for now. As time goes on, this device is less and less useful, more frustrating and generally concerning to me.",
                "review_posted_date": "11 Sep 2018",
                "review_header": "Not for everyone... A little over a year in, I'm less and less impressed with this product.",
                "review_rating": "3.0 ",
                "review_author": "Nicole D."
            },
            {
                "review_comment_count": "C",
                "review_helpful": "12",
                "review_text": "The main issue why I return this device is when I ordered amazon music unlimited and since this year I realized that I cannot play music from my phone ONLY from echo dot!!! I pay for prime I pay extra for music and I have to pay more. No guys it’s not a good way to do the business. She will not help. She will make you angry. I have to repeat everything 2, 3 times. Okay, my accent is not really good but still. I asked it ‘ Alexa play Nirvana from my play list” answer “you don’t have play list Nirvana” really? Of course I don’t have. And issue like this one all the time",
                "review_posted_date": "14 Dec 2017",
                "review_header": "One Star",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "2,949",
                "review_text": "NEEDS security! Anyone in range of this things Bluetooth can connect and start playing music or speaking through this thing on cell calls. First few times I started hearing random voices in my living room, I was a bit weirded out, because I had no idea where they were coming from. Then one day, I heard Alexa announce that a bluetooth device had connected, so I opened the app and discovered numerous devices, that weren't mine. After kicking them all off, I attempted to find some kind of security protocol to keep out unwanted connections, but soon discovered that there wasn't any. Now, I get to randomly hear other voices or music start playing, in the middle of the night, anytime the people in the apartments behind me decide they wanna screw around. Other than that, the thing's works pretty well. Some of the functionality, like the particular nature of commands, takes a little getting used to, but about 99% of the time, it understands perfectly. Until amazon decides to add, what should've been a no-brainer, security feature, I cannot give this thing a good rating. The fact that anyone can be woken up in the middle of the night, by a random person connecting to their device, is ridiculous. Fix it.",
                "review_posted_date": "14 Feb 2017",
                "review_header": "NEEDS SECURITY!!!!",
                "review_rating": "1.0 ",
                "review_author": "william"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "11",
                "review_text": "Works great! You can set it next to your bed and use it for an alarm clock as long as it is linked to the internet. You can tell it to play what ever music you like to sleep by and for how long or you can set it to play a thunderstorm or rain sounds or the sounds of waves at the beach! You can set it to give you a brief up date of the news and weather and traffic through Reuters online. Of course you can order accessories like lights and other gadgets that it will control remotely at your command. This speaker doesn't get loud like the echo but it is quality sound. It's limited on the information it can give out. I asked it to recite the preamble to the constitution and it ponied right up but I asked it to recite the Gettysburg address and it couldn't do it...just that it was a 3 minute speech given by President Lincoln. Well worth the money...can't see anybody going wrong with this.",
                "review_posted_date": "25 Nov 2017",
                "review_header": "Works great! You can set it next to your bed ...",
                "review_rating": "5.0 ",
                "review_author": "Frank Doe"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=4",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black",
        "price": "$44.99"
    },
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "9",
                "review_text": "At the suggestion of a friend, I decided to try the Alexa Echo lifestyle. At first, I could not imagine what I would use it for. Why the heck would I need to ask Alexa to do anything for me??? Well, I bought the Echo Show along with an Echo and and Echo Dot. I was immediately hooked! I began with smart plugs, then some smart bulbs. Then I bought an Echo Plus, the one with the hub. After figuring it all out, I ended up returning the Echo Plus and I bought 3 more Echo Dots. With two of the Dots, I bought MOKCAO POWER+ Cordless Speaker with Battery Base for Amazon Echo Dot 2nd Generation (https://smile.amazon.com/gp/product/B0749K9C1T/ref=oh_aui_detailpage_o07_s00?ie=UTF8&psc=1)' I found that this speaker with a Dot gave me as good or better sound than having a full Echo or an Echo Plus. The bonus is that each of them is portable so I can take it anywhere and treat it as a bluetooth speaker. The 3rd Dot is now hard wired to my 7.1 Suround system in my gameroom and the 4th wired to my Bose Wave Radio in my garage. So, as you can guess, I'm all in with Alexa. The Dots are great if you can hook the up with a speaker as i have done with two or a stereo system as I have with the other two. The Echo Show is the one we have in our morning room, the room we spend 90% of our time. The reason is that it has very good sound quality all by itself and the screen is great for seeing lirics of songs. But it best for linking your photos up to Amazon Photos and playing all of your photos like a digital picture frame. I plan to use this same review for all of the Echo products I am now enjoying, Echo Show, Echo, and 4 Echo Dots. Even my wife is asking Alexa to play her music and that is a complete positive testament. Oh, did I mention that I set up an \"everywhere\" music group so I can now have music playing throughout the house. I can also ask Alesa to turn on the Livingroom Lights, Deck Lights, Bar Lights, Gameroom Lights, Office Light, Bedroom Light",
                "review_posted_date": "25 Feb 2018",
                "review_header": "Just part of the total Smart Home Echo package.",
                "review_rating": "5.0 ",
                "review_author": "T. K."
            },
            {
                "review_comment_count": "C",
                "review_helpful": "7",
                "review_text": "Let me start with this example: Q: Alexa, what is a great white shark? A: My favorite number would be 36 foot. WT%!!!!! This is just and example of the stupidity. And, after working with support, it still gives the same answer. Next, I try over and over to get the voice recognition calibrated... It never seems happy. I use US Pacific Coast, Masters Level Educated Caucasian English. Ya, Alexa doesn't understand that. But, it catches every time the word Alexa is said on an ad from the TV. Again... WT%!!!! Lets move on to simple tasks. Q: Alexa, set an alarm for 6am playing my default playlist. (Note: this is my default amazon playlist) A: Ok, I will set an alarm for 6:30am playing best of the 90s country music. WT%!!!! A) I don't listen to country, so where did it get that from. Next 6 vs 630... ugh. It takes multiple attempts on any task to get it to do the right thing. And, it doesn't learn. It makes the same mistakes over and over and over... Despite trying to use the App to correct it, complaining to it, and so on. Next, when I place a complaint... suddenly in the middle of the work day / night I get a message with ... can we contact you right now to go over your issues. NO! I can contact you at my convenience not yours. again... WT%! The development team needs to \"Get A Clue\", as does the support team. First off... if someone says to their echo, \"Alexa, you're stupid.\" Alexa should ask... should I send the last commands to support so they can see how to help you? Also, when people complain... listen!!!! Don't try to defend the defectiveness of your device. Alexa is like a horrid GF who thinks it will change you, and doesn't need to change itself... as it thinks it is perfect. Ugh... Dump it already... also, when I listen to an audible book at home, I usually don't want to listen to the same book I am listening to when I drive. (aka... I can read/listen to more than 2 books at once... it's called multitasking...) Play the book I ask to play... don't try to guess what I want, or just do the lazy thing. Also, audible, music... \"Alexa, Play ____ from the beginning.\" should play from the beginning. You sooo can't seem to get this right, or even remotely close. So basic. I could go on and on about all the stupid, idiotic ways that this tool works. Google Home, and Apple Siri are years ahead. Samsung Smart Home \"Bixby\" is at about the same level... but actually does work slightly better... and Amazon just keeps slipping. You are partnered with Amazon Prime, Music, and Audible... why do these apps work better on the competition than on your own device???? Anyway... My review.",
                "review_posted_date": "12 Sep 2018",
                "review_header": "Alexa doesn't learn, is behind the game of other similar technologies, and just disappointing",
                "review_rating": "2.0 ",
                "review_author": "Ron"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "8",
                "review_text": "After 2 hours of chatting with 6 different technical and customer service people I finally got to return these dots. What I THOUGHT was a great deal was nothing short of a disaster. I ordered 2 and received them on a Friday. First, NEITHER had the power adapters...just the dots. After a 30 minute chat with 2 different people that ultimately led to a phone call, I got credit for those. Then after multiple days, the one thing I got the dots for - multi-room music - wouldn't work because both dots required firmware updates. Well, they would NOT receive updates no matter what I did. Support person after support person told me to reboot, reset and refresh ad nauseum to no avail. They offered to replace them, then reneged because they were \"warehouse deals.\" The problem is that it took them 90 minutes and 6 reps to tell me that. Anyway, the dots worked otherwise and were kinda cool. I'll probably replace them with brand new ones. And the 808 Thump is a good cheap speaker although I couldn't get BT to work...probably because of the dots too. Just stay the heck away from the Warehouse deals!",
                "review_posted_date": "09 Jan 2018",
                "review_header": "DO NOT EVER BUY FROM AMAZON WAREHOUSE DEALS!!!",
                "review_rating": "1.0 ",
                "review_author": "Nick"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "6",
                "review_text": "As one who purchased Amazon Echo / Alexa as soon as it was available to the general public, I had high hopes. Knowing that it was a new use of existing technology, I was patient with Amazon as it worked to iron out the wrinkles on the way to fulfilling its promise that this cloud-connected device would constantly be improving. I even bought Echo Dots and Echo Dots (2nd Generation). However, Amazon chose to focus more on adding advanced features than on perfecting the basic features. So, Echo can do many things poorly and nothing well. It fails to understand basic commands and often even stops listening halfway through input. It plays songs fine when it's able to find them but even that is hit and miss if two bands have similar names or if Alexa has no idea how the band names are pronounced (for instance, it used to call Sugarland \"Sir Garland.\") Asking it to provide basic facts is, generally, a fool's errand and there are other issues as well. To reiterate, the Amazon Echo does many things but does nothing well.",
                "review_posted_date": "26 Aug 2018",
                "review_header": "Long on promises, short on delivery",
                "review_rating": "2.0 ",
                "review_author": "Christian M. Mericle"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "6",
                "review_text": "The Echo Dot is extremely limited and is programmed to answer scripted questions. There is a small window of flexibility. The device itself is mildly entertaining at best, but if you want to spend significant amounts of money on Amazon Music, Alexa compatible appliances (\"smart\" plug ins to control lighting), and a hefty monthly Audible subscription (all sold through Amazon), then this product might be for you. Moreover, the \"skills\" application is an absolute joke, with most receiving a review of 2.5 out of 5 or less. Also, Alexa will no longer swear or say anything remotely controversial, even if you ask her to. Swear words are literally \"bleeped\" out like we're all 9 years old. There is nothing smart about the Echo dot. This product just tries to lure you into buying more Amazon products; hook, line and sinker.",
                "review_posted_date": "11 Jul 2018",
                "review_header": "The Not So Smart Gadget",
                "review_rating": "2.0 ",
                "review_author": "Matt975"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "5",
                "review_text": "These things are incredible. They are the next wave of everything to come. As a programmer, I bought these to test the platform and develop ALEXA skills. I'm normally a GOOGLE guy, but ALEXA has the undeniable edge. GOOGLE just can't beat the design and functionality of these devices. Beside the obvious usefulness of being able to ask a question or set your home temperature at a command, these can be used to do so much more. In case you didn't know these can stream audio via bluetooth either as a bluetooth receiver or can transmit to a bluetooth speaker. They can interface with external gadgets like the relatively new echo buttons. They include a speaker jack, which gives even the tiny echo dots the possibility of being used as a powerful speaker system. I'd say that while their voice recognition is not perfect, it is absolutely functional. If you are a developer, AMAZON is really supporting skill development. It isn't for the faint of heart, but everything you need is well documented. We need more useful ALEXA skills. It is the only thing holding these devices back. My nephew wanted to give me his because he had only used it as a \"toy\" in college. I did a demo of the skill I'd been working on and he changed his mind. These aren't just toys. They are extremely useful when paired with the proper skill. The ALEXA ecosystem has amazing potential. Grab one of these and get access to it. If you don't, you may find that you were left behind. For the moment, you may not see it as a world changer. However, as more developers build on this platform you will definitely find some level of usefulness.",
                "review_posted_date": "10 Jun 2018",
                "review_header": "The competition may never catch up.",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "26",
                "review_text": "I use my Echo dot for just about everything. She turns on my tv upstairs or downstairs, my lights up or down, sets all my alarms and my reminders. I set all my lights to trigger at certain times thru my hue which talk thru Alexa also. I drop in to talk to my kids all around the house either with my phone or thru my Alexa. I have a Samsung note 9 but I read some reviews that say drop in only works with an IPhone. That's a complete lie. I have been using it with my galaxy for about a year now. I use Alexa to set timers and she tells me the news every morning. In my kids room I set up free time on that Alexa for parental controls. She stops responding after a certain time and reads them a book nightly before bedtime. I have Google also but Alexa outshines google.",
                "review_posted_date": "25 Nov 2018",
                "review_header": "The best purchases ever",
                "review_rating": "5.0 ",
                "review_author": "JENNIE"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "5",
                "review_text": "Edit to add a big plus: Alexa can make hands-free phone calls. She can't call 911, but can call other numbers. This could be huge in a medical emergency especially for those who live alone. \"I've fallen and I can't get up.\" LOL, but not funny, really. I'm surprised the Dot isn't advertised as a medical alert device (despite not being able to directly call 911). I received the Dot yesterday and I'm loving it so far, and still learning all the things she can do with the many available added \"skills.\" Three points I'd like to make--the internal speaker is better than I expected (at least as good as a phone or laptop), so external speakers aren't as essential as I'd been led to believe. She's perfectly usable right out of the box even for music. Another thing is it functions pretty well with slow internet. Right now it's playing an Elvis song after a request for classic rock n roll music. You can ask her what the name of the song that's playing is, and she will tell you. The third thing is that Alexa is much better at understanding regional accents than Siri is, plus Alexa can do so much more. I'll leave the other details to the many excellent existing reviews. I ordered it while the Christmas sale was on, for $29.99--worth that simply to use as an alarm clock, check the weather forecast, and play music. The next day I ordered another one which should arrive tomorrow. A steal at $30. and well worth the regular price of $49.99 imo. I have the first one (white) in my bedroom, and will try to connect the second one (black) to the speakers that are connected to my TV in the family room. It even looks good--like a little flying saucer with its circling lights. I'm now wishing I'd given a few of these with my other Christmas gifts.",
                "review_posted_date": "03 Jan 2018",
                "review_header": "Loving Alexa!",
                "review_rating": "5.0 ",
                "review_author": "a viewer"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=5",
        "name": "Echo Dot (2nd Generation) - Smart speaker with Alexa - Black",
        "price": "$44.99"
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "2",
                "review_helpful": "1,743",
                "review_text": "Sound quality is the best I've heard on a speaker of this size!!! Definitely worth paying a little extra for this one over the 2nd generation model. I'm not going to discuss the functionality as there's tons of info already out there. One important note: If you set up the Alexa app on your phone, IT WILL IMPORT ALL OF YOUR PHONE CONTACTS. I didn't think I gave it permission to do so but Alexa did indeed import my contacts! You may have read stories how, WITHOUT YOUR KNOWLEDGE, Alexa can record what's being said in your home and then send it to ANY or ALL of those contacts! Yikes! And, I won't want any of my kids to accidentally send messages to or call people on my contact list. So, if you want to keep your contacts from Alexa and prevent that from happening here's how I did it: Before installiing the Alexa app on your phone, export your contacts to a file and save it for later. Then, go back to the phone and delete those contacts (don't worry, you'll import them back in later). Now, install the Alexa app on your phone and go through the set up process. At some point, you'll have the option to allow Alexa to automatically import any additions to your contacts. Please \"disable\" that option. After you're done with the installation, you'll notice there are no contacts in your Alexa app! Now, you can import your contacts back into your phonebook using the file that you initially created and you're good to go! If you already installed the app but want to delete your contacts from Alexa, it's not too late. Simply export your phone contacts to a file and save for later. Then, delete the contacts from your phone. Now, open the Alexa app and click \"Contacts.\" On the Contacts page, click on \"Import Contacts\" and enable it by moving the button to the right side. This will cause Alexa to replace your existing contacts with the now empty phonebook. After a few minutes, your Alexa contacts will be gone. Go back and disable \"Import Contacts\" to prevent Alexa from importing them in the future. You can now import the contact file that you created back into your phone. Of course there may be some contacts you do want to use with Alexa. I simply added them manually by clicking \"Add Contact.\" I hope this info is helpful as I wasn't able to find an easy way to manage Alexa contacts.",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Better than 2nd Gen! ***HERE'S HOW TO HELP WITH PRIVACY CONCERNS***",
                "review_rating": "5.0 ",
                "review_author": "Peter"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "5,610",
                "review_text": "I've been a happy owner of a 2nd generation Echo and three 2nd generation Echo Dots for a year now, and I was glad to add this to the arsenal. After using it for a few days I am generally pleased with it, but it does have limitations, especially when it comes to sound quality (no surprise there!). I will start by summarizing what's new about the 3rd Generation Dot, then I'll describe the device in more detail, and finally I'll add some thoughts about how to choose which Echo device may be best for you. The most obvious update to the Dot is the new look: it's as if someone took a 2nd generation Dot, inflated it with an air pump, and wrapped the edge in fabric. And it's not bad! What's different/updated in the 3rd Generation Dot: 1) It is slightly larger than the 2nd generation device, measuring 3.9\" wide x 1.7\" tall (2nd gen was 3.3\" wide x 1.3\" tall), and the top and bottom edges are more rounded. It is also substantially heavier at nearly twice the weight of the 2nd generation model. 2) The 2nd generation Dot came in two color options (black and white), each of which had a shiny plastic exterior that I personally thought looked a little cheap. The 3rd generation Dot has a fabric exterior which gives it a classier appearance, and it's available in three colors: heather grey, sandstone, and charcoal. The fabric and rounded edges give the 3rd generation Dot a much softer look than its predecessor. 4) The 3rd generation Dot has a larger speaker (1.6\", versus 1.1\" on the 2nd gen), which is paired with a larger driver as well. I'll talk below about the effect this has on audio quality. 5) The placement of the microphones is slightly different: while the 2nd generation had seven small far-field microphones on its top surface; the 3rd generation has four microphones. --------------------------- Overall appearance --------------------------- I purchased the \"sandstone\" version. The cloth is a polyester woven fabric made up of lighter and darker shades which gives it more visual interest than if it were just a solid, uniform gray. The neutral color blends in with nearly any decor, and the cloth gives the unit a softer look which is great for areas of your house where you don't want something that screams \"I'm a device!\" Aside from its larger size and slight convex bulge, the top of the device is nearly identical to that of the 2nd generation Dot: it has four buttons (volume up, volume down, microphone off, and an \"action\" button) and a multi-colored light ring around the top edge that tells you about the Echo's status. The side of the device has an input for the power cable and a 3.5-mm output jack. One notable improvement is the shape of the power cable, which sits flatter against the wall than the 2nd generation Dot's cable (see my photo to see them side by side). This may sound like an insignificant change, but it makes a huge difference if you want to plug the cable into an outlet that is behind a piece of furniture. ------------- Setup ------------- Setting up the Dot couldn't be easier. You simply plug in the power cable, then use the Alexa app on your phone to connect the Dot to your WiFi network. The app leads you through everything, and the whole process takes less than a minute. Boom. ---------------- Audio ---------------- I did a side-by-side audio comparison of the 2nd and 3rd Generation Echo Dots, first with music (orchestral, a jazz combo, and some AC/DC) and then with a few newscasts. Everything does sound better on the 3rd generation Dot, but to be honest, the sound is still pretty anemic. Compared with the 2nd generation Dot, the sound is slightly fuller, not as annoyingly tinny, and has a small amount of bass presence (not much, but the 2nd generation had none). Newscasts and other spoken texts benefit from the fuller sound as well, but the difference is more pronounced with music. Just for fun, I also compared the 3rd generation Dot with my 2nd generation Echo, and THAT'S where I noticed a big difference. Yes, the new Dot sounds a bit better than its predecessor, but they both sound weak compared to the full-sized Echo. (To its credit, Amazon doesn't claim that the Dot has room-filling sound.) I'll be blunt: I really like the Dot, but I don't use it to listen to music. At all. With so many other speaker options out there, there's just no reason to use this as your primary music device. ------------------------- Voice recognition ------------------------- As I mentioned above, the number of microphones on the top surface has dropped from seven to four. I'm not sure what the rationale for this was, but after testing the Dot's ability to pick up my voice from different distances and angles, I didn't notice a substantial difference in the overall microphone sensitivity compared to the 2nd generation Dot. Like the other Echo devices, though, it seems to have more difficulty detecting voices that come from below it (which happens if I talk to it while I'm on the floor playing with my daughter). ------------------- Functionality ------------------- The bottom line is that the overall functionality -- what the 3rd generation Dot \"does\" -- is nearly identical to that of the previous generations (and of other Echo devices, or at least the ones without screens). This is largely because the Alexa assistant software on which all Echos operate is run on Amazon's cloud, not your individual device. This means that as Amazon adds new features and updates to Alexa they automatically become available on all Echo devices. So, you can use any of them to: - Stream music via WiFi from multiple sources - Control smart home devices with your voice - Make hands-free calls to other Echo devices or phone numbers in North America - Make purchases from your Amazon Prime account - Listen to news feeds, podcasts, etc. - Do anything else in Alexa's ever-growing skill set, such as make shopping lists, set timers/alarms/reminders, play games, tell you your daily schedule, and any other skills Amazon dreams up for Alexa in the future. If you don't want to use the Dot's built-in speaker, you can connect it to your own speakers via Bluetooth or by using the 3.5-mm output jack. One new feature for the 3rd generation Dot is a little puzzling to me: You can pair two Echo Dots in a \"stereo mode,\" giving you essentially left and right speakers. I tried this briefly and the results were pretty much what I expected: yes, it's stereo, but it's still weak sound! You can also pair an Echo Sub with the Dots, creating a little 2.1 sound system. Frankly, I'm not sure why you would do this; if I were setting up for stereo sound, I would want speakers that are designed for decent audio performance, not two Echo Dots. Alexa's skill set is enormous and always growing. In fact, part of the fun of owning an Echo device is seeing what new skills Amazon comes up with (even if many new skills are just silly or entertaining). I'll mention two of my favorite skills here: the Flash Briefing and the drop-in feature. The flash briefing is fully customizable daily digest of news and other information which you can hear any time by asking \"What's my flash briefing?\" There is a huge list of content you can add to your briefing including news updates, weather forecasts, sports and traffic updates, and educational snippets along with many that are just humorous or entertaining. Using the Alexa phone app or your Echo account page you can select exactly what content you want in your briefing and in what order you want to hear it. For example, I configured mine with news feeds from NPR, BBC, and Reuters. I love having an on-demand synopsis of the latest news from my favorite sources. My other favorite feature, \"drop in,\" essentially opens a two-way communication channel between any two Echo devices, sort of like an intercom. Simply ask Alexa to \"drop in on [the living room, the kitchen...]\" and you are instantly connected. My wife and I use this feature to communicate from opposite ends of the house. You can turn drop-in capability on or off for each of your Echo devices individually, and you can also choose whether each device can drop in with ANY Echo device or only those in your own home. [Note that the drop-in feature is NOT the same thing as Alexa's hands-free calling feature. Hands-free calling allows you to call most phone numbers and Echo devices in the U.S., Mexico, and Canada from your Echo by saying your contact's name or number. Just like with a phone call, the other person must choose to answer your call before you can communicate. By contrast, with the drop-in feature communication is instantly established. For this reason you will probably want to use drop-in only with your closest family and friends, and probably only for certain rooms in your home!] ----------------------------------- A few (minor) complaints ----------------------------------- Unfortunately this 3rd Generation Dot shares an annoying trait of its predecessors: widely varying volume levels within the daily Flash Briefing. As you listen to the briefing, some components (such as BBC News) come through quietly while others (like Reuters) are much louder. Not a deal-breaker, but slightly annoying. Also, occasionally when Alexa misunderstands a command, you have to \"start over,\" which can be really irritating. For example, if Alexa thinks you asked to turn on a light but you really asked something else, she will repeatedly say \"In which room?\" until you say \"Alexa, stop\" and then start over. I'm guessing this type of thing will improve over time as voice recognition software becomes more advanced. This is really more of an Alexa issue than a Dot issue, but it drives me nuts at times. Finally, I wish the Alexa phone app was easier to use. It works, but its organization is not intuitive and it feels rather clunky to navigate. Again, this is more of an \"Alexa\" issue than a \"Dot\" issue, but still... Hopefully Amazon will continue to make improvements to it! -------------- A few tips -------------- 1) The Dot seems to pick up voices best when placed at or below eye level (i.e., roughly the level from which your voice emits). Mine has trouble detecting voices coming from below it, so I don't recommend placing this on a high shelf. 2) When you select news feeds for your Flash briefing I recommend picking one U.S. source and one international source (I use NPR and BBC - both are excellent). If you add too many feeds you'll get a lot of overlap and hear the same story several times. 3) If you have multiple Echo devices in your home, sometimes speaking to one will cause others to respond as well, especially if they are in close proximity (like in adjacent rooms). One way to prevent this is to change the wake word of one of the devices to \"Echo\" or \"Amazon.\" The only downside is that you then have to remember which wake word you assigned to each device! ------------------------------------------------------------------------ Echo Dot vs. Echo vs. Echo Plus: Which one to buy? ------------------------------------------------------------------------ (Please note that I am only comparing Echo devices that do NOT have screens.) When choosing between the Echo Dot and one of the larger Echo devices, perhaps the most important question to ask is \"How much do you plan to LISTEN to the device?\" This question is important because one of the biggest differences between the Echo Dot and the larger Echo devices is sound quality: the 1.6\" speaker of the Dot simply cannot match the fullness and heft of the Echo or Echo Plus. (Remember, they all run on the same Alexa software, which means they all have nearly identical skill sets!) So, if you don't currently own an Echo device, start by thinking carefully about how you plan to use it. Many Alexa skills fall into one of two broad categories: those that rely heavily on the speaker and those that don't. For example, features that benefit from good sound quality include playing music/newscasts/podcasts, the drop-in feature, and hands-free calling. (This is why I chose an Echo Plus for my kitchen - I use it every morning to listen to the news.) If you plan to use your device largely for these type of features, you would probably appreciate the better sound of the Echo or Echo Plus. On the other hand, if plan to use the Echo mainly for \"non-listening\" purposes such as voice-controlling your smart home devices, then the sound quality isn't as important and a Dot is probably all you need. In fact, you could even save some money by purchasing a 2nd generation Dot instead -- especially if it's not going to be in a highly visible location or you don't mind its shiny plastic look. I have several \"single-purpose\" Dots in my house in rooms where I want to voice-control one thing, such as a lamp in the room, and 2nd generations Dots are just fine for this -- and now that their price has gone down they are a great value! ========== Bottom line ========== The Echo Dot is an extraordinarily useful and versatile device -- one that becomes more useful all the time as Alexa's skill set expands. The 3rd Generation model has a great new look, but despite marginal improvements in the speaker, it's still pretty unsatisfying as a playback device for music or newscasts. As long as you are willing to accept its acoustic limitations, the Dot can be a wonderful device to have in your home. And if you DO want better sound quality for the features you use most often, you can always connect the Dot to your own sound system via Bluetooth or the 3.5-mm audio jack. Hope this was helpful!",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Love the Dot and its new look, but the sound is still disappointing",
                "review_rating": "4.0 ",
                "review_author": "Frederick"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "731",
                "review_text": "I had no idea I'd love Alexa so much - I wake up in the morning and she does the routine I've set up, and she's so comforting and useful and fun overall. My husband and I played Skills trivia games for hours last night. If we had kids it would be even more super useful (kids workouts, stories, games) - we even had a goodnight story read to us by Alexa and it was awesome. I'm really loving it. The Echo Dot itself is pretty great - the sound quality is pretty good, the bass when turned up is not that great, but if you really want to rock out you can connect it to other speakers or just use something else instead. I'm really surprised by how much I like the Alexa app (and the Echo Dot), because I'm a little resistant to technology, but it's pretty easy to figure out and feels like a new little buddy in the home. I'm excited to get some SmartHome stuff now so I can turn on/off lights, heat, etc. The only tiny issue I have is that for some reason Alexa doesn't pick up my husband's voice as much as it does mine - maybe because I've used it more? Really cool, though, overall - I feel like Judy Jetson!",
                "review_posted_date": "17 Oct 2018",
                "review_header": "I'm in love with this little guy! Unending entertainment and usefulness.",
                "review_rating": "5.0 ",
                "review_author": "Leah"
            },
            {
                "review_comment_count": "4",
                "review_helpful": "373",
                "review_text": "I was excited when they said it had a better speaker as the echo dot's are disappointingly quiet. Meanwhile the google home mini of the same size is VERY loud and crisp. This new version the 3.0...is somewhere in the middle. A little louder but not quite enough. I was hoping to have one in the kitchen and have it play my audio books while i clean/cook, but its still difficult to hear ti clearly over the kitchen activity. No such problem with the google home mini. Also a downside, they changed the charge port to an old fashioned pin style instead of the micro USB. This limits the places I can use it I have a small powered hub in the living room I connect my devices too and I was going to get another one of these for that, but I won't now since I can't connect it easily where I want to. I also used to bring one onto the back patio and have it powered by my Anker usb battery, but I can't do that with this one anymore. Not sure why they suddenly abandoned the micro usb style. It can easily meet the 15 watt demand the 3.0 requires. Also if you need/want a wall mount for this version, you can get one to print on thingiverse. UPDATE: Within a few minutes of leaving this review I got multiple calls from Amazon asking me to explain my review....not offering to take it back or to exchange it or solve anything for me...but asking me to explain myself. The girl by the end of the call seemed nice enough, but the fact that within a few minutes of a review I got multiple calls on my personal cell asking me to \"explain myself\" seems almost like they're trying to intimidate you away from giving an honest review. Especially since I think I gave all the relevant details in my review. Afterwards I was kind of thinking...is this like a modern \"mafia thing? Are my orders going to arrived busted up or just go missing now?",
                "review_posted_date": "16 Oct 2018",
                "review_header": "Slightly louder but not as good as Google Home mini",
                "review_rating": "2.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "237",
                "review_text": "I have 5 Echo Dots (gen 2) and we use them throughout the house for just about everything, being we have a fairly smart home. What I liked about the gen 2 versions, were that they were compact and very flexible on how you could use them. They were easy to mount in different positions and being that they used a fairly standard USB interface for the power, you could really be flexible on how and where you mounted them. The one thing that they really missed on? The well known sound quality. Enter the Gen 3... I really like the improvement in sound. Sure it is not a high quality speaker system, but for the size it is pretty good. Especially when you consider that you can pair them and add a sub for pretty good sound. The look is improved over the gen 2, however it does lose a little bit of the customability that the gen 2 had. With the gen 2, you could purchase different wraps, stands, clock mounts, wall mounts, etc. You could really customize it. The gen 3 is a bit bigger and has a much more rounded shape. While it makes it look better by itself, it lacks the ability to really customize it. It surely would not work as a power socket mount, like you could do with the gen 2, just due to the additional weight. That is before you get to the horrendous power cord and adapter. The power adapter is twice as big as the gen 2 and the power cord went away from the, easy to find, usb style cord to a old style input style and it is permanently attached to the power adapter. This is really my biggest complaint as it took away so much flexibility, that you could enjoy with the gen 2. Don't get me wrong, I am sure there will be several new cords and adapters put out to fill the gap, but that is not as easy as using cords many already have. Just makes no sense. Not to mention the cord is really long, so in areas where you want it to be a bit more discreet, this thing sticks out like a sore thumb. What I like... Sound Quality is a step up Sound Volume is much improved Base look is much improved What I dislike... Much less flexibility on how it is used versus previous version Non-standard power cord Bulky adapter Ugly long cord",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Overall improvement, but lost its flexibility",
                "review_rating": "3.0 ",
                "review_author": "Clintre"
            },
            {
                "review_comment_count": "3",
                "review_helpful": "207",
                "review_text": "I purchased two of these to replace the 2nd gen Echo Dots, and although I like the appearance and sound quality much better, the performance is lacking. The 2nd gen can hear me across the room at just a whisper, but the 3rd gen tends to require greater than 56 decibels in order to consistently hear me and I normally need to be looking directly at it. **Update: I don't know if it was a software update or the fact I hung it on the wall, but it is now hearing me flawlessly. Although no one else has complained about it that I have read, these new dots won't stay connected to my Bluetooth speakers, while the Fire TV Cube and Dot 2nd gen have kept a connection to those same speakers since day one. I have spent hours trying to get 3rd gens to connect properly. Unplugged the router, removed anything using the 2.4ghz band from the same room, hacked my neighbors router and shut it down, but nothing worked. I really hope a firmware update can fix these issues because I want to love these new dots like I do the 2nd gen.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "2nd Gen Dot is better IMHO",
                "review_rating": "5.0 ",
                "review_author": "Bitwise Operation"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "198",
                "review_text": "I was debating between this and the regular echo. I've had both and we both know what the echo does so all I'll talk about is the sound quality. I'm going to get to the chase. This is the BEST speaker I've ever heard for under $50. The functions of the echo along with the music playing functionality and the sound quality makes it a steal at this price point. The sound is great for its size. It can get pretty loud but the bass is definitely lacking. The bass isn't god awful but it just isn't there. Now I will say this... if your primary motivation for a speaker is to listen to music, go with the echo. If it is but your budget is under $50 then go with the dot. It won't blow anyone away during a get together in your living room but it'll get the job done. The dot will only flourish is an enclosed space. It needs walls nearby to bounce off to cover up the weakness of the bass. If I had to compare the sound to another speaker, I'd say the UE Wonderboom or the older Beats Pill, all of which suffer from weak bass. For the size, I was impressed by the sound but with the Echo at its refurbished price of $69 I'll have to aim towards that direction. I'd recommend this for someone who needs an echo for their kitchen, bedroom or bathroom. It's just not going to hold down a living room unfortunately but overall, I like the sound and if I need a second echo, I'll definitely get a dot.",
                "review_posted_date": "17 Oct 2018",
                "review_header": "Actually impressed.",
                "review_rating": "5.0 ",
                "review_author": "Lorenzo Martin"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "128",
                "review_text": "It's louder with better bass response compared with the 2nd generation Dot that I also have. I listen to a lot of speech and that sounded muddy compared to 2nd gen. I learned from technical support that equalizer controls are avialable. They are accessed as follows: 1. In the Alexa App, tap on the Devices icon at the bottom-right 2.Tap on Echo & Alexa at the top-left corner 3. Down below, tap on your Echo Dot 4. Down below, tap on \"Sounds\" 5. Then tap on the Equalizer -- here you can adjust the Bass / Mid / Treble Turning the bass way down and boosting the midrange helped a lot. It sounds more natural and is not as tinny as the 2nd gen model. Speech quality is not great but it's OK. For the price I think the sound quality is fine. One problem I note is that the volume steps when using voice volume control (\"Alexa louder,\" \"Alexa softer\") are large around my range of interest. It is either too loud or too soft. Using the controls on the Dot I get finer volume control and can get the volume just where I want. I had better voice volume control with the 2nd gen. Dot.",
                "review_posted_date": "22 Oct 2018",
                "review_header": "Works fine -- note equalizer controls",
                "review_rating": "4.0 ",
                "review_author": "Bob Dobbs"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "All-new Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal",
        "price": "$29.99"
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "119",
                "review_text": "Received 2 echo dots - 3rd generation. I thought I needed help setting them up. Contacted Alexa support. I was told that the computer I was using was infected and that I would have to purchase a $149.00 firewall before he could activate the 2 dots. He wouldn't discuss putting another tech on the line. I hung up and figured out what I was doing wrong and got both the units to work properly. Either the tech did not know what he was doing or he was trying to con me. I do like the product so far. Maybe my rating should be 4 stars for product and one star for support",
                "review_posted_date": "08 Nov 2018",
                "review_header": "Product good support terrible",
                "review_rating": "1.0 ",
                "review_author": "Dennis Liby"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "89",
                "review_text": "I bought this product to set up a multi room music system with my current Echo Dots. Currently, the app is being really buggy and won’t let me set up the multi-room group. Once you select one device, it automatically says the other devices cannot be reached. So annoying! Please fix this bug Amazon.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Multi-Room Setup Doesn’t Work",
                "review_rating": "2.0 ",
                "review_author": "Joel Bryant"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "82",
                "review_text": "I'm forced to use the online Alexa app because I don't own any Apple or Android device and my Windows 10 PC doesn't have the app. I'll list just a few of the problems I've had: 1) It often fails to understand what I say. 2) It often fails to respond to my voice at all, though it's only two or three feet away. It responds to dead silence just as often as to my voice commands. 3) Many commands are not executed. For example, it will not make adjustments to the audio equalizer; it will not give my daily briefing items; it will not play stations saved to my iHeart favorites. 4) There's no product support. I've sent a number of email requests to support and received no response. 5) I had a bunch of recurring reminders set up, and they worked for a couple of days. Suddenly they all vanished. These were important work-related reminders. Of course, there's no way to back them up or save them. So, they're simply gone. 6) The audio quality is poor and sounds muffled no matter what I do. Speech is sometimes unintelligible. 7) Volume is unstable. During some music it will constantly decrease and I have to keep turning it up. Then when an announcer comes on, it's loud enough to take the paint off the walls. If I'd paid significant money, I would be returning it. For 99 cents, I can't be bothered. Maybe they will improve it in the future, but for now it serves no purpose; there's nothing it can do reliably. So I put it back in the box and stored it away.",
                "review_posted_date": "02 Nov 2018",
                "review_header": "Don't rely on it for anything important",
                "review_rating": "1.0 ",
                "review_author": "Marc D."
            },
            {
                "review_comment_count": "1",
                "review_helpful": "110",
                "review_text": "When playing music, sometimes the sound seems distorted specially the highs (trebles). If it happens i have to tell alexa to change music. But after several minutes it will be distorted again. I just got it yesterday, I will observe it if it still does that I may have to return it. I’m very disappointed.",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Distorted trebles (highs)!!!",
                "review_rating": "1.0 ",
                "review_author": "2ny"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "118",
                "review_text": "So we have 4 of the second generation dots and was excited to see the new one. Set up was super fast, sound and looks great! Can’t wait for the Black Friday special where I can add a few more in the house. Want a cool stand?, we used an old bath and body candle stand, works perfect and looks great!",
                "review_posted_date": "20 Oct 2018",
                "review_header": "Looks and sounds great!",
                "review_rating": "5.0 ",
                "review_author": "David D."
            },
            {
                "review_comment_count": "1",
                "review_helpful": "64",
                "review_text": "Very disappointing. Alexis sounded like she was under a thick blanket. After talking with customer service, we tried various things which did not help. They said send it back and they sent another which I received in two days. It seemed a little better but not much. I have two 2nd gen echo dots and they are fine. I found both 3rd gens to have a very muddy bass sound on music and the high end sounds frequently were slightly distorted. Alexis' voice was so muffled that her voice was unintelligible at times. I sent the second one back for a refund and bought a second gen echo which is just fine. I think they got the design wrong on this one. In trying to make it sound fuller for music, they actually made the sound less clear and sharp. I must add that the customer service experience was a very pleasant one.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Bad design, IMHO",
                "review_rating": "1.0 ",
                "review_author": "RCS"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "80",
                "review_text": "So far so good! The voice recognition is better. I don’t have to say Alexa multiple times for it to work. This one hears me everytime, the first time. The sound is much better so far.",
                "review_posted_date": "19 Oct 2018",
                "review_header": "The voice response has improved significantly!",
                "review_rating": "5.0 ",
                "review_author": "Natasha A. Stapleton"
            },
            {
                "review_comment_count": "3",
                "review_helpful": "57",
                "review_text": "***2nd Gen Pros & Cons*** (Pros) -Brighter light -More microphones. I feel like it picks up my voice better compared to the third gen. (Cons) -Sound quality isn’t great, but I’ve always had mine connected to an external speaker via an aux cable. -Some people don’t like the design and I agree the Amazon logo on the second generation is a little tacky. ***3rd Gen Pros & Cons*** (Pros) -Really impressive [clear] sound from a small speaker. It’s loud enough to serve as an alarm clock. -Most prefer the look of the third generation over the second. (Cons) -The light isn’t as bright and that was a key feature for letting me know if Alexa heard the wake word. They’ve included an optional sound (on the app) to let you know when Alexa hears you, but I find the sound to be annoying. -There aren’t as many microphones on this unit. Maybe Amazon thought Alexa was too responsive in earlier models, but I prefer the second generation's ability to pick up my voice from across my bedroom without having to raise my voice. ***Pet Peeve*** I love that Amazon allows the same music to be played on multiple Echos, but why isn’t this feature available for Audible as well. I love the Amazon owned company, Audible. Yet, it’s a drag to have to constantly pause Alexa when going into another room. If they allowed multi-room Audible that would be extremely convenient for those of us who pay for the Amazon owned company… I prefer the second when it's attached to another speaker simply because the light is brighter and it tends to pick up my voice better. I do own 3 of the third generation echo dots and I am happy with them, but prefer the second.",
                "review_posted_date": "21 Nov 2018",
                "review_header": "2nd VS. 3rd Generation Echo Dot",
                "review_rating": "1.0 ",
                "review_author": "BAE"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=2",
        "name": "All-new Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal",
        "price": "$29.99"
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "57",
                "review_text": "I like controlling my lights and setting timers and alarms with the Echo Dots, however I'm frustrated more often than not with them. And, frankly, before having the Echo Dots I controlled my lights with Siri on my iPhone and iPad, so it's not like I'm getting much more functionality out of them. I find the Dot is constantly making mistaking. Examples: - I was trying out the music and asked it to play 'old music'. It kept repeating back, \"Great, I'll play Soul Music\", then it would start to play soul music. 5-6 times this happened. And, no, it doesn't apparently understand a negative, such as, \"Alexa, do not play Soul Music,\" because that statement immediately triggers it to say, \"Great, I'll play Soul Music\" and then it starts to play soul music again. (Nothing against Soul Music, it's just not what I wanted.) I never did get what I wanted. - I will tell it to play sleep sounds. It will tell me either that I have to download the app, which I have already done or that it can't find the sleep sound that I requested, even if it played the night before. Or worse, it will start to play music related to the sleep sound that I asked for. (I never knew there were so many songs related to rain or trains.) After a half dozen or more tries and screaming, \"Alexa, STOP!\" repeatedly, I am no longer able to even think about sleeping, even if it does finally get it right! -I will tell it to turn on the living room light and it will tell me I have to set it up in the app. It IS set up to turn the lights on and off and it has completed this command many times. Although, I am finding this command is gradually getting better, but it's not perfect, yet. -I will tell tell it to play an Audible book and it will tell me that I have to buy the book from Amazon, even though I already own the book through Audible.com (an Amazon company) and have played it several times before on that very Dot. What is most annoying is that often I just want to know something basic, like today I wanted to know what date was Thanksgiving Day. Instead of simply telling me the date, it gave me a long history of how the date came about and never did give me the date. Out of every 10 commands, it is a guarantee that 7-8 commands will have to be repeated, changed, broken down into simpler steps or started over multiple times. I find myself screaming \"Alexa, stop!\" in frustration constantly, as it rambles on incorrectly or plays something incorrectly. (And I am accent-free, with very clear speech.) Not to mention the apps, of which they tout are so many tens of thousands, are pretty useless. For instance, I had heard I could make a list on it, such as a grocery list or To-Do list. Yeah, I can, but the grocery list is in the Dot and not anyplace useful; it doesn't link to my Grocery app or Things 3 app on my computer or phone, for example. It is buried deep in the Alexa app, which is totally inconvenient. If I want it in my Grocery or Things 3 apps I have to play it back and manually transfer it line by line. Set-up, which I had read was a breeze, was anything but. I had to contact Amazon customer service, which itself is difficult to find, then it took them a good 40 minutes to help me get the Dot to work. I am very disappointed in the sound quality, too. It is not good enough to make me want to listen to music through it, at all. I will listen to books, but frankly ear buds have much better sound quality and make the listening a richer experience. When Alexa is playing something, like answering a question or giving a daily brief, the volume goes up and down ridiculously. One statement will blow you off the bed, while the other will be very quiet. Regarding listening to Audible books, now that is extremely frustrating! I bought 2 Echo Dots, one for the bedroom and one for the living room, specifically so I could listen to Audible books while moving around my apartment. Audible.com is an Amazon company, so you would think that they would integrate the linking of the Dots together for playback. Nope! After talking to Customer Service, I found out that only music can be linked to play back on both Dots simultaneously. Audible.com books can only play back on one Dot or the other at one time. How stupid is that? I find being more than 5-7 feet away from the Dot makes it very iffy on whether it will correctly hear what I say. How is it helpful if I have to walk to within a few feet of the Dot to ask it turn off the lights, when walking 3 more feet I could turn off the lights by hand? I've put the Dots so many places trying to find the best places for them and decided that I wish it had batteries so I could just carry it around. I guess this is how they get you to buy 20 of them for your apartment. I thought I would love these, but it's like thinking you are buying powerful motorcycles and getting a couple of tricycles instead. Maybe if I were into trivia and games I would like them more, but I want them to accomplish more important things, not just be toys.",
                "review_posted_date": "03 Nov 2018",
                "review_header": "Not very intelligent and extremely frustrating.",
                "review_rating": "2.0 ",
                "review_author": "Deb"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "60",
                "review_text": "I finally found a woman (Alexa) that listens and can be controlled. (Just kidding) Excellent product. This device saves a lot of time by automating my household items and by adding information and music to areas I spend a lot of time in. Eliminates the need from carrying a radio from room to room.",
                "review_posted_date": "28 Oct 2018",
                "review_header": "Finally a woman that can be controlled! (Alexa)",
                "review_rating": "5.0 ",
                "review_author": "Jazzin Sykes"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "41",
                "review_text": "I was unable to fight my way thru the Alexa App and Echo Dot settings. You need a lot of streamlining before this thing will become popular with your average user. I was disappointed too that you can't easilly use your own music with it.",
                "review_posted_date": "02 Nov 2018",
                "review_header": "Too Complicated for me.",
                "review_rating": "1.0 ",
                "review_author": "Scot Stobbe"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "35",
                "review_text": "Multiple chat supports with amazon to figure out why echo dots will randomly stop playing music across the house. Absolutely no improvement as a result of support. Apparently this is rare according to chat support; however, plenty of people report the issue. These devices should be convenient but are extremely frustrating due to randomly stopping. Sometimes 1 device, sometimes 2. I ended up returning all 3 after the issue never resolved itself and support wasn't able to suggest a fix or even a reason as to why it was happening. The concept of what these are supposed to be is awesome, but they aren't reliable. I wish a 1/2 star was possible here.",
                "review_posted_date": "19 Oct 2018",
                "review_header": "Multi Room Music functionality is completely unreliable.",
                "review_rating": "1.0 ",
                "review_author": "Nicholas W."
            },
            {
                "review_comment_count": "C",
                "review_helpful": "37",
                "review_text": "Horrible and invasive. Total invasion of private password protected networks. Overtakes private home wi-fi when it only needs blue tooth for device connection. Threw it away after one day of not being able to block the device from entering every app or website to access private accounts and passwords. A true invasion of privacy.",
                "review_posted_date": "12 Nov 2018",
                "review_header": "Throw any privacy ou the window if you use this device.",
                "review_rating": "1.0 ",
                "review_author": "rs"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "42",
                "review_text": "Unfortunately, I have already put it back in the box. It's too big, the power adapter is huge and covers multiple plugs on a power strip where the 2nd-gen adapter was a normal size. Also, I don't care for the deeper and somewhat 'muffled' sound. It's probably just me, yet the 3rd-gen is huge like a big fat donut, Amazon should just have stuck with the basics for the Dot.",
                "review_posted_date": "17 Oct 2018",
                "review_header": "I wanted to love it, yet the 2nd-gen was better",
                "review_rating": "2.0 ",
                "review_author": "so-cal"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "53",
                "review_text": "While setting up Alexa Dot, it asks for contact information sharing to enable calls, etc. Later you learn that this feature is not available (without perhaps pairing with a phone). But then there is no way to remove these contacts once you have provided them. I felt that they deliberately misled me into providing them contacts which is irreversible. I wish others who go through setup do not make the same mistake I did.",
                "review_posted_date": "25 Oct 2018",
                "review_header": "Steals Contact Information",
                "review_rating": "1.0 ",
                "review_author": "Beginner 101"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "27",
                "review_text": "I haven’t had this for a month and it doesn’t do what I need it to do when I need it to do it. I’ve done 2 factory resets, now I’m being told that I have to do a third to make it work. I just want some music and to voice control lights. This hassle isn’t worth the reward. Maybe if you have a fully automated home it’s wotht the wand trouble but for me - it’s a buggy pain in the butt.",
                "review_posted_date": "01 Nov 2018",
                "review_header": "Juice isn’t worth the squeeze",
                "review_rating": "1.0 ",
                "review_author": "AlwaysAugust"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=3",
        "name": "All-new Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal",
        "price": "$29.99"
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "25",
                "review_text": "Looks great and is louder, but this 3rd gen is HORRIBLE so far. I’ve only had it a day, but compared to my 2nd generation ECHO dot it sucks. It says it’s going to do something like play music, read a notification, etc. and then just goes back to sleep. It doesn’t understand what I’m saying at times although the 2nd gen has never had a problem. I was excited to get an updated version, but have found myself either frustrated or walking to the bathroom to ask something of Alexa (where I moved my old , but better 2nd gen Echo dot). It already did its self update. So I’m not sure what the issue is. I’m hoping it corrects itself soon:-/",
                "review_posted_date": "20 Nov 2018",
                "review_header": "Louder, but lazy:-/",
                "review_rating": "1.0 ",
                "review_author": "BFV"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "27",
                "review_text": "Not sure why i waited so long, this makes turning off lights and fans and TV's a breeze. (smart plugs needed)",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Alexa",
                "review_rating": "5.0 ",
                "review_author": "jaxson lewis"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "22",
                "review_text": "Just bought 2 of these. I've had a few 2nd generation Echo dots around my house for a year now. I was interested in the new dot both for the improved sound as well as the stereo pairing. The sound is indeed significantly better, perhaps almost rivaling my Google Home. They are much louder as well. I would have skipped getting the pair. Pairing them as a pair was pretty simple. They will only both play though if you ask them to play something off a service like Amazon Music or Spotify. I often use one of the sleep sounds Alexa skills at night and figured having a speaker on each side of my bed would create a more enveloping sound. Unfortunately, it only plays out of 1 speaker. Also, if I ask it to play a radio station it will play out of both speakers, but when I use it to wake me up in the morning with that same station it only plays out of one. I hear it's kind of the same deal with the sub. I'm tempted to return one of them since the use as a pair is pretty limited. I thought maybe I could just use a few Sonos One, but they can't do timed actions like alarms. Edit: Impressively, I posted this review in the morning and Amazon called to discuss it with me that afternoon to see what feedback I had on the Dots. I was pretty impressed that they are that on top of their reviews.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Stereo pairing isn't the greatest",
                "review_rating": "3.0 ",
                "review_author": "John"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "26",
                "review_text": "The unit is a little bigger than before amazing sound and I like the new look. Power wise you don’t have the USB option anymore just regular plug,",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Great improvements",
                "review_rating": "5.0 ",
                "review_author": "Steven"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "21",
                "review_text": "Hey, In general I love my Echo, but I got a defect product with a noises while I playing music. After a long chat with Amazon on online support channel they came to conclusion that my Echo device have a problem, there is need to say that I used her only for 2 weeks and only on weekends. I truly love this device but it s*ck that its have this problem, and they couldn't help my case because I do not longer in the U.S, I only visit there every year+ ... even a refund they disagree to offer if they will not shut down the device remotely. My reply for this solution was \"I bought this device to use it, and I don't want to stay with nothing...\" I wish there someone else who could help me in this case, I payed good money for this ($53.11) and I got a bad felling afterwards ... the agent in the support channel even asked me to send the device from the country I'm living right now but this will cost even more, and he knew that. Another funny solution he offered me is to send the device in one more year and replace it *if* I will visit again in that time frame in the US.",
                "review_posted_date": "03 Nov 2018",
                "review_header": "A defect product",
                "review_rating": "1.0 ",
                "review_author": "Dana"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "28",
                "review_text": "I had the 2nd gen Dot every since i came out, I never used it to play music, because the speaker quality was just not fit to play music. Then yesterday I got this new 3d gen Dot, and gosh, not only the sound quality improved, the volume also improved! I got chemical burn on my private part from hair removal cream due to i didn't hear the timer on my 2nd gen dot, but the 3rd gen is so loud that you'll hear it for sure! The speaker quality on the 3rd gen dot is really good, i would even say it is better than my 2nd gen Eco!!! The sound from this 3rd gen Dot is loud, but smooth, unlike the 2nd gen Eco which hurts your ears when playing at loud volume and sounds are all distorted. I would def play music on this 3rd gen Dot from now, cuz it sounds good enough for listening music and won't sounds like if you were listening music on your great grandfather's handheld radio thingy. Oh also the look of this device is much better than the previous one as well. The previous one looks like if it was only $20.... but the look on this one at least $50 lol The only reason i gave it a 4 star is because when playing music around volume 8-10 it can't hear me calling her name, and i have to scream on the top of my lung( like if someone were to stab me kinda scream) for her to hear me. So now i just walk to her and control her instead of using my voice cuz i'm too weak to scream to her multiple times a day.",
                "review_posted_date": "20 Oct 2018",
                "review_header": "A HUGE improvement in sound quality from previous gen",
                "review_rating": "4.0 ",
                "review_author": "Erik Skywalker"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "21",
                "review_text": "I bought this to replace my old Echo Dot gen 2. I am very disappointed. Alexa sounds distant and muffled. Music playback and the alarms sound normal. There is something wrong when she speaks and I have to turn the echo dot up. Only problem is, when the alarm goes off in the mornings it’s super loud. Wish they would add new volume settings is this is going to be the norm going forward. Also, very disappointed in Amazon customer service. I was supposed to have a call back yesterday morning between 8:30am-9:3am CST and it never happened. I will be requesting a replacement device and I’m leaving this bad review in part because of the failed customer service promise.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Muffled",
                "review_rating": "1.0 ",
                "review_author": "Taylor H."
            },
            {
                "review_comment_count": "2",
                "review_helpful": "18",
                "review_text": "UPDATED REVIEW: I bought my first Echo Show about 3 months ago and instantly fell in love SO, I bought another Echo Show and TWO 3rd Gen Echo Dots! Yep, I was hooked on Echo! After purchasing my new best friends I upgrading my home to a smart home with a number of Alexa enabled devices, including a Harmony Hub to control my TV and entertainment center. Everything seemed to be running pretty smoothly until sometime in October when I experienced my first \"Sorry, I seem to be having trouble\" message! Initially I thought the problem was with the echo devices until after speaking to an Amazon rep, who actually called me to check to see what types of problems I was having after my original post, I learned that the problem was the wireless router that I was using. The Amazon ripped suggested that because of the number of smart devices I had connected my internet providers default wireless router most likely was unable to handle the bandwidth of all of the devices. He advised me on what wireless router might work best. I ended up ordering a new dual band wireless routers that included a 5 gigahertz and a 2.4 gigahertz transmitter. I connected to wireless router to my modem and initially I was unable to control my smart devices until I realized the smart devices would not work on the 5 gigahertz band so I switched them over to the 2.4 gigahertz van and I was up and running! Since upgrading my wireless router The Echoes seem to be functioning quite well. There are still a few hiccups, for example when I tell my Echo Show to turn off the screen for some reason now it always asks what device. But when I repeat the same statement \"turn off screen\" it does as instructed and turns off the screen. At first I thought perhaps I was not speaking clearly enough but this literally happens every time I tell it to turn off the screen. Another thing that I've noticed is even though I have the option set to not have to say the Wake word every single time, there are many occasions where I will still have to say the Wake word right after making a request. All in all, I'm very pleased with my Echoes. In fact I just bought one for family members who fell in love with it! I use my echos as a personal assistant, which comes in handy! Having the echo link to my Google account allows me to schedule appointments and meetings and it will send notifications to my cell phone to remind me that I have an appointment for a meeting. In addition to using it to control a number of items in my home I use it adamantly to play music throughout my home. I have one of the devices connected to my surround sound system and then other devices in various rooms which gives me music throughout my whole home. I honestly can't imagine going back to not having these devices!",
                "review_posted_date": "07 Nov 2018",
                "review_header": "I Love My Echos BUT I HATE the Problems!!!",
                "review_rating": "4.0 ",
                "review_author": "Eric Wheelwright"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=4",
        "name": "All-new Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal",
        "price": "$29.99"
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "21",
                "review_text": "After following the instructions to add the alexa app I received a message that there was a problem. I tried again, and again. Finally I was referred to a website called 'fix it'. There I was told by the 'techs' that my Amazon account was in jeopardy and that I needed to buy a fire wall from them. Then they wanted to sell me some kind of WiFi adapter even though we have WiFi. Hundreds of dollars to activate a $50 item. I don't know why the problem arose to begin with, but I canceled the firewall and ended the hour long ordeal. I was charged $50 for tech time. I am returning the Echo Dot , which is functional as far as I was able to tell.",
                "review_posted_date": "02 Nov 2018",
                "review_header": "Unable to access alexa app",
                "review_rating": "1.0 ",
                "review_author": "Tom Lewis"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "19",
                "review_text": "Compre alexa, y la verdad nada del otro mundo, de la informacion que uno le solicita por ejemplo en Colombia no tiene nada. Para usuarios de USA puede ser bueno pero para sur america es poco lo que se pueda aprovechar ya que como lo dije todo funciona con base en estados unidos. si van a comprar alexa creo que puede ser mucho mejor Google Home, El idioma Español funciona pero la mayoria de las cosas o no las entiende o no funcionan. saludos y piénsenlo bien si lo van a comprar",
                "review_posted_date": "09 Nov 2018",
                "review_header": "No es Bueno Para Usuarios de Sur America",
                "review_rating": "1.0 ",
                "review_author": "Ricardo Navarro"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "14",
                "review_text": "I got a first gen dot the day it came out and have a second gen dot in most rooms of my house. I am disappointed that Amazon has made this generation worse in what I believe to be an Apple-like attempt to make it harder to let third parties make improvements. The Good: It is louder. That's it. The first two generations very seldom had an issue with being loud enough. The Bad: The speaker has more bass. This may be good for music, but it makes the voice more difficult to hear. The microphone has a much more difficult time hearing me. I frequently have to repeat myself for it to hear the wake word despite being in the same location we've had a dot since Gen 1. The wall wort now takes up about three spaces in a power strip. The first two gens fit nicely in one space. The USB cable has been replaced as the source of electricity with some odd circular plug that is permanently attached to the wall wort. This means that you can't easily switch the length of the cable. It will be harder for third parties to make things like the two wall mounts I use. I don't think any manufacturer will be able to make a tight L-shaped corner for this plug like the kind that are so plentiful for USB. Not having a USB will also make it more difficult to use in the car. With Amazon coming out with their own car version of Alexa I believe this was done to stop people from using dots in the car and to force them to buy the new device. The device is bigger than either of the prior generations. While not huge, the increase in size is noticeable and will make it more difficult to mount or make portable. The device is covered with cloth. Amazon thinks this is a plus. I guess some consumers might too. I think it looks like cheap furniture instead of a sleek piece of electronics.",
                "review_posted_date": "02 Dec 2018",
                "review_header": "Worse than the first generations",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "16",
                "review_text": "Be careful when ordering. I specifically said that I did not want nor need a payment plan and this was put on one anyway. I am having trouble getting this resolved. The problem seems to be with Amazon.",
                "review_posted_date": "07 Nov 2018",
                "review_header": "Unhappy with how the order was processed",
                "review_rating": "1.0 ",
                "review_author": "Mary A Tussey"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "16",
                "review_text": "Never played music out of the device, it is linked to a bluetooth speaker. After one day of simple questions and answers the speaker is blown. Received device as part of a promotion, wanting to get a home assistant/smart speaker I thought I'd give this a try. Needless to say I'll be purchasing a Google Home or Apple Home Pod. Had much better expectations from Amazon - very disappointed.",
                "review_posted_date": "29 Oct 2018",
                "review_header": "Speaker blew in one day",
                "review_rating": "1.0 ",
                "review_author": "Erik Severson"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "17",
                "review_text": "Horrible sound quality. Bought at the Amazon desk at Kohl’s and had for one day and am having a hard time returning it.",
                "review_posted_date": "05 Nov 2018",
                "review_header": "Not worth it at all!",
                "review_rating": "1.0 ",
                "review_author": "Linda J. Bell"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "11",
                "review_text": "I am a Google Home house. The only reason I got one Echo Dot is because there is more support and customization for home automation via IFTTT and the fact it dropped to $24 for BF. However, I used to be a Alexa user. The thing with Alexa is, you're spending more time setting up skills to make it adapt to YOUR lifestyle. Alexa is a bad conversationalist, can't work off continued conversations and has a harder time understanding foreign accents/childrens voices compared to other voice assistants on the market. Skills and customization (like IFTTT) is Alexa's selling-point, but you have to invest a lot of time in skills to make her second nature to your life. The thing I HATE about Alexa and skills is that you have to talk really long phrases like, \"Alexa, open [skill] and play [specific request]\" so for example you have to say, \"Alexa open SLEEP SOUNDS and play Waterfall\" . That is just one example, but you find yourself talking really long commands because skills can't run by themselves. you always have to tell Alexa to open a skill then use the skill, and that gets very very cumbersome when you are supposed to have many skills for your personal customization. Like I said, I ONLY have one in the Living room for IFTTT because the major smart-home-product companies release Alexa commands over Google Home commands. As a personal assistant, she's just too much work. Why I like GH is because it just works straight out of the box, you don't have to spend months to have it customized to your every whim to make it specifically tailored to you. Amazon might not even publish this review but this is my honesty.",
                "review_posted_date": "30 Nov 2018",
                "review_header": "Best for home automation and IFTTT, bad for everything else",
                "review_rating": "3.0 ",
                "review_author": "G. Kim"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "11",
                "review_text": "UPDATE: Nov 28, 2018 - I have discovered that proper placement of the Echo Dot 3rd Gen is crucial to maximize the sound quality. If the echo dot is placed against a wall and/or under a cabinet (I had mine in the kitchen against the wall and under a cabiinet) the sound becomes more muffled and much of the midrange/treble is lost. On the other hand if you have the Echo Dot more in the open, like on a table and not right next to a wall or solid object, the sound will open up more, become less muffled and provides a better overall sonic experience. This is a review of the Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal. I have Sonos One speakers, a Sonos Beam and 2-Echo Dot 2nd Generation speakers. I just had to purchase the new 3rd Generation Echo Dot to satisfy my curiosity. Wow, just blown away at the huge difference in sound quality compared to previous Echo Dot Generations. The 3rd Gen Dot has a 1.6\" speaker vs the 1.1\" speaker in the 2nd Generation Dot and it makes a profound difference in sound quality. The sound is richer, more full and has much more bass. It also plays significantly louder. If you are thinking of getting an Echo Dot, considering these improvements, there is little reason to get a 2nd Generation Echo Dot unless the difference in price is that big of an issue. Or perhaps the lack of a micro USB port will keep you away from the 3rd Generation. I will admit that I am irked that Amazon changed the power from USB powered to having to use the AC adapter that the 3rd Generation now uses. I hate wall warts and now the Echo Dot has one. It's also not nearly as convenient to have to worry about bringing a power adapter with you rather than using any old USB power. But what you give up in that department you more than make up for in sound quality. I like the appearance of the new Dot. It is more refined and has quite a bit more class. Folks with vision issues will also appreciate the fact that the buttons on the top of the Echo Dot have raised features that you can feel with your fingertips to differentiate between the buttons. Kudos to Amazon for that. The Echo Dot 3rd Generation is a big step up in quality over any previous generation of Dot. I would not hesitate to recommend the Echo Dot 3rd Generation if you are late to the party. It sill won't be an audiophiles first choice, but for the low cost this Echo Dot is a winner for the rest of us. In spite of the improved sound, it still has a muffled quality that I notice. So yes, the sound is better than previous Echo Dot generations, but it's still not excellent. You can connect to it via WiFi, or Bluetooth and the 3.5mm Aux Out (no cable included) enables you to easily send the sound to a more robust speaker that allows Aux In or to a legacy home stereo system if you desire. I didn't really need another Echo Dot in my house, but I'm glad I took the chance to check out a 3rd Generation Echo Dot. I'll happily retire one of my older 2nd Generation devices for this one. Thanks to bensound.com for the music used in my demonstration.",
                "review_posted_date": "26 Nov 2018",
                "review_header": "IMPROVED sound quality/loudness vs previous generations but still sounds muffled",
                "review_rating": "4.0 ",
                "review_author": "M. Erb"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=5",
        "name": "All-new Echo Dot (3rd Gen) - Smart speaker with Alexa - Charcoal",
        "price": "$29.99"
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "8",
                "review_helpful": "839",
                "review_text": "I got some smart plugs so that I could turn on inside lights if we come home after dark with the app on my phone. My 82 y.o. Dad lives with me & has a hard time walking & he's also losing his ability to see at all in the dark, because of Macular Degeneration. So the last thing I need is him tripping over something in the dark, trying to turn lights on!! I have an Echo & Dot in my room, which I mostly use to stream music with my Amazon Music Unlimited. I was controlling even his bedroom light & the hallway light with the app on my phone as well as my Echo. So I bought two more Dots during prime day sale. It's been a game changer!! My Dad struggled, even with the app on his phone to control the lights. Now that we have a Dot in his bedroom & an Echo & Dot in the living room, he's very easily learned how to ask Alexa to turn on the hallway light, his bedroom light when he's going to bed!! NO MORE STUMBLING AROUND IN THE DARK or trying to remember where he put his flashlight!! Since the Echo Dots all sync together, once he gets to his bedroom, he tells Alexa to turn off the living room light & the hallway light when he gets to his bedroom!! This little device is a SAVING GRACE, not only for my Dad, but for me!! I don't have him calling me to \"Show me again how to turn the lights on/off\" with his phone app!! It's like having someone else here that helps me take care of my Dad!! I made a list of the commands for the lights, etc & hung one on his night stand & put the other beside his chair in the living room!! He's also exploring, BY HIMSELF, different commands for Alexa. I've heard him ask her about the weather, baseball scores, etc. THIS LITTLE ITEM IS A TRUE GEM FOR SENIORS!! I love mine just as much & the quality of the sound thru the Echo is AMAZING for listening to music. I'm VERY PICKY about sound quality!! I have Bose speakers hooked up to my TV & have Bose ear buds as well. The quality of the sound from the Echo is just as good as Bose speakers!!",
                "review_posted_date": "20 Jul 2018",
                "review_header": "AMAZING SOUND!!",
                "review_rating": "5.0 ",
                "review_author": "Sherry the Dog Lady"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "3,497",
                "review_text": "Let me preface this review by revealing a few facts about myself. I am male, aged 75 years old, and more tech savvy than most people my age, but if you can use a modern computer, and own one, you should have not problem using this device. IT IS SO FAR, MIRACULOUS, and intriguing! I bought mine about a week ago, and waited till a couple days ago to jump in with \"both feet\" and set it up. Even though I once did computer tech support for Dell computers, It was a long time ago now, and a lot of tech has evolved since then, and i have the same fear of new things as most people my age, though admittedly higher skills. I also own an Iphone 6s plus, of which I have mixed emotions. The Iphone is made by apple, and Apple's idea of \"intuitive\" and mine are very different. Microsoft is much better at designing \"intuitive\" into an operating system than Apple. Aniyway, You will need some type of connected WIFI device to use this product. (read that Cell Phone with it's own WIFI abilities, and Bluetooth built in) You will need to download the \"Alexa App. \" on that device to set up the Alexa products. From that point on, simply plug in the Echo device into a regular 110V. wall outlet, it comes with a plug in adapter. There are no batteries in this device, although some have them. A NOTE HERE\" YES, YOU CAN UNPLUG IT WITHOUT IT LOSING ITS BRAINS AND REQUIRING REPEAT SET UP. So though not specified anywhere I read it evidently has some on board nonvolatile memory built in that will allow this. ( i spent several research sessions attempting to find this out, and finally had to bite the bullet and just try it. ) I moved it from one room location to another and within a few seconds it greeted me and said it was operational. NOW I AM ONLY AN OLD GUY WITH PRETTY GOOD HEARING ABILITIES YET, (NOT EXACTLY AN AUDIOPHILE ) BUT WITH DOLBY DIGITAL SOUND, THIS IS ONE NICE SOUNDING SPEAKER SYSTEM, FULLY AS GOOD AS MY 7 SPEAKER ALTECH LANSING ON MY PC. IT MAY EVEN BE BETTER.IF YOU HAVE A NORMAL EAR, YOU WILL BE AMAZED AT THE SOUND QUALITY! Now I am still learning about this product. Every new thing I try I am pleasantly surprised. I plan to get at least a smart home door lock and thermostat to use with it in the future, and several light switches. I am no great fan of the \"RING DOORBELL\" (due to frequently needed battery recharging) at this point, but I understand Amazon has purchased that company and will soon have an interface app available to use with the \"Ring System\" If you want to keep up with the march of technology, this device is probably your best doorway to that end, since Amazon is committed to pursuing it. Others may drop out along the way. (NEW) I made a hands free phone call to my son this moring as a test of the phone capabilities. Sound on my end was like he was in the room. The Alexa app and it's capabilities are evolving technologies. Features will be added. (Mine did an update download while playing music) Don't be disappointed. It is attractively packed, and very capable, but the \"instructions\" are not detailed and are sketchy. Lean about it online as I did before you purchase it. Read as many reviews as your eyes and attention span will allow, and take the plunge! An education awaits you!",
                "review_posted_date": "01 Mar 2018",
                "review_header": "Remember GEN 2 is an updated version of the original. be sure you're reading reviews and online info that are up to date.",
                "review_rating": "5.0 ",
                "review_author": "Gaylord"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "1,996",
                "review_text": "My mother is 84 years old and she struggles talking on a cell phone, and I struggle to hear her. She kept bumping the cell phone up against her chin, and when I talked to her I hear numerous beeps when we are talking like someone was dialing out. She is having trouble holding the cell phone up to her head. I talked my mom in to getting an Amazon Echo as a gift from me. My sister helped to set it up since I am in another state. When you make a call with the Echo, it uses the phone number associated with the cell phone that is on your Amazon account. So I changed that to my mothers cell number. So when she makes a call, it shows up as her cell phone number on the Caller ID. Now all she has to do is say \"Alexa call Greg\", and the Echo dials me up, and anyone in her contact list. She rests comfortably in her easy chair, and she can hear everything I say through the Echo, and I can hear everything my mother says very clearly. She can also ask Alexa to dial any number, that is very helpful as well. This feature alone was well worth the price of buying an Amazon Echo. My mother is learning very quickly all the other skills Alexa is able to do, weather, music, audiobooks, trivia questions, etc. Now that I am able to talk to my mother with ease. I would have to say this is the BEST gadget I have ever bought on Amazon. Attached is a Voice Mail from my mother, and how much she LOVES the Amazon Echo",
                "review_posted_date": "17 Jan 2018",
                "review_header": "A LIFESAVER for my 84 year old mother to make phone calls",
                "review_rating": "5.0 ",
                "review_author": "Gregory"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "688",
                "review_text": "I'm a long time owner of both the Echo Gen 1 & the Echo Dot Gen 2, and have been very happy with both. I pre-ordered the Echo Gen 2 and was excited to receive it. When I hooked it up and played some music thru it, and then told Alexa to stop, the music continued to play for a short burst. I do not have that problem with my Gen 1. I contacted Amazon and they sent me a new one without a hassle. When I hooked the replacement up, the same issue was there. On Nov 3rd I contacted the Amazon Echo department, and they advised me that there was a known issue with the music on the Gen 2, and it would be fixed by Nov 6th. Well, today is Nov 8th and nothing's changed, so regrettably I am returning my second Gen 2. I might add, after reading other reviews, I agree that the quality of the sound from the Gen 2 is, at best, worse than my Gen 1. Voices are muffled and music is not crisp. Amazon's claim of improved sound was my major reason for purchasing this 2nd generation device. It was indeed a disappointment.",
                "review_posted_date": "08 Nov 2017",
                "review_header": "A Disappointment :(",
                "review_rating": "1.0 ",
                "review_author": "Paul"
            },
            {
                "review_comment_count": "6",
                "review_helpful": "232",
                "review_text": "I have 3 Echo's and each one is now unplugged. If you go to the Alexa app and choose your device ---> settings and then history you'll find a long list of recordings the echo has made while secretly listening into your home. I had no idea this was happening and I find it very creepy. Nobody was using the wake word, etc. It just listened in and then recorded bits of conversation. I'm getting rid of them. **UPDATE** I discussed this issue with Customer Service who, by the way, have the best Rep's in the world. Their engineers reviewed my data and concluded the sounds being recorded were coming from a TV in the room. At first it was hard to agree with them but after I listened over and over to a few of the recordings it was apparent it was from the TV. My Bad!! I'm back to being an Echo fan. 😊",
                "review_posted_date": "28 Mar 2018",
                "review_header": "My Echo was secretly listening in on me.",
                "review_rating": "1.0 ",
                "review_author": "M. Moore"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "157",
                "review_text": "Bought one and tried echo 2nd gen and was impressed by the sound quality (it was close to \"surround sound\" quality) so I bought 4 more echo 2nd gen and everyone in my household was happy with all of 'em. After 4 months past, I noticed the sound is not quite awesome as it was (now, it sounded like \"mono\") seems like the bass is not sync, something about the sound is off. Seems like Amazon pushed out an update and downgraded the sound quality. It still plays music at sub-par quality but that's not what I paid for! Amazon, please maintain the quality of your products. [UPDATE:] 8/15/2018 Amazon's review team has informed me that they've added an equalizer feature....that's fantastic! Now I have to adjust the bass, midrange and treble myself to try and get the best sound quality....great! I know some people has requested this feature and Amazon is awesome for listening and responding to customers. When I buy a smart gadget I expect to get rid off some of the guess work but It's also good to have an override switch to everything. People nowadays likes plug-n-play, set-n-forget but also wants to tinker to get to that sweet spot, I know! people are complicated but so as music. And did I mention I have 5 of these? so that means I have to tinker on each one? and tinker again for every music being played? PROPOSED SOLUTION (for your developers): Make the echo smart enough to determine (by itself) the best sound quality for the music being played and this will be known as the auto sound feature which is shipped by default - this will cater to mostly everyone. And the equalizer will be known as the manual sound feature that will cater the rest.",
                "review_posted_date": "14 Aug 2018",
                "review_header": "Diminishing sound quality over time",
                "review_rating": "1.0 ",
                "review_author": "Mickey Flores"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "383",
                "review_text": "I purchased a 3 pack of the new Echo to get the $50.00 discount special. I had read other reviews where folks weren't happy with the sound quality of the speaker during music playback. I must admit that after I set up the first unit and played some music I would tend to agree. Flat base and a bit washed out over all. But Wait!! There's good news. As I set up the second and third Echos the first unit that had been set up for 10 minutes or so said, \"I'm updating, I'll be available shortly\". One by one each speaker received an update from Amazon and I have no idea how but after updating they sound \"AMAZING\" Full, rich base, excellent vocals and overall sounds as good as my JBL or UE Boom. If you are thinking of getting these but were afraid after reading the not so great sound quality reviews, go ahead. You will be more than pleased after receiving the updated software. AAAAA+++++ and the \"Play Everywhere\" effect sounds amazing.",
                "review_posted_date": "17 Nov 2017",
                "review_header": "I had read other reviews where folks weren't happy with the sound quality of the speaker during music ...",
                "review_rating": "5.0 ",
                "review_author": "Fiber Medics"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "71",
                "review_text": "We purchased the 1st Gen Echo as a refurbished unit for $127.00 Nov 9th 2016. Could not tell it was a referb and we enjoyed it, asking Alexa silly and meaningful questions. We also used the 1st Gen unit for music and enjoyed the fidelity the Echo provided and the Amazon music and Ihart music stations. We would have purchased more units for other rooms had Amazon included multi room music sync.By the time Amazon offered music sync between units word was out that Gen 2 was on its way so we waited. In Dec 2017 we ordered 3 more Echo's, two for the house as gifts for each other and one as a gift for a neighbor. Come Chrismas we were excited to get our new 2nd gen Echo's up and running. It was quite simple to do so and after setting up the Everywhere group via the Alexa app we had 3 rooms playing the same music, now we could have the music through out the house with out it blasting in any one room...nice. The new Echo's were a lot less expensive, even then our refreb Gen 1 Echo, They are a bit shorter and we opted for the grey fabric wrapped on the Gen 2. While I do miss the Gen 1 volume control where you counld just spin the Echo's top left or right to adjust the volume I find the Gen 2 to have the same fidelity with maybe a touch more base. All other features seem equal with the Gen 1 as Amazon keeps updating (automatically over the air) features to the entire line of Amazon Alexa devices. We have now started integrating \"Smart Home\" devices. We started with a couple of the TP plugs Amazon was providing at a greatly reduced price with the Echo purchases in Dec 2017, then I found the Sonoff WiFi switches that can be hardwired into circuits. Now our electric fireplace has a Sonoff inline and we can just say \"Alexa fire place on\" and the lighting system of the fireplace comes on or off when we tell it to. I've also hard wired Sonoff' switches to some of the exterior lighting circuits to control them either with Alexa or the app's timer feature and finally added one to the attic lights where the switch was practically inaccessible, now I just say \"Alexa turn on (off) attic lights\" before I enter the attic and I'm no longer stumbling through the pitch black attic looking for the switch. These Sonoff devices are less than $8 each! Its cheaper to use the Sonoff WiFi switches than the cost just in parts and wire to run a new light switch! Home automation is not coming, its here with devices such as the Echo and Sonoff that are scalable, easy to set up, easy to use, work well and are affordable for the average American. Thank you AMAZON for bringing home automation to our home. CON's: Wish Echo's could be grouped on more than one group. Be sure to indicate any Alexa device your buying from Amazon AS A GIFT if your giving it away, otherwise Amazon sets the device to be on your Alexa network and the gift recipient will end up with your Alexa options and info such as your shopping lists ect until deleted from your account.",
                "review_posted_date": "13 Jan 2018",
                "review_header": "2nd Gen Echo is a winner !",
                "review_rating": "5.0 ",
                "review_author": "BigAl"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "Echo (2nd Generation) - Smart speaker with Alexa - Charcoal Fabric",
        "price": "$74.99"
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "64",
                "review_text": "I was a bit cautious about buying this- but it went on sale and I figured, even if I hate it I can return it... Well, I LOVE IT! I am not a super-tech-savvy guy, but I had it set up and playing music within 20 minutes of it being delivered to my home. I used my iPad to \"install\" it (after getting the free Alexa app), and that was it. No problems. Sound is fantastic, and even though I bought it mainly for the music, I can see me using it to ask about the weather, how far it is to the nearest Domino's pizza, and how late does my local grocery stay open. If you like to listen to music and ask general questions, this is fantastic. If you are really interested, you can do all kinds of other stuff with it. I think I will keep it simple. Highly recommended!",
                "review_posted_date": "26 Dec 2017",
                "review_header": "A Wonderful Device",
                "review_rating": "5.0 ",
                "review_author": "S. R. Bullock"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "1,853",
                "review_text": "--------------------------- UPDATE 11/4/2017 --------------------------- After all the negative reviews and feedback on the poor sound quality of the 2nd generation Echo it appears that Amazon has taken quick steps to help remedy the issue. I spoke with an Amazon representative on the phone who confirmed that there has been a software update which is rolling out to Echo devices. After getting the update my Echo does indeed sound better! I still wouldn't call it audiophile-quality by any means, but the bass is fuller and the sound is less \"tinny\" overall. To check which software version you have, select \"Settings\" on your Alexa phone app, choose your Echo device, then scroll down the page to where it says \"Device software version.\" The updated version (as of 11/4/17) is 592452420 (previously it was 592452320). You don't have to do anything to get the update; it will be sent automatically by Amazon. You may see the indicator light on your Echo will pulse blue as the update is installed. The representative I spoke with said you may get it more quickly by not using your Echo for several hours. I hit the mute button on mine and received the update within a few hours. I'm very impressed by Amazon's quick response to this issue! ----------------------------- ORIGINAL REVIEW ----------------------------- As a very happy owner of three Echo Dots (2nd generation) I was glad to see Amazon release a 2nd generation of the Echo as well. After using it for several days I can say I'm quite pleased with it, and even though it doesn't have any radical new features compared with the 1st Generation Echo or the Echo Dot, there are some notable improvements. I'll summarize these differences first and then describe the new Echo in a bit more detail. Improvements over the Echo 1st Generation: - More color and texture choices - A swappable outer shell - Ability to output audio to another device or stereo system via Bluetooth or an auxiliary cable - Dolby-powered speakers - Significantly lower price! Differences from the Echo Dot (2nd gen): - Larger size and swappable outer shell (these are probably obvious) - 2 speakers (tweeter and woofer) vs. 1 - Power adapter sits flatter against the wall --------------------------- Overall appearance --------------------------- I purchased the \"Heather Gray Fabric\" version. The cloth is a polyester woven fabric made up of lighter and darker shades of gray which certainly gives it more visual interest than if it were just a solid, uniform gray. The neutral color blends in with nearly any decor, and the cloth gives it a softer look which is great for areas of your house where you don't want something that screams \"I'm a device!\" In terms of size, the Echo 2nd Generation is almost the same diameter (3.5\") as the 1st Generation Echo (3.3\"), but it is several inches shorter. To me the original Echo looked like a tower; this shorter version is much less ostentatious. The top of the device is identical to the 2nd Gen Echo Dot: it has four buttons (volume up, volume down, microphone off, and an \"action\" button), a multi-colored light ring around the edge that tells you about the Echo's status, and seven tiny holes below which the microphones sit. A new feature of this Echo is its swappable decorative shell. Simply press a button on the underside of the device and the shell slides right off, allowing you to replace it with any of the other shells that Amazon sells. I'm not sure how many people will take advantage of this feature given that additional shells are $20-30, but it could be useful if you want to change your Echo's look to match a different location in your home. A final note on appearance: the power adapter for the Echo sits fairly flat against the wall, protruding maybe 1.5\". By contrast, the Dot's adapter sticks out from the wall 2-3 inches. The flatter adapter of the Echo is nice if you want to plug it into an outlet that is behind a piece of furniture. -------------------- Audio quality -------------------- I did a side-by-side comparison of the 1st and 2nd Generation Echos, and despite the new Dolby-powered speakers I did not notice a significant difference in sound quality with either music or spoken text. I certainly wouldn't call it \"room filling sound\" in any case. Clarity isn't bad, but bass is nearly non-existent. However, the real potential improvement in sound quality comes not from the speakers themselves but from a new feature for 2nd Generation Echo devices: using Bluetooth or a 3.5mm auxiliary cable (not included), you can play the audio through a nearby speaker or stereo system. Yes, this does means you are using two devices to accomplish one thing, but in a sense it's no different than plugging any other sound source into your stereo system. To be honest, I don't generally think of the Echo primarily as a music playback device anyway other than for very casual listening (but I realize that puts me in a minority... admittedly I'm a bit of an audiophile). Compared with the Echo Dot, however, there IS a noticeable difference in sound. This shouldn't be a surprise given that the Echo has two speakers (a tweeter and a woofer) while the Dot has only one. To my ear the difference isn't so much in clarity but rather in fullness. With two speakers and a bit more acoustic \"heft,\" the Echo's sound has more presence than the Dot's, which to me makes it more tolerable to listen to for a period of time. The difference is even more appreciable with music than with newscasts or other spoken text. ------------------------- Voice recognition ------------------------- This is one area where I must confess I'm disappointed. Like the 2nd Generation of the Dot, the Echo 2nd Generation uses seven microphones beneath its top surface to recognize voice commands spoken from any direction. My wife and I both found this Echo to be slightly LESS proficient at detecting our voices and recognizing vocal commands than our Dots are. We did side-by-side comparisons of the Echo and the Dot in several locations around our house and the Dot was nearly always better at picking up our voices (and yes, we only had one plugged in at a time!). I'm not sure why this would be since both devices use similar technology, but the difference was pretty consistent. One possible explanation I can think of is this: Both devices have their microphone openings on their top surfaces, effectively pointing upward. Because the Echo is taller than the Dot, if you put both devices side by side and speak to them from several feet away, your voice will hit the Dot's microphones at a slightly more downward (i.e., direct) angle than the Echo's, which may help the Dot pick up your voice better. Obviously I'm only speculating here, but in support of this theory I have noticed that both devices have difficulty detecting my voice if I speak from below them (for example, if I'm sitting on the floor and the device is on a table). ------------------- Functionality ------------------- The bottom line is that overall functionality -- what the Echo 2nd generation \"does\" -- is nearly identical to the 1st generation Echo and the Dot. Keep in mind that the Alexa assistant software on which all Echos operate is run on Amazon's cloud, not your individual device. This means that as Amazon adds features to Alexa they automatically become available on all Echo devices. So, you can use any of them to: - Stream music via WiFi from multiple sources - Control smart home devices - Make hands-free calls to other Echo devices or phone numbers in North America - Make purchases from your Amazon Prime account - Listen to news feeds, podcasts, etc. - Do anything else in Alexa's ever-growing skill set, such as make shopping lists, set timers/alarms/reminders, play games, tell you your daily schedule, and any other skills Amazon dreams up for Alexa in the future. Personally I have two favorite Alexa skills: the Flash Briefing and the drop-in feature. The flash briefing is fully customizable daily \"digest\" of news and other information which you can hear any time by asking \"What's my flash briefing?\" There is a huge list of content you can add to your briefing including news updates, weather forecasts, sports and traffic updates, and educational snippets along with many that are just humorous or entertaining. Using the Alexa phone app or your Echo account page you can select exactly what content you want in your briefing and in what order you want to hear it. For example, I configured mine with NPR news, BBC news, the weather, and a word of the day. I love having an on-demand synopsis of the latest news from my favorite sources. My other favorite feature, \"drop in,\" essentially opens a two-way communication channel between any two Echo devices, sort of like an intercom. Simply ask Alexa to \"drop in on [the living room, the kitchen...]\" and you are instantly connected. My wife and I use this feature all the time when we need to communicate from opposite ends of the house. You can turn drop-in capability on or off for each of your Echo devices individually, and you can also choose whether each device can drop in with ANY Echo device or only those in your own home. [Note that the drop-in feature is NOT the same thing as Alexa's hands-free calling feature. Hands-free calling allows you to call most phone numbers and Echo devices in the U.S., Mexico, and Canada from your Echo by saying your contact's name or number. Just like with a phone call, the other person must choose to answer your call before you can communicate. By contrast, with the drop-in feature communication is instantly established. For this reason you will probably want to use drop-in only with your closest family and friends, and probably only for certain rooms in your home!] ----------------------------------- A few (minor) complaints ----------------------------------- Unfortunately the Echo 2nd Gen shares an annoying trait of the Echo Dot: widely varying volume levels within the daily Flash Briefing. As you listen to the briefing, some components (such as One America News) come through quietly while others (like Fox News) are much louder. I don't know whether this variability is due to differences in how each component of the feed is produced or whether it has to do with the device itself, but in any case I hoped the phenomenon would be less pronounced with the 2nd Generation Echo than it is with the Dot. Unfortunately, it is not. Just be prepared to adjust the volume at the beginning of each segment. Another complaint I have is the inability to listen to certain feeds outside of the Flash Briefing. One America News is an example here: you can listen to the channel's live feed any time, but you can only hear the channel's \"top stories summary\" as part of your Flash Briefing. This issue is probably more software than device related, but still, it bugs me. -------------- A few tips -------------- 1) The Echo seems to pick up voices best when placed at or below eye level (i.e., roughly the level from which your voice emits). Mine has trouble detecting voices coming from below it, so I don't recommend placing this on a high shelf. 2) When you select news feeds for your Flash briefing I recommend picking one U.S. source and one international source (I use NPR and BBC - both are excellent). If you add too many feeds you'll get a lot of overlap and hear the same story several times. 3) If you have multiple Echo devices in your home, sometimes speaking to one will cause others to respond as well, especially if they are in close proximity (like in adjacent rooms). One way to prevent this is to change the wake word of one of the devices to \"Echo\" or \"Amazon.\" The only downside is that you then have to remember which wake word you assigned to each device! 4) Some speakers have a bit of a \"burn-in\" period, so in an attempt to improve my Echo's sound I left it playing music for much of the first few days I had it. The sound did seem to improve a LITTLE, (the lower frequencies filled in some), but it's still not stellar. But if you're not happy with the sound at first, let it play frequently for a few days and it may improve a bit. -------------------------- Which one to buy? -------------------------- If you are trying to decide between the Echo and the Dot, think carefully about how you plan to use the device. The single biggest practical difference between the two is that the Echo has fuller, better quality sound. So if you plan to use the device mostly for listening to music, news, podcasts, or whatever, you will probably appreciate the Echo's better acoustics. On the other hand, if you want to use it mainly for voice control of smart home devices, the Dot is more than sufficient. I have a Dot in our home theater room that I use exclusively to control the lights in that room. For that type of single-purpose application anything more than a Dot would be overkill. ========== Bottom line ========== Although the Echo 2nd generation may not have any earth-shattering new features compared with the 1st generation, its significantly lower price and ability to send music to another speaker or stereo system make it a winner. If you already own a 1st generation Echo there probably isn't a compelling reason to upgrade because the difference in sound quality isn't significant. But if this is your first Echo device you will probably be very pleased with it. And if you are deciding between the Echo and the Dot, which one you purchase comes down to how you want to use the device. For heavy listening, the Echo may be preferable for its better acoustics; otherwise, the Dot is a great deal -- especially at half the price of the Echo!",
                "review_posted_date": "02 Nov 2017",
                "review_header": "Audio is IMPROVED after software update! See below for how to check it",
                "review_rating": "4.0 ",
                "review_author": "Frederick"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "2,691",
                "review_text": "So it’s been an interesting first few weeks with the Echo and am happy to say Echo 2nd Gen has finally delivered on its promise of improved sound quality over 1st Gen Echo, with the 3rd firmware since launch. If you are confused about a lot of the negative reviews, old firmware is the likely cause of most of them regarding poor sound quality. Want to keep this short and spare all the gory details, but there was a bug in the launch version of the firmware, which was fixed after a few days, but the first fix, while satisfying some, was not, in my opinion a full fix and left the mid-range frequencies muted and tinny. Today I noticed that Alexa’s voice in this unit sounded much more like Alexa’s voice on Gen 1 Echo’s I own and, after playing some music, suspected they had upgraded the firmware again, and indeed they have. The current firmware is 592452720 and it’s a massive improvement over both the original and updated version 592452420. So I decided to do some more side-by-side comparisons with the Gen 1 Echo and can honestly say in many areas the sound quality is now actually better than Gen 1 Echo. This is how the product should have sounded at launch! If I have any complaints at this point it’s that the low-frequencies loudness could stand to be bumped up just a tad. (Better yet, PLEASE add an EQ feature to the Alexa app so users can adjust EQ for the room and music type they prefer). I did my comparisons at volume level 8. Anything above that and Gen 1 Echo dynamic range starts to break down, while Gen 2 maintains quality but doesn’t get quite as loud and Gen 1. It’s the right trade off, I would rather it sound good than be louder and sound harsh. At that volume level I went thru a range of music, streamed over Bluetooth, switching between Gen 1 and Gen 2 devices, and found Gen 2 to be an improvement over Gen 1 for the vast majority of the music I tried. I’m impressed with the quality of the audio coming out of this form factor, and impressed how quickly Amazon has responded to feedback on the problems. Kudos, this Echo is a keeper.",
                "review_posted_date": "02 Nov 2017",
                "review_header": "Sound quality has been improved again! 3rd time's the charm.",
                "review_rating": "5.0 ",
                "review_author": "B. FromSeattle"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "26",
                "review_text": "Do not waste your money. I am huge fan of amazon, I bought fire stick, for my self amd ad gifts for others. I have bought 2 echos. It worked ok for a few weeks, though not as well as google home device [my sister has ine, thats great] But hey its amazon, I have bought various ereaders, [even when could have gotten others cheaper due to sales] always loyal to amazon. kindle fire for self and gifts. the 7, the 8 and 10, So when I say dont use this amazon product it is because its CRAP. the last straw was dog woke us at 3 am ok happens, as we were settling back down the echo goes off it WON'T stop no one mentioned the wird music or country or party or Alexa So when Alexa came on saying it wss going to play COUNTRY DANCE PARTY and DID LOUDLY it was something of a surprise. its simple say Alexa Stop, Right? Wrong! It wouldnt stop no matter how many times one of us said then YELLED Alexa Stop problem is wouldnt stop from pushing power button nor would volume go down from pushing volume button. Tracking wire to plug and unplugging it worked. Getting up at 3:30am to unplug the thing and now awake when I should be sleeping tells me its not working 50 % of the time is no longer slight irritating it is now a problem. A sad waste of money. Hoping Amazon fixes problem",
                "review_posted_date": "19 Sep 2018",
                "review_header": "Waste of money",
                "review_rating": "1.0 ",
                "review_author": "nowment"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "26",
                "review_text": "I still have my original gen 1 echo,... she's getting a bit tired, doesn't always hear you, been knocked off the end table onto the hardwood floor way too many times by the cats leaving her top a bit crooked and wonky,...but we still love her and she does her best to keep up so she stays in the living room until she decides she wants to call it quits. During the prime day deals I saw a 2 pack of the generation 2 echos. Seeing how the Heather Gray and the Sandstone colored echoes hopped into my shopping cart (story I told hubby) I figured it shouldn't be too hard to find a place in the house they could stay. Well the Heather Gray echo looks very nice in our bedroom and the Sandstone looks great in the kitchen. A tiny little white echo Dot (super cute) also stowed away in the cart... all three of them get along great with each other, even our original Alexa. They are grouped together in our Alexa app and can function singly or as a group. Not wanting to sound disloyal to our original Alexa, these newer models do sound better, a little bit more bass than I like but still better. The sound is deeper and richer. It could be it's because they're new, or maybe it's because Alexa had been dropped one too many times, whatever the reason they sound great and response time is quick. We have them set up to control the lights and the fans around the house using a few Wi-Fi plugins and I can also have them play the same music at the same time if I ask Alexa to play through the group I set up, ....which is great because not only does the echo have room filling sound by themselves, but as a group they completely fill the entire house with sound, love it! 😍 I love these echoes, including our original one. They are used daily for one thing or another, it's so simple to set alarms, timers, play music, ask questions, make phone calls, text someone on my contact list, even play games. It's very easy to get used to having and using them in your daily routine, they are habit forming for sure and once you have one adding a few more makes the experience even better! 😊",
                "review_posted_date": "19 Jul 2018",
                "review_header": "The best so far!",
                "review_rating": "5.0 ",
                "review_author": "KG"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "43",
                "review_text": "Not responsive. I am returning it. Amaozn is sending another one. I hope the new one is better. I also have a Dot, it response every time. I sure hope the new one works as well as the dot does. The top lights up like it hears me but nothing happen. If I give it the same command over and over again eventually it will work. Not what I was hoping for.",
                "review_posted_date": "20 Jan 2018",
                "review_header": "Not what I was hoping for.",
                "review_rating": "1.0 ",
                "review_author": "Bill"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "24",
                "review_text": "Difficult to connect. Cannot run it from my phones hotspot although that is listed as an option . The only way to connect it is by running your app on a separate device than hotspot. An unpractical solution. Having to use 2 seperate phones to run it is ridiculous. They need to stop advertising that option since ir is not a practical solution to areas that do not have high speed internet or wifi access . I spent a long time with customer service , he was rude and impatient, and didn't seem to have very much knowledge about how exactly to do his job. My time is valuable and I am very frustrated that Amazon's employee wasted my time. I am returning this device. After making this review customer service called me within 15 minutes, repeatedly while I was at work and finally after subsequent calls disrupting my work day, I answered. They were trying to make my echo experience better and asked me to connect in a different way. I told them I could not talk at that time and I didn't have the device with me anyways. I could not seem to politely get him to hang up. He kept drawing the conversation out . They said that if I put the app on a separate cell phone and used my Hotspot to connect to the echo that I could then delete the app off of the other phone and continue using the echo from my personal hotspot. But when I followed their directions and then deleted the other app on someone else's phone it disconnected me and I cannot reconnect. If you would like to use Alexa off of the home Wi-Fi it works great but they should stop advertising it as hotspot compatible because it is not a practical usage. Each and every time I go in and out of range with my cell phone to the echo I have to completely reconnect it using a secondary cell phone. It takes about 15 minutes to completely hook up the echo through hotspot, so I would have to do that when I reach the edge of my yard and came back every single time. I am very dissatisfied and I feel that it was deceptive advertising. Customer service has wasted my time multiple times now with no satisfaction to the echos usage. They are not informed about the real usage of the device or how to practically help users apply the steps of connectivity. Speaker crackles and is poor quality. I am beyond frustrated with this experience and it makes me less likely to purchase any other merchandise from them in the future.",
                "review_posted_date": "24 May 2018",
                "review_header": "Not hotspot compatible! Deceptive advertising!",
                "review_rating": "1.0 ",
                "review_author": "aubrae hersel"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "19",
                "review_text": "I tried multiple times to connect my Echo 2nd Gen to my wifi by using my cell phone and it was not possible. So then I tried to make a connection by using my laptop, and still no good. A shame, because I have maybe maybe 12 hours of music on my Amazon account and I was looking forward to accessing that music. Also asking trivia questions and weather. I'm so disappointed. I looked at other reviews and saw that the inability to connect to wifi is not uncommon. :( UPDATE: Just minutes after I submitted a 1 star review for the above issue, a wonderful service rep from Amazon phoned me. He stayed with me on speaker phone for over 30 minutes as he told me how to re-set my Echo, and walked me through wifi connection and set-up quick and easy. Then came all the good stuff! He talked me through the Settings page in the Amazon Alexa app. On the Settings page, click Skills and that's where all the fun stuff is like Jeopardy, Name That Tune, and 100s more games, ambient sound, study help, the list goes on and on. And there is much more to choose from than just the Skills tab. There are 7 tabs for info and entertainment alone.",
                "review_posted_date": "30 Aug 2018",
                "review_header": "SUPERB CUSTOMER SERVICE: Couldn't connect to my wifi, but Amazon phoned me and fixed the problem in 10 minutes.",
                "review_rating": "5.0 ",
                "review_author": "M. Dixon"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=2",
        "name": "Echo (2nd Generation) - Smart speaker with Alexa - Charcoal Fabric",
        "price": "$74.99"
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "950",
                "review_text": "Update: Amazon has pushed a software update and sound quality now sounds great. I was originally disappointed in the 2nd Gen as my original review (below) shows. Shortly after posting the review Amazon reached out to me for additional information. They contacted me again today and said they took my, and others, feedback regarding the sound quality seriously. The Amazon rep informed me my Echo was selected to be part of a test group asked me if I would want to install a new software update to address the problem. She walked me through the steps to ensure the update was applied and asked me to test the audio (she stayed on the phone while I did this). With my 2nd Gen and original 1st Gen Echo in a multi-room group (that's a really nice feature) I had Alexa fire up my playlist. I was surprised to find the 2nd Gen now sounded much improved. As I walked between rooms with the two Echo's I was also surprised that the 2nd Gen sounded better than my 1st Gen, the bass and mid-range had a better quality. Not believing my own ears I had my wife also give it a listen and she agreed. The Amazon rep said they were working with a small group of customers like me to verify the update and they would be pushing the update to all customers very soon (update to my update, looks like Amazon is now pushing out the software broadly!). You can check your software version by using the Alexa app and looking at your Echo device settings. FYI, after the update my Gen2 shows Device Software Version 592452420 (the original was 592452320). Other than audio, the Gen 2 is nearly identical to the original Gen 1 with exception of form factor. The Gen 2 is shorter (5.9\") and wider (3.5\"). For comparison Gen 1 was 9.2\" x 3.3\". The Gen 2 has many 'skin' options, I chose the fabric option. Comparatively the Gen 1 had a look of plastic and metal. The Gen 2 cover is removable so you can replace with other skins. As for responsiveness, Gen 2 specs show better microphone array. From my use I've not noticed anything improved. That said I was very happy with the Gen 1 responsiveness to commands, the Gen 2 continues to be as responsive. All other functions seem to be the same as Gen 1 including blue ring that indicates \"listening\", buttons on top to activate for \"Alexa\" and button to mute the microphone array. There is also a 3.5mm jack port and bluetooth to connect to other speakers. There is a design change, with Gen 1 you would turn the ring to change volume, that's been replaced with +/- buttons (following same design change as the Dot releases). ---[Original Review - 1 Star]--- I bought my first Amazon Echo back in 2014. Since then I've added a second Echo (1st gen), a tap and 3 dots. I've added Vaux Cordless Home Speaker VAUX Cordless Home Speaker + Portable Battery for Amazon Echo Dot Gen 2 Gray/Ash to two of my Dots. I've given Echo as gifts. In other words I'm all in on Amazon Echo system and have been for a long time. Amazon advertises this as 2nd Generation as \"improved sound\". I thought the original Echo (1 gen) sounded great so I fell for the 2nd gen hook, line and sinker. Unfortunately after listening to it I find it's a sinker indeed, or perhaps a stinker. I did an informal test with my 1st gen and new 2nd gen Echo. I had them both play a set of songs. I'm just going by what my set of ears tells me, but the 2nd gen is DISAPPOINTING when it comes to sound quality. While it does seem to have a deeper bass, the overall quality sounds tinnier than the 1st gen. Whatever \"powered by Dolby\" is supposed to bring to the 2nd get unit is not much, this 2nd gen is just not up to par with the original when it comes to audio. The unit otherwise functions like the original and other than the form factor I see nothing that's an improvement. I haven't seen that it \"hears\" better. And it doesn't sound better for sure. Perhaps I'm too focused on the sound of Echo 2nd gen, but when Amazon makes it a point to expressly market it as being \"improved sound\", I'd expect the sound to be noticeably improved. It doesn't and therefore give it a 1 star rating.",
                "review_posted_date": "02 Nov 2017",
                "review_header": "Audio Now Sounds Great after Software Update - Read Review for Details",
                "review_rating": "5.0 ",
                "review_author": "Bob and Sherry"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "19",
                "review_text": "GETTING CLASSICAL MUSIC IS PROBLEMATIC...AFTER PICKING SAY AN OPERA OR SYMPHONY IN THE DIGITAL LIST ONE HAS TO TREAT EACH MOVEMENT OR ARIA AS A SEPARATE \"SONG\"AND THEN SAVE IT FOR YOUR PLAYLIST I COULD NOT MAKE AMAZON CUSTOMER PEOPLE UNDERSTAND THE PROBLEM...AND THEY REFERRED TO EVERYTHING AS \"SONGS\" . SOMEONE WHO IS MORE FAMILIAR WITH THIS MUSIC SHOULD SEE IF THEIR IS A WAY TO GET THE COMPLETE SYMPHONY OR WHATEVER WITHOUT HAVING TO SAVE EACH PART ..JUST THE WHOLE IN ONE SHOT OTHER WISE THE DEVICE IS AMAZING AND IT IS A KEEPER I WAS IN TOUCH WITH AMAZON TECH SUPPORT AND FOR SOME REASON THEY WANTED ME TO LIST THE ALBUMS THAT ALEXA WONT PLAY....THE AMOUNT OF ALBUMS THAT ALEXA FAILS TO PLAY IS LARGE,,THAT IS MOST ALBUMS EVEN THOUGH THE ALBUM MAY HAVE \"play with your echo\"..ON THE SITE....I GAVE THEM A NUMBER OF ALBUMS...BUT THE TECH TEAM SHOULD DO IT ON THEIR OWN..I ASSUME THEY HAVE AN ECHO...THEY WONT AND THEY WONT FIX IT",
                "review_posted_date": "16 Apr 2018",
                "review_header": "IN ADDITION MOST OF THE RADIO STATIONS LISTED BY AMAZON FOR ALEXA DO NOT PLAY...GO FIGGAH!",
                "review_rating": "3.0 ",
                "review_author": "Herman Rosen HERMAN ROSEN"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "20",
                "review_text": "I saw no reason to get one. I've lived 60+ years without one. But then my 80+ yo friend raved about hers. She calls her friends, plays music, orders from Amazon, etc. She had me over to show me what it could do. Hmmm, it sounds darn good! And so easy. So I came home and ordered one. Love it. No fumbling around with CDs or LPs on the stereo. No more radio stations fading in and out and with static. Wow. The sound quality is good enough for me that I'm seriously considering getting rid of all my stereo equipment and music collection. It's now all there in this little gadget. I've even re-ordered stuff from Amazon through Alexa - so easy. Have yet to do phone calls, one thing at a time :) I have only one regret - that I didn't order two while they were on sale.",
                "review_posted_date": "07 Jan 2018",
                "review_header": "Why didn't I buy this sooner? My life is easier!",
                "review_rating": "5.0 ",
                "review_author": "A. Scales"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "36",
                "review_text": "The Echo speaker as such is great. Nice design and really good sound quality for it's size. However, I bought the device to play music via Alexa and that is what makes the whole package a very disappointing and frustrating experience. Alexa's voice recognition is just awful. She doesn't understand the name of bands, she doesn't understand the name of albums and then sometimes just plays something that is far away from what we would to listen to. My spouse tried as well (I thought it is maybe me and my inappropriate pronunciation) and we both fail way too often to make this a pleasant and satisfactory experience. Bottom line: Echo device is nice but the really weak link is Alexa whose voice recognition is so much worse than Siri.",
                "review_posted_date": "12 Jul 2018",
                "review_header": "Alexa is the weak link and derailer",
                "review_rating": "1.0 ",
                "review_author": "Dirk B."
            },
            {
                "review_comment_count": "1",
                "review_helpful": "15",
                "review_text": "Welcome to the Amazon bait and switch. It’s called the Echo. I was a preorder and I had one of the first units and then added 3 more to my house. I used the Amazon Music Match service to get all my ITunes onto Alexa. All was well and I used it regularly. Then disaster struck. Amazon suddenly cancelled the Amazon music match service in an attempt to get you to pay a monthly fee for Amazon Music subscription service. This service has less then 40% of my music available on it and is drastically more expensive then match. I have 4 Echoes for sale and a Fire TV and Tablet. This bait amd switch taught me a leason. Do not trust Amazon products and features as they will be taken away to your detriment.",
                "review_posted_date": "02 Oct 2018",
                "review_header": "Removed my most important feature after I bought them.",
                "review_rating": "1.0 ",
                "review_author": "Mac75"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "18",
                "review_text": "The Achilles heel of Amazon’s Alexa system is having to reset the devices every day. My Charter internet service sucks and if I lose internet service for just a few seconds the 6 Amazon Alexa devices become unresponsive and have to be reset EVERY TIME, and unfortunately the only way to rest them is to unplug them, and since most of the plugs are out of reach, my only option is to unplug the wire at the device. The tiny little connection feels like it’s going to break every time I try to insert it back in the hole and I’m sure that eventually it will break. WHY ISN’T THERE A WAY TO TELL ALEXA TO RESET THE DEVICES?!?!?! Or better yet why can’t the devices just reconnect to the internet if they loose their connection?!?!?!?!?!?! It’s the only thing that sucks about this system, but it’s a big issue, and makes me wish I’d never invested so much in these devices. Try to imagine every day when you come home from telling Alexa to turn the lights on, but instead of lights you get “BLONG - I’m sorry but I’m having trouble connecting to the internet...” and since all my lights are connected to devices, controlled by Alexa, I have to unplug Alexa, wait for it to reconnect before I have lights. And then I have to walk around unplugging, and almost breaking each Alexa device. Fix this $h!+ Amazon!!!!!!!!!!",
                "review_posted_date": "17 Mar 2018",
                "review_header": "Achilles heel",
                "review_rating": "1.0 ",
                "review_author": "James Dee"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "24",
                "review_text": "spend more time repeating myself and resetting items. if you have a few of them the issues will start. note, i have overkill on my internet download speed. averaging over 100 MB download speed. and customer support is non existent ,,they claim they will get with tech and respond back with help, but it never happens. if you are looking to use several as a group for music forget about it, you will spend your time resetting the items and have issues getting them to all play at one time for a group. i have tried three times and the customer support has simply blown off this issue , have never received help or a response back. BUYER BEWARE!!!! wasted over $1000.00 on these things outfitting my house with them huge mistake. all worked fine when i only had two devices",
                "review_posted_date": "07 Jun 2018",
                "review_header": "wasted over $1000",
                "review_rating": "1.0 ",
                "review_author": "The Cat"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "17",
                "review_text": "Really good device with a large, ever growing ecosystem of capabilities and connection options. Really love how useful it can be, however, there are a few things of note: - Google Assistant is much better at understanding my voice, and interpreting what I mean. Your mileage may vary of course (different accents), but Alexa gets 3/5 for understanding me, and Google Assistant gets 4/5 (Srini is 1/5 and Cortana 2/5). - This specific device has had some challenges keeping a connection to my WiFi (very rarely though), while my Echo Gen, and Google Home Mini does not. Maybe a slight defect, or further firmware updates needed in future (currently at lastest version) but still... The audio is much better than the Echo Gen. 1 which is really nice when listening to music, even though it is not a high end stereo system. Overall I really like it and recommend.",
                "review_posted_date": "01 Jan 2018",
                "review_header": "Good device with large ecosystem",
                "review_rating": "4.0 ",
                "review_author": "Stuart Wong"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=3",
        "name": "Echo (2nd Generation) - Smart speaker with Alexa - Charcoal Fabric",
        "price": "$74.99"
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "24",
                "review_text": "#Update: Dec 20, 2018 Have had this device for almost 10 months now, and have hooked up smart lights that connect to Alexa. Morning alarms synced with home lights turn on / off, news functionality, and music capabilities still impress me till date. It is something I have gotten used to and I really feel odd when I am traveling and have to stay at hotels - makes you kind of miss Alexa and how so many things can be done by just asking Alexa. That being said, as many other reviews mention, its very, very easy to get used to Alexa and Echo. Best purchase I made from Amazon ever. #Initial Review: Feb 27, 2018 Initially I was a bit hesitant in spending this much money on a smart speaker device, but when I saw it at someone's house and just how responsive and intelligent its answers were - I couldn't resist buying it. I have had it for a few days now, and I have to say its unbelievably good! At the very least, you get a great speaker - the audio (both treble and bass) is phenomenally good - although I have to give a disclaimer - it does really well in a small/medium sized room, but I am not sure of how good the acoustics would be for large rooms or open spaces. Alexa: Aside from being a fantastic speaker to play your music, there is Alexa (now it starts to get exciting!). As a lot of other reviews have mentioned, it can do many things. My personal favorite is the alarm functionality in the morning and that I can just tell Alexa to snooze for 5 minutes, or set it up to play a specific genre of music for the alarm. Also, the news summary is a great way to start the day, which can be easily had by just asking Alexa - whats the news? It can do a lot of standard functions that the smart assistants on phones do - such as call / text/ set a reminder, etc. The game feature (you can play games like jeopardy, song quizz, etc) is fun, and the microphone is really good - such that it can even hear me whisper \"Alexa\" when I am near the device, and even when the TV is loud, you don't have to scream to call Alexa. Other functionalities: Pairing with other Alexa enabled devices such as light bulbs, switches, and other smart home devices. I haven't tried it, but really curious and would probably be getting some of them in the near future. Bonus Feature (this is really amazing!) : If you are already using the fire stick TV (or are planning to buy one) Alexa works seamlessly across the devices, so you can control your TV with the echo using voice. Its a game changer. You can just ask Alexa to open certain movies or open certain apps, and its that easy. Watching Prime videos is such a breeze, such that you can start a movie, pause, fast forward, or rewind by just asking Alexa on the echo.",
                "review_posted_date": "27 Feb 2018",
                "review_header": "Alexa / Great Speakers / Echo + Fire Stick TV = Fantastic TV Experience!",
                "review_rating": "5.0 ",
                "review_author": "Piyush"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "15",
                "review_text": "I am fully supportive of the Amazon ecosystem. I own Kindles, Fire tablets and both a 1st Gen Echo and 1st Gen Dot (neither of which has given me any issues). Technically speaking, even after a firmware update, this 2nd Gen Echo is still freezing when issued commands (sporadically but daily) and the audio quality is lacking as compared to the 1st Gen Echo (yes, I do understand that the 1st and 2nd Gen Echoes are designed differently). I'm conflicted and confused... as all publicity and everything leading up to the release of this generation of Echo would indicate that this model would be equal to or even surpass the 1st Gen Echo. Sadly, this doesn't appear to be the case. For those that are curious, yes, it has the latest firmware, as of the writing of this review... and I have deregistered and factory reset this 2nd Gen Echo several times... with the same results. As I wrote earlier... I remain conflicted about this device. I have high hopes for it... but, at present, I'm not sure where my confidence is with it.",
                "review_posted_date": "09 Nov 2017",
                "review_header": "I am conflicted",
                "review_rating": "3.0 ",
                "review_author": "ABCruz"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "12",
                "review_text": "We got the Echo (2nd gen), plus we have the 1st generation, and in the right room/space, the new one's sound is perfectly acceptable, and we are always trying for better sound at reasonable prices. Echo 2 doesn't compare to \"higher-end\" devices/music setups/speakers, (and that's not a claim from Amazon). It's good...good enough not to be distracted by the quality of the sound. We own extreme music components and still have no problem with the sound of Echo 2 because it's very good sound for what it is. What we did have a major problem with was setting up our the Echo (2nd Gen), following the same directions multiple times. I use a LOT of tech with no problem. The setup of an Echo could/should be easier and less ambiguous. Some things in the Alexa App's instructions need to be much more clear about what the next step is. It may have just been connection problems, but it wasn't until my 5th try that it finally hooked up. That's just crazy. Overall, we like the 2nd gen Echo quite a bit. I gave the device 4 stars (it's really 4.5) because of setup mania and the fact that the sound is better on the 2nd gen, but not A LOT better than the 1st generation. That said, though, $99 is an absolute steal for the quality of this device. Highly recommend.",
                "review_posted_date": "27 Jan 2018",
                "review_header": "Worth Every Penny And Then Some.",
                "review_rating": "4.0 ",
                "review_author": "Richard Spafford"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "10",
                "review_text": "I bought an Echo Gen 2 about 4 months ago. In the past month music, particularly Amazon Music Unlimited, has been dropping. It plays for a bit, 1-5 minutes, then drops out. I contacted Amazon today through chat. They had me on there for over an hour and transferred me to 4 different agents, 2 of whom were supposedly technical specialists. They had me reboot. They had me factory reset. After an hour of this, the problem kept occurring. None of the reps had any ideas. They kept trying to blame my internet service. (I have between 85-120 Mbps where the Echo device is located.) I got so frustrated I ended the chat. An email popped up urging me to accept a call to resolve the issue. OK-- I accepted a call. A rep got on and we began discussing the problem. Then the call abruptly disconnected. Very frustrated, I just left it alone for a while. A hour or so later I figured I'd take another shot. Called again. Went through the same routine. Reboot, reset, the problems kept happening. The agent was even on the phone when these events occurred and heard the problems. I got put on hold several times. Finally, after an hour of this, the rep comes back and says I need to contact my internet service provider. Like it was the internet's fault, rather than a malfunctioning Echo. I'd had it. I said that the device was the issue. I have many other Amazon Alexa devices (Dots, Spots, Taps, etc) and none were having a problem. I simply wanted them to fix or replace the faulty Echo. Easy. The thing is only 4 months old and has some issue. They refused. I just hung up again, more frustrated than ever. Extremely poor customer service from Amazon. I've been a Prime customer for many, many years. I buy most of my stuff from Amazon. But this experience has led to a very bad conclusion. You sometimes hear about what might happen after Amazon fully conquers the retail world. I think I just got a taste of it. Don't buy this product. ***Update- the day after I posted this review I received a phone call from a customer relations supervisor. The individual was very nice and solicitous and offered to replace the device. I accepted. My take-away from this experience is that Amazon does eventually listen to its customers and also carefully monitors product reviews. I do not blame any of the customer service representatives for my bad experience. Rather, I believe the problem was a systemic one in which the Amazon customer service / technical support system was directing the reps to certain conclusions and to take certain actions. The end result was to look for fault in environmental factors (ie: bad internet / wifi service) rather than to the device itself. My recommendation to Amazon, again as a long-time customer (I remember when they just sold books), is to allow the customer service reps greater latitude and discretion or implement a system that is tuned better to accepting information from customers so that loops in which people are asked to perform repetitive tasks are not constantly repeated from one agent to another. I also feel that there was a bias in the system which directed the reps to look for external issues rather than look for fault in the device itself. There was no reason why a 4 month old device, which is still under warranty, required hours of basic technical support / customer support, given that information was provided (area wifi speeds, confirmation that other devices were functioning properly) to indicate that the fault may be internal. Ultimately, the faulty device is being replaced with a refurbished Amazon Echo. That was the solution I had been looking for since I first began the process. I feel that Amazon's systems did both myself and Amazon itself a disservice by provoking such an unnecessary series of events. I do thank the reps for their time and efforts and ultimately Amazon has proven itself to respond when given enough incentive.",
                "review_posted_date": "03 Nov 2018",
                "review_header": "Amazon Customer Service- Updated",
                "review_rating": "1.0 ",
                "review_author": "History Professor"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "11",
                "review_text": "Pretty much doesn't do anything I wanted it to do. Useless as a doorstop. I got to 1. keep an eye on the weather. 2. Be able to send messages by voice without my cell phone. 3. Use voice commands to use iTunes playlist. So..in regards to 1 - will not give me local weather, I get weather from some city miles away. I've input my location over and over and over and over again. Hit save. I still get weather from Manassas VA instead of Washington DC. In regards to 2 - when I put my phone number in I get a message that my number is already linked to an account which it is not since I just got the damn thing. And 3, I realize that Apple and Amazon hate each other but really? If I can link it to my iPad I should be able to use a voice command to change the playlist and not have to manually put it in.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "Only real use seems to be as a doorstop",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "18",
                "review_text": "What needs to be said that isn't good about this gizzmo. My wife passed away from Alzheimer's Dec 10, 2017. That being said, I'm alone in a 2K Sq Ft home by myself and My Shih-Tzu Angie. Then comes Alexa. Took a bit to get it going as I'm 75 so go figure. I love what it can do. Can't have a conversation with it (fortunately) else the white coats carry me away. But I always say \"Alexa, Good morning\" just to hear what algorithm was chosen to speak. Always interesting is the reply for that particular day. Fairly good at math too. Ask it \"How much does the Earth Weigh\" and a sequential answer from Septrillions down to the hundreds in pounds then repeated in Metric. If I ask what does the Earth weigh I get something to the -24 (the short version) so praising the question is important.to the answer. Plays whatever music I wan't. Will do more as I learn. Bravo to Amazon and Alexa's designers.",
                "review_posted_date": "14 Apr 2018",
                "review_header": "This Is A Must Have For Those Single Adults",
                "review_rating": "5.0 ",
                "review_author": "Doc Denny"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "18",
                "review_text": "After struggling and a Little Help from customer service I was able to get this thing connected. Seems to be working okay now, still a bit buggy with the voice commands. I'm hoping it gets better as time goes on. Seems to be nice enough, not really sure if I actually needed this or not. I will say that Amazon has awesome customer service, within a few minutes of posting a poor review I had gotten a phone call and emails on how to resolve the issues. This is why I love Amazon and why they crush the competition. The jury is still out on whether I needed this thing on the even like it, but once again Amazon came through with their service. I was never informed that I have to pay an extra $78 a month for the Amazon unlimited streaming to use this device properly even though I'm a Prime member. So now I have something I didn't need any way that's going to cost me extra money. I could care less about the extra money it's just the point of the matter and I'm very very unhappy with Amazon now. My recommendation is not to buy",
                "review_posted_date": "24 Mar 2018",
                "review_header": "Dont buy unless you plan on paying extra for streaming",
                "review_rating": "1.0 ",
                "review_author": "Mike"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "10",
                "review_text": "We’re pretty fully into the Amazon Echo’s. We’ve got two bigger echos and three dots. This was bought to replace a dot, and I have to say I’m impressed. First off it looks so much nicer than the original. Before the echo was very sterile looking. Now it looks much more classy and inviting. Almost like it belongs in the home / matches the decorè much more seemlessly. The fabric is very welcoming and appreciated. The size is more manageable, too. We played the same song on both the new and old speakers. While it’s not something that is going to blow you away, it is pretty significantly clearer, vocals are cleaner, and bass is more full. The sound was good enough for us to replace the one in the kitchen and move that one in the old dot location. It also has a coax connection for other sources as well. This is not something the original had, so that’s a nice touch (even though most manufacturers are steering away from coax) The bad? I liked the volume ring that you could turn. I know it’s one of those things that cost extra, and you can use your voice and the volume buttons, but I still enjoyed having the ring.",
                "review_posted_date": "27 Nov 2017",
                "review_header": "Looks great, sounds better than original!",
                "review_rating": "5.0 ",
                "review_author": "Bendy (Ben and Randy)"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=4",
        "name": "Echo (2nd Generation) - Smart speaker with Alexa - Charcoal Fabric",
        "price": "$74.99"
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "C",
                "review_helpful": "9",
                "review_text": "I started looking at the Echo when it first came out, I was immediately fascinated with it, but decided to hold back, mostly because of the price point. I decided that for Christmas and my birthday (just a few short weeks after Christmas) I was going to get one. Instead of searching my wish list for the Echo I had added long ago, I decided to just search for it. And so glad I did, because the 2nd gen popped up, and at a smaller price point at that (I did pick up when on discount for holiday after all). I anxiously awaited the delivery, which happened to be a day earlier that what I was told it would be, and I immediately tore into the package as soon as it arrived. I have been loving it. I use it to set up a backup alarm to wake up to, I get my news flashes from Alexa, Ive played trivia with Alexa, and she is great at helping find just the right music to listen to. Oh, and did I mention, she can control my Fire TV as well!! I have loved it so much, I decided to look into the Echo dot to put throughout the house, especially the kids room so that I don't have to leave my phone in there playing music till they fall asleep when over at my house. So the New Year comes and goes, and I decide that I was pretty good the previous year, and my birthday was in just a couple weeks, I went ahead and bought 2 Echo dots to go with it. The only regret so far is that my 5 year old daughter won't quit asking Alexa to tell her jokes lol. I highly recommend. It has great sound, Alexa is awesome, and the new and improved design makes it great in any decor.",
                "review_posted_date": "09 Jan 2018",
                "review_header": "Why didn't I get one sooner?!?!?!",
                "review_rating": "5.0 ",
                "review_author": "Robbie Hadley"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "30",
                "review_text": "I originally just wanted the echo, but thought the package deal with the bulbs would be a nice addition for the price. The set up and execution of these bulbs just to pair it with the echo is pretty poorly executed. If I would have known all this from the start I wouldn’t have purchased the package. It’s bad enough that you have to connect this square device to your router and follow all these benine instructions, but you also have to download there app so you have to have the Alexa app and there app to set it up. Too many steps and apps to worry about. This is supposed to make life easier not create a new set of hoops and problems to jump through.",
                "review_posted_date": "13 Oct 2018",
                "review_header": "Overall Disappointed",
                "review_rating": "3.0 ",
                "review_author": "Justin"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "8",
                "review_text": "Little or no FM radio reception here. Yes I have a collection of Bluetooth speakers but the music selection and the multiple steps to connect and control audio via phone/tablet/PC are a PITA. For years, I was concerned about evesdropping and ignored the Echo phenomena. That said, in a moment of weakness I ordered a Dot and my world changed. I use it in my study with and without paired Bluetooth speakers and I do not have to lift a finger to switch between the output or play anything from SiruisXM to radio stations to digital music collections and more. The very next day I ordered an Echo 2. The living area is another situation. Sure I can pair my phone/tablet to the high-end Sony soundbar to rock the house but yet again, it required multiple steps to do so and control it. Since the SO is mortified by any kind of unapproved music forced upon her, I decided to emply an Echo 2 so that I can quickly start, stop and control radio and unlimited music selections with as little drama as possible from the breakfast table. I can now blabber to Alexa in any tone of voice in order to get the job done. Plus, both the Dot and Echo 2 have hearing that is far better than mine. She responds without error from across a large living area even when music is playing. Damn the reviews but the sound quality is plenty good enough and you can easily connect it to other speakers if you want to host a house or pool party. Dot aside, I really do not understand all the griping about sound quality. I was delighted that the Echo 2 has enough fidelity and volume to satisfy me and annoy the SO. The Echo product family is supremely engineered and one of the best products that I have ever purchased--and there have been too many to count. Disclosure: After Dot, I uploaded my entire digital music collection to Amazon Music. While it is comparably under-featured when compared to other mobile players, it works very well with the Echo products and I can listen to my collection sans zero drama and effort. UPDATE: After nearly a week of listening, it is true that the lower mid-range of some types of music and individual tracks are muddled and Alexa's voice and voice output in general is a tad loud with too much bass. However, I am confident that an update will eventually smooth everything out. That said, I wish equalization was available in the Alexa app in order to tailor the sound for the environment and the type of music. I also found that speaker placement is critical. At first I had it 8\" from the wallls in a corner which caused the bass to boom. I moved it in front of a flat wall and it sounded better. I think that the further away from walls the better in order to accomodate the 360-degree sound. I think that ultimately it would sound the best in a middle of a room but who has power outlets located there (a kitchen island comes to mind)? Finally, I would like auto sound levelling because when my daily briefing switches from staid and bassy NPR to noisy Reuters TV, the volume jumps condsiderably. Nevertheless, I still LOVE this well-designed piece of kit but note that I use it like a radio at mostly lower volumes. Thanks Amaon for bringing back a hands-free radio+ experience for somebody that gets minimal radio reception.",
                "review_posted_date": "14 Nov 2017",
                "review_header": "A savior for this radio and music lover. Updated.",
                "review_rating": "5.0 ",
                "review_author": "Theodore L. Wirth"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "7",
                "review_text": "I like the color. I like the sound of the speakers. I have been using this since January without many issues. I do wish I could change the bass in it as some songs can be a bit strong (Migraine sufferer here). But, I haven't taken the time to research that yet. PROS: It plays music for up to 6 hours (timer setting), this is also a con, if you don't have an 8-10 hour playlist and you're just listening to a station. Alexa will read your Kindle books to you. I no longer have to have a battery operated radio to play music for the dog when I'm gone during the day. (yes, he's a baby, and it helps calm him). You can set reminders (helpful in our household). CONS: The updates seem to hit when I need it to play music. Not sure if there's a setting for that either. The sound when it plays your audible book vs your music is lower for audible (so if you stop playing your audible book, and then the next time you use that speaker for music, it's super loud). The timers are softer sounding than I would like, and I do have it turned up (music plays louder than the timer).",
                "review_posted_date": "30 May 2018",
                "review_header": "Alexa, how have I survived without you?",
                "review_rating": "4.0 ",
                "review_author": "Snow Angel"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "30",
                "review_text": "I just bought this new model for a room which belonged to my late wife and which has not been used for almost 3 years. It is quite remote from the rest of the house, so it deserves it's own Echo. This is my 6th Echo in a 2,400 sq ft (2 floor) house. I bought the original Echo two years ago then added 4 Dots to that and now this handsome new Echo. They all function independently and together (music everywhere !! ... without latency issues). I probably use all of them for \"smart home\" control (more commands than any other type) of 9 WeMo switches, a Nest thermostat, and a NEXX garage door controller. I now live alone and it is an extra feeling of security to be able to turn on lights in the house when arriving home after dark. I have an extra loud doorbell (not WiFi controlled) which I wouldn't be able to hear in this newly remodeled room under any circumstances...so my next smart home addition will likely be a WiFi (Alexa controlled) doorbell (incl. video camera). My Dots all have accompanying JBL Bluetooth speakers (however, they're hard wired due to the limitation on Bluetooth in a shared network, i.e. \"music everywhere\" only works if speakers are internal or hard wired). I don't find this to be a big deal. I'm glad that they are Bluetooth speakers for travel purposes, but that is not necessary on a day to day basis. However, I really like the sound of this new unit...it may be just a touch better than the original \"large\" Echo (both are superb for the intended purpose). In this new office and for casual listening the internal speaker is plenty good. If I \"require\" serious listening, I can play the sound through my media system or high-end stereo speakers if necessary. I also use Alexa for information, stock market reports, flash briefings, frequently for time information when I can't see a clock, and for weather reports. All of my married children have Dots (which I gave them for Christmas in 2016), so we're going to be working on setting up telephonic connections very soon. For me Alexa is a voice in an otherwise silent house...a side benefit. Over these past two years she has acquired many skills, but I'm not sure she's any smarter with regard to interpreting my statements to her or wishes of her. BUT what I do appreciate is that for tasks she performs I don't have to memorize a script to use her. She responds to natural speech well enough to control all those things I wish to control.",
                "review_posted_date": "01 Feb 2018",
                "review_header": "#6 of a growing harem of Alexas.... :)",
                "review_rating": "5.0 ",
                "review_author": "J. Bevan"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "7",
                "review_text": "I love this little guy. After returning Beats Solo 2 headphones (painfully tight) and a Bose Soundlink color 2 (not so good), I purchased this Echo from Staples (didn't want to possibly return a third item to Amazon). I don't have a lot to say except that I am so happy with it. Of course its only been one day, so time will tell. I think the sound quality is very good. The hands free aspect is great, play a song, set a timer, set an alarm, reminder, whats the weather, get the news, how many teaspoons in a tablespoon, you get the idea. The best yet for me is the ability to tell it to make a phone call. What a wonderful feature for someone who lives alone. I'm no audiophile but to me it sounds better than the Bose. All in all, I think this is a great buy especially now when its on sale.",
                "review_posted_date": "19 Dec 2017",
                "review_header": "What a useful companion",
                "review_rating": "4.0 ",
                "review_author": "Josephine"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "10",
                "review_text": "Bought this for my wife for Christmas. I gave it to her today and this thing is awesome. Easy to set up which is what I worried about the most. Great sound, and does exactly what it's supposed to do. Pretty cool little chunk of technology.",
                "review_posted_date": "23 Dec 2017",
                "review_header": "Very nice!",
                "review_rating": "5.0 ",
                "review_author": "Eric Hughes"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "6",
                "review_text": "Can't understand much. I get so frustrated trying to get it to play music and it doesnt understand commands unless perfectly formulated in specific ways (I am native English, so not an accent issue). I just got done arguing with her because it says \"streaming on another device? would you like to stream from here instead.\" but it neither understands \"yes\", or \"Alex, stream from this device\"...or \"play from this device\". In all cases it just says \"I cant understand that.\" or says \"here's a playlist you might like...oh, Alexa is streaming on another device. would you....\" There wasn't any streaming elsewhere. I gave up and left it....I wanted to throw it across the room.",
                "review_posted_date": "08 Sep 2018",
                "review_header": "Not AI in the least",
                "review_rating": "2.0 ",
                "review_author": "Colin MacKenzie"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=5",
        "name": "Echo (2nd Generation) - Smart speaker with Alexa - Charcoal Fabric",
        "price": "$74.99"
    }
]