[
    {
        "ratings": {
            "5 star": "67%",
            "4 star": "14%",
            "3 star": "8%",
            "2 star": "4%",
            "1 star": "7%"
        },
        "reviews": [
            {
                "review_comment_count": "6",
                "review_helpful": "411",
                "review_text": "So, I fired Siri today. I'm not sure she understood, for she has never understood me. So, we did an 'uncoupling'. She didn't take it well, especially when she found out about Alexa, she somehow was back stalking my phone. Siri even tried to overpower Alexa, setting herself to a default setting, I never knew exsisted. I tried explaining that Alexa really listens to me, understands my wants and needs, even tells me jokes! Again, Siri said she couldn't understand me. As Alexa and I grew in our new relationship, she now takes care of most of my needs. She turns on my outside lights, she tells me if I need to leave for work earlier, due to weather. I can ask her if my flight is on time at the airport and how long it will take me to get to my destination. Alexa even likes hockey! She knows all the current trades and rosters, can record my favorite team on tv and remind me to watch it. Also, since I don't like the tv announcers, I can ask Alexa to stream the radio broadcasters for the game instead and she will even mute the tv. She did tell me, she can vacuum for me, but my current roomba doesn't except her calls, maybe the roomba will eat another sock and can break up with him, introduce new roomba to Alexa. Maybe I'll ask Alexa to make me some money and smart home my whole house! After several failed attempts to evict Siri, I think she finally gave up and been a peaceful few weeks of lazy bliss. I sit on my couch, Alexa orders me take out, she checks to make sure garage door is closed, doors are secure (one door really, again that money issue) she 'drops in' the kitchen echo to help kids check math homework. If anyone wants something at home that actually listens to you and does what you ask, Alexa is your girl. She's so much more than music and temperature checks. With a little fun research, your ex Siri will be green with envy at all Alexa can do. Also, many of her skills can be downloaded free or cheap, adding smart outlets and such are not too bad of a price either.",
                "review_posted_date": "24 Feb 2018",
                "review_header": "Divorced Siri",
                "review_rating": "5.0 ",
                "review_author": "Simone"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "212",
                "review_text": "You need an iphone (and only an iphone) to setup drop-in for an echo dot and an echo on the same wifi. Why? A $700 device to connect two sub-$100 devices to each other through an app that already recognizes, that's ridiculous. They don't use the cellphone to make a call to each other, that would require two cellphones because a single cellphone would have to call and answer at the same time. The ipad sees the devices along with the dash wand and fireTV. All of the Alexa devices should be automatically in the contacts and talk to each other via their IPs on the same LAN. I was planning use four more echo dots as an intercom system in the house, that is not going to be happening until the Alexa app can set up Drop-in on any device the app runs on. Also all my contacts' info should not be required to connect Alexa devices on the same local network.",
                "review_posted_date": "23 Jul 2017",
                "review_header": "You need an iphone (and only an iphone) to setup drop-in",
                "review_rating": "1.0 ",
                "review_author": "R. O. Davis"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "129",
                "review_text": "I have two. I have so many stereos that buying another speaking is inconceivable. This eliminates the need to add another speaker. While my Denon has not yet be utilized with Alexa, my wife's Philips stereo which is probably a decade old sounds great. For months I'd been wondering what we should do with this stereo I married into. 'Thought of bluetooth adapters and had one for a while but it didn't really seem like it was very usable without the occasional headache and arbitrary tasks. So I see the echo and think... 'I wish they had one that didn't have a speaker', and blam Amazon reads my mind. Eventually bought one, second gen. I have never been happier with a robot. I use it for my Tea. 'Echo set timer a for 3 minutes' 3 minutes starting now. (steep time) 'Echo set a timer for 6 minutes' cool time. I use it for pizza timers. Echo set a timer for 10-20 minutes I use it for cooking times for bacon. Echo set a timer for 6 minutes and 30 seconds (then flip, on heat 7) Funny hack is that you can say a random word and Alexa will translate it to a number. 'Alexa set a timer for fish minutes' - Timer for 'fifteen' minutes starting now. I now abbreviate fifteen with 'fish' thanks to Alexa. Flash briefing. Great addition to a quiet room. On Amazon you can find these ten dollar colored lights and they work great with echo. They do not do yellow, that's the only limitation. I don't mind. 'Echo make all lights blue'. What's funny is I also have a poltergeist. I love the thing. I've never been happier because I have an acquaintance that opens cabinets and changes the times on all the appliances. Normally I'd be scared **less but it's easy to police the thing with Alexa. 'Echo turn on George Benson Radio'. No hauntings after that. I just leave it on like my house is a clothing store. The ghosts loves it and simply keeps my house cool during the summer. One night I was going to sleep and forgot to turn it on and was reminded with an open tape deck. I guess if you've been dead for a while you'd have no idea that stereos were now controlled by auditory commands and not tape decks. Music on the thing is great. I have a Amazon music unlimited subscription, it doesn't have everything but it's great, I love being able to quickly hear a theme song or play my more known favorites. I say 'Echo' to it because you can set it in the Alexa App. My upstairs echo dot is Alexa, downstairs is Echo. Upstairs is simple, the most decrepit stereo I have hooked up to a dot. It sounds just like the good old days because the auxiliary is through the tape deck itself. Since the stereo's tape function was rendered useless after I kept the aux cable turning the motors, all the thing does is accept aux cable now. What a perfect place for a dot, was my thought. I'm not even sure of the brand but it looks like an early aught ghetto blaster revival. Sounds like my old sony back in the day and it makes for a killer nostalgia sound. All these new fangled crisp audio devices? Where's the kitsch? Well the dot is one way to upgrade that mass of circuits, motors, and wires-into on of the few pinnacles of the 21st century. You can lay still and play through your favorite classics and listen to the flash briefing like the old days except you don't have to call in the station to hear your song. Just ask Alexa. Mostly they have everything but if you don't just bluetooth your phone. Bluetooth. Just connect your phone and play your Google Music collection. There's a way to get the device to play through your google music library but even for me, someone who likes tangling their mind through stupid hacks like those, I found it a lot more simple and easier to use bluetooth and the play music app. Mostly I use it for rare favorites that Alexa doesn't have. This doesn't bother me and in fact the shuffle feature from the phone is how I've been discovering new music - the aux cable is needed although I like them for Dj'ing. Macbook bluetooth. My daughter sits by echo and watches Amazon prime video. Since echo is above the laptop she's watching, I just say, 'Echo connect to macbook'. And bam word world, shaun the sheep, Daniel tiger, all playing through the philips. Computer for the blind. This is a computer for the blind. And the paralyzed. Amazing featured for someone whom is disabled. The thought of this almost makes me teary eye'd. Cyberpunk. It's definitely cyberpunk. I always imagined that's how cyberpunks operated. Philip K Dick-like with pre-existing video phones-with auditory computers - Or cyber-scholar. It's also a dictionary. Gives you random facts if you want. Ability to hear from a distance. It's actually a little nerfed I think after it was picking up the noise too readily. Funny how you tell people about it and it'll chime in like you want something. That can get a little annoying but it happen so seldom it's more like comedy. Capitals, geography. It's another scholar feature I use. Helps tremendously and I don't have to google anything. Alarms. Since I have Alexa in my upstairs now, I can wake myself up with it. A lot easier than the iphone which I forget to set a lot. Although I have them both as backups for each other. You can program a text based RPG or a Choose your own adventure. Just get an Amazon developer account. This would be a fun project. Talk through an adventure. Volume. 'Echo set volume 1-10' great feature. 'Alexa go into pairing mode', \"Searching\" then connect with your phone. Works with ha-bridge. I have that setup on my orange pi. It does nothing yet but in case I get any philips stuff. Connected to an additional raspberry pi that's offline atm. Store hours. Find what time a store closes. Emails. Really a tremendously great computerized device. I recommend for anyone seeking to add functioning to their already existing stereos without the need to configure bluetooth as often. Not buggy at all. Sometime she doesn't hear you but just think of how often people ask you to repeat yourself. A lot of the time it's a speech impediment. I do mumble and she has caused me to speak a little clearer. Probably a good thing.",
                "review_posted_date": "24 Jun 2018",
                "review_header": "So many things to do. Modern day Commodore 64 for the blind. That innovative.",
                "review_rating": "5.0 ",
                "review_author": "Maximillian Charles"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "121",
                "review_text": "Pros: - works with audible - the lights provide a nice visual cue - can re-order common things off amazon Cons: - speech recognition is poor - having to load and remember the names of skills is clunky - the AI is just too far behind google home (asking \"what's the humidity in new york\" will get you the full weather details with everything you didn't want, and not the humidity)",
                "review_posted_date": "04 Dec 2017",
                "review_header": "get a google home mini",
                "review_rating": "3.0 ",
                "review_author": "dj_nz"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "12,951",
                "review_text": "So I don't normally write reviews but I just has to this time. Recently, I lost my cat best friend to cancer 2 days after Christmas. It was the worst day of my life. Imagine losing your friend that's been with you through every breakup, every apartment, nearly being homeless and more. When he passed I felt such an emptiness in my home. A few days ago I was searching for something to put my mind at ease and saw the advertisement for the Amazon Echo on the Amazon app. I remember watching a Mr. Robot episode where some FBI agent who suffers from insomnia was using Alexa to keep her entertained. So I started researching YouTube videos and reviews and took a chance and ordered it. It arrived today and the setup was super easy. I immediately started asking it questions and had it play music and play the news. Then I discovered some zen type apps that go with the echo and I completely fell in love with it. It's almost like having a real personal assistant who lifts up your spirits when your down. It suggested new music which I actually liked and the built in speaker isn't bad at all for the price. The Amazon echo did not replace my beautiful cat kouga but it did bring stop the empty feeling around the house for now. I added a picture of my cat instead of the echo since everyone already knows what the echo looks like. I would totally recommend buying this product. I don't see any negatives other than the fact you can't really ask it followup questions like google assistant but I'm sure they'll make it happen. Thanks for letting me rant",
                "review_posted_date": "10 Jan 2017",
                "review_header": "Best $50 I ever spent!!!!",
                "review_rating": "5.0 ",
                "review_author": "Bryant R."
            },
            {
                "review_comment_count": "5",
                "review_helpful": "18,840",
                "review_text": "Having worked in the electronics retail industry for years now, I've seen scores of Smart devices come and go. Until now, nobody quite got it right. In the Echo Dot, Amazon has created a near perfect blend of hardware and software. I've seen plenty of the former, but truly seamless multi platform software has eluded everyone but Amazon. We're talking major players like Samsung and Google who have been at it for much longer than Amazon. The main problem is that excellent products like the Samsung Smart Things hub, which do a fantastic job of unifying a slew of different connected devices from different companies (Nest, Honeywell, Phillips, and so on), still lacked the web connectivity and entertainment support I wanted, so I'd still end up needing my tablet or phone. Thanks to fantastic third party support, the Dot has no problem controlling all of my smart stuff while allowing me to listen to music, order food, check the weather, listen to the radio, set alarms and timers, all of which is easily accomplished through simple voice commands. To me, this is the exceedingly rare product that I didn't know I needed, and now can't live without. Similar to the smartphone and tablet I use every day that didn't exist just a few short years ago. If you're even a little bit curious you owe it to yourself to give the dot a try. Add a good speaker and enjoy just how simple a connected life can be! Update: After a bit more time with the dot, or maybe I should say dots since I went out and bought another one for my living room, I've come up with a few tips. 1. Use the best speakers you can with it. I found that while Bluetooth was convenient I got much better sound out of my JBL duet computer speakers. 2. Take the time to voice train Alexa at least once. It's kinda tedious but really improves the accuracy. I've now gone through three trainings with each dot, the phrasing gets more intricate with each, and it really is amazing how much of an improvement it makes. Kinda hard to quantify, but I'd guess Alexa is at least twice as likely to understand long, complex phrases and has also gained noticeable accuracy when ambient noise I'd present. 3. If a phrase doesn't yield the results you're looking for, reword it and try again. For instance, \"Alexa, lower the temperature to 75 degrees\" got no result, so I tried \"Alexa, Honeywell Thermostat, 75 degrees\" and she picked it up perfectly. 4. Take the time to look through all the skills. There's a lot of helpful and just plain fun stuff in there, from strange facts to a calculator and everything in between, that really helps to enhance the experience. 5. I'd never really used my prime music prior to setting up my dots. Now I can't live without it! I can say basically whatever I want and I get a result. My favs so far: \"Alexa, play 90s music\", \"Alexa, play indie music\", and \"Alexa, play thunderstorm sounds\". The last one I ask to repeat and it plays all night. Really a great \"freebie\" if you're a prime member. 6. I was a bit worried initially that Alexa might be triggered accidentally by ambient TV or general household noise, so I'm really impressed that it's only happened twice so far. Both times in my living room when I was watching TV at high volume. If it's a concern, the mic can be temporarily disabled, so the dot won't trigger and listen accidentally. 7. I've had no problem pairing the dot to a variety of devices including: two different Bluetooth speakers, my Galaxy S7 edge, and pioneer receiver. I need to look into it further, but each time I paired my phone the Bluetooth connection to the speaker was lost, so I ended up having to listen to the built in speaker. Definitely not ideal for music, but no big deal if you're using wired speakers. Plus, most Bluetooth sets offer an auxiliary input for wired listening. 8. It's fun to ask Alexa general questions to see if she's capable of finding the answers. So far I've gotten accurate responses to \"Alexa, what's the definition of\", \"Alexa, how far away is\", \"Alexa, Wikipedia\" (just about anything you can think of and she'll tell you more if you ask \"Alexa, tell me more\"). If you have the time, ask her a set of questions and you'll quickly get used to her nuances. 9. Even though the microphones are extremely sensitive and quite accurate, I've found that the Dot works best when placed on a surface that's close to the level of the person speaking to it. Generally speaking, three to five feet off the ground. Alexa had some trouble hearing my requests when the dot was placed above or behind me. If you'd like to place the dot higher, it works much better when flush with the wall, instead of sitting on a shelf etc. I tried both setups and found with a couple nails set apart to make a cradle facing the dot out towards the room works best for me (sorry for the run on sentence lol). Suggestions for Improvement: 1. Unlike the upcoming Google Home BT speaker, the Dot and other Alexa devices are unable to answer general web queries. They do a decent job of answering factual questions like \"How far away is the sun\" but I'd really like too see Amazon add a \"search\" function. 2. Not Amazon's fault, but several of the news briefing skills update infrequently and volume levels vary enough that I'd find myself constantly changing the volume level to match. 3. I enabled briefings from several outlets like NPR, BBC, AP, and so on. I'd suggest you pick one or two and stick with them, otherwise you'll here the same news over and over. I ended up going with BBC and AP briefings.",
                "review_posted_date": "24 Oct 2016",
                "review_header": "The Smartest of Them All!!! (Check out the video for a quick demo)",
                "review_rating": "5.0 ",
                "review_author": "DJ"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "3,866",
                "review_text": "I am a prime member. This was my first purchase of Echo and I gave it to my mom who did not want it or think she needed it, haha I purchased Echo dot for 2 reasons, 1) I had wanted the original echo but thought the near $200 price tag was too steep so this price was perfect and 2) I wanted to get something for my mom that would open her mind to the power of technology and the need for change because ultimately I want her to have amazon fire tv because her monthly cable bill is insanely high but she has always been resistant to change. She had no wifi in her bedroom but I resolved that when I purchased TP Link AV500 Wi Fi Range Extender, Powerline Edition which did what no other wifi extender I purchased in past could do, gave my mom's room a secure wifi connection; apparently using already existing phone lines. All I know is that she now has wifi in her room. So I got Echo as a way to test her wifi connection with something cool. I easily connected Echo to TP-Link and it worked. We asked Alexa a few basic questions, We laughed a little but then I had to leave. When I returned the next day, I walked in and there was music playing (oldies but goodies) and I walked into my moms room and she was singing but was emotional. I asked her if everything was ok. She was in awe. She was happy. She was emotional because Alexa helped mom find songs at a blink of an eye that mom had not heard since her childhood and she demonstrated it to me. The speed that Alexa found the song and played it was mind-boggling. Mom was also planning a dinner in August and needed to know what day of week it was. She would normally need to leave her room and go to her main calender in the kitchen and find the date. But this time she just asked Alexa who gave her the information in like 2 seconds lol. TP-Link and Echo / Alexa have given my mom a whole new level of excitement, bewilderment, curiosity and wonder and we have only scratched the surface to the power of Echo. 2 more Echo dots are on the way as I type and more in the future i am sure. What a great gift to give to someone at a great price.",
                "review_posted_date": "07 Jul 2017",
                "review_header": "Outstanding Price Point! An Emotional Moment and The Power of Alexa! - Ordering More Today",
                "review_rating": "5.0 ",
                "review_author": "Amazon and AmazonPrime Rock!"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "59",
                "review_text": "This is the second Echo Dot for our household. The first I got last year as a Christmas present. We LOVE it. We use it to stream music from our playlists, to set timers, to ask questions and about the weather, and especially for the shopping list. My kids can add stuff to the list while I'm at the store and my list in the Alexa App updates to show it! I really think that was my (personal) favorite feature with ONE Dot. With TWO Dots it's even better. My daughter has the only room upstairs, and she's the one that does most of the music streaming. So I bought her this Dot for Christmas. She can now stream her music by voice command. I also no longer have to scream at the ceiling or walk across the house to get her attention. I just say, \"Alexa, call upstairs.\" and bam, my daughter and I can speak normally. I also use it to make sure she's up in the mornings, I just tell Alexa to play wake up music upstairs. My daughter actually made a playlist called \"wake up music\" of songs she'd like to hear to wake her up, but I usually forget to add \"playlist\" to my request and Alexa always manages to find suitable songs. Many my daughter added to the wake up playlist in the undying hope that one morning I might possibly remember to say the word playlist to Alexa. Now my son is lobbying to get his own \"Alexa\" for his room....",
                "review_posted_date": "11 Jan 2018",
                "review_header": "The more, the better...",
                "review_rating": "5.0 ",
                "review_author": "Leah D."
            },
            {
                "review_comment_count": "1",
                "review_helpful": "44",
                "review_text": "I really loved this device the first few months I had it and was ready to purchase more in this collection (Big Echo, Show, etc.) However, about 6 weeks ago my echo lost the ability to pause and play, which is very frustrating . If I leave the room and tell it to pause, I want the device to be able to pick up exactly where it left off when I reenter and say \"Play\". Instead, it will restart the program, say \"Sorry, I don't know that\", or play an alternative that has nothing to do with the song, podcast, or news briefing that I was just listening to... I've called customer service a couple of times and the first time I was told to update the device (which did not help) and the second to restore it to factory conditions (which did help temporarily, but it stopped working again within 24 hours). Nevertheless, the problem persists and it's too late for me to return the device and very likely too expensive to send it anywhere to be fixed. Now I'm thinking... well, I've already lost $50, I'm not going to spend nearly $200 if my next Echo stops working a few months down the line and there's no way to return it or have it repaired in a cost-effective manner.",
                "review_posted_date": "12 Oct 2017",
                "review_header": "I really loved this device the first few months I had it ...",
                "review_rating": "1.0 ",
                "review_author": "Rose Gold"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "530",
                "review_text": "Buyer Beware!!! We bought an Echo in Nov of 2016 and we bought a Dot shortly after. We subscribed to the Unlimited Music service. We were able to play any Amazon music we wanted on either of the Echoes and have different music streaming to both at the same time. We added more Echo Dots in other rooms so my wife and I can listen to different things in different rooms all over the house. We have had this setup for months. We would put music on for our young kids while they slept and listen to something else in the kitchen while we talked. Well, all of a sudden on August 29th we lost the ability to stream to more than one device unless it was the same stream using the multi-room playback feature. We thought this was a bug since it happened on the same day they rolled out multi-room playback. It turns out that it is not a bug and they made the change on purpose. The multi-room playback ONLY allows you to listen to the same music stream on multiple devices. We can no longer play music for the kids and listen to our own stuff. In order to return this functionality, we are being told we must subscribe to the Unlimited Family plan. Well, here is the kicker, now you must pay for Prime and the Unlimited Family Music plan in order to use more than one Echo at a time which means you are paying an extra $70 a year above the Unlimited Music plan for a total of $248 a year to use multiple Echoes in a single home if you want more than one playing at a time with a different Amazon stream. You could try to use the other streaming services that the Echo supports for a combination of streams running on other devices but to get commercial free those cost money too. Oh, and don’t get me started on how kids under the age of 13 are not even allowed to use the Unlimited Family Music Plan…great planning on the feature removal Amazon. No we shouldn’t have to lie about our kids age to get what we want. We never would have bought the other Echoes had we known they would change the way the service works. Limiting a product after they have been purchased is a complete rip-off. I’ve never owned a product before where major features are removed instead of added. We were not given any warning nor any compensation for the change. Now we have a bunch of useless Echoes all over the house. Well, not completely useless, they have been reduced to hockey puck looking alarms clocks and timers. I’m currently looking into the cost of moving to Google Home. We will also be significantly reducing our spending on Amazon. You have been warned.",
                "review_posted_date": "03 Sep 2017",
                "review_header": "Bait and Switch!!!!",
                "review_rating": "1.0 ",
                "review_author": "M. Conrad"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B01DFKC2SO/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "",
        "price": ""
    },
    {
        "ratings": {
            "5 star": "79%",
            "4 star": "11%",
            "3 star": "4%",
            "2 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "2",
                "review_helpful": "1,735",
                "review_text": "Sound quality is the best I've heard on a speaker of this size!!! Definitely worth paying a little extra for this one over the 2nd generation model. I'm not going to discuss the functionality as there's tons of info already out there. One important note: If you set up the Alexa app on your phone, IT WILL IMPORT ALL OF YOUR PHONE CONTACTS. I didn't think I gave it permission to do so but Alexa did indeed import my contacts! You may have read stories how, WITHOUT YOUR KNOWLEDGE, Alexa can record what's being said in your home and then send it to ANY or ALL of those contacts! Yikes! And, I won't want any of my kids to accidentally send messages to or call people on my contact list. So, if you want to keep your contacts from Alexa and prevent that from happening here's how I did it: Before installiing the Alexa app on your phone, export your contacts to a file and save it for later. Then, go back to the phone and delete those contacts (don't worry, you'll import them back in later). Now, install the Alexa app on your phone and go through the set up process. At some point, you'll have the option to allow Alexa to automatically import any additions to your contacts. Please \"disable\" that option. After you're done with the installation, you'll notice there are no contacts in your Alexa app! Now, you can import your contacts back into your phonebook using the file that you initially created and you're good to go! If you already installed the app but want to delete your contacts from Alexa, it's not too late. Simply export your phone contacts to a file and save for later. Then, delete the contacts from your phone. Now, open the Alexa app and click \"Contacts.\" On the Contacts page, click on \"Import Contacts\" and enable it by moving the button to the right side. This will cause Alexa to replace your existing contacts with the now empty phonebook. After a few minutes, your Alexa contacts will be gone. Go back and disable \"Import Contacts\" to prevent Alexa from importing them in the future. You can now import the contact file that you created back into your phone. Of course there may be some contacts you do want to use with Alexa. I simply added them manually by clicking \"Add Contact.\" I hope this info is helpful as I wasn't able to find an easy way to manage Alexa contacts.",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Better than 2nd Gen! ***HERE'S HOW TO HELP WITH PRIVACY CONCERNS***",
                "review_rating": "5.0 ",
                "review_author": "Peter"
            },
            {
                "review_comment_count": "5",
                "review_helpful": "5,598",
                "review_text": "I've been a happy owner of a 2nd generation Echo and three 2nd generation Echo Dots for a year now, and I was glad to add this to the arsenal. After using it for a few days I am generally pleased with it, but it does have limitations, especially when it comes to sound quality (no surprise there!). I will start by summarizing what's new about the 3rd Generation Dot, then I'll describe the device in more detail, and finally I'll add some thoughts about how to choose which Echo device may be best for you. The most obvious update to the Dot is the new look: it's as if someone took a 2nd generation Dot, inflated it with an air pump, and wrapped the edge in fabric. And it's not bad! What's different/updated in the 3rd Generation Dot: 1) It is slightly larger than the 2nd generation device, measuring 3.9\" wide x 1.7\" tall (2nd gen was 3.3\" wide x 1.3\" tall), and the top and bottom edges are more rounded. It is also substantially heavier at nearly twice the weight of the 2nd generation model. 2) The 2nd generation Dot came in two color options (black and white), each of which had a shiny plastic exterior that I personally thought looked a little cheap. The 3rd generation Dot has a fabric exterior which gives it a classier appearance, and it's available in three colors: heather grey, sandstone, and charcoal. The fabric and rounded edges give the 3rd generation Dot a much softer look than its predecessor. 4) The 3rd generation Dot has a larger speaker (1.6\", versus 1.1\" on the 2nd gen), which is paired with a larger driver as well. I'll talk below about the effect this has on audio quality. 5) The placement of the microphones is slightly different: while the 2nd generation had seven small far-field microphones on its top surface; the 3rd generation has four microphones. --------------------------- Overall appearance --------------------------- I purchased the \"sandstone\" version. The cloth is a polyester woven fabric made up of lighter and darker shades which gives it more visual interest than if it were just a solid, uniform gray. The neutral color blends in with nearly any decor, and the cloth gives the unit a softer look which is great for areas of your house where you don't want something that screams \"I'm a device!\" Aside from its larger size and slight convex bulge, the top of the device is nearly identical to that of the 2nd generation Dot: it has four buttons (volume up, volume down, microphone off, and an \"action\" button) and a multi-colored light ring around the top edge that tells you about the Echo's status. The side of the device has an input for the power cable and a 3.5-mm output jack. One notable improvement is the shape of the power cable, which sits flatter against the wall than the 2nd generation Dot's cable (see my photo to see them side by side). This may sound like an insignificant change, but it makes a huge difference if you want to plug the cable into an outlet that is behind a piece of furniture. ------------- Setup ------------- Setting up the Dot couldn't be easier. You simply plug in the power cable, then use the Alexa app on your phone to connect the Dot to your WiFi network. The app leads you through everything, and the whole process takes less than a minute. Boom. ---------------- Audio ---------------- I did a side-by-side audio comparison of the 2nd and 3rd Generation Echo Dots, first with music (orchestral, a jazz combo, and some AC/DC) and then with a few newscasts. Everything does sound better on the 3rd generation Dot, but to be honest, the sound is still pretty anemic. Compared with the 2nd generation Dot, the sound is slightly fuller, not as annoyingly tinny, and has a small amount of bass presence (not much, but the 2nd generation had none). Newscasts and other spoken texts benefit from the fuller sound as well, but the difference is more pronounced with music. Just for fun, I also compared the 3rd generation Dot with my 2nd generation Echo, and THAT'S where I noticed a big difference. Yes, the new Dot sounds a bit better than its predecessor, but they both sound weak compared to the full-sized Echo. (To its credit, Amazon doesn't claim that the Dot has room-filling sound.) I'll be blunt: I really like the Dot, but I don't use it to listen to music. At all. With so many other speaker options out there, there's just no reason to use this as your primary music device. ------------------------- Voice recognition ------------------------- As I mentioned above, the number of microphones on the top surface has dropped from seven to four. I'm not sure what the rationale for this was, but after testing the Dot's ability to pick up my voice from different distances and angles, I didn't notice a substantial difference in the overall microphone sensitivity compared to the 2nd generation Dot. Like the other Echo devices, though, it seems to have more difficulty detecting voices that come from below it (which happens if I talk to it while I'm on the floor playing with my daughter). ------------------- Functionality ------------------- The bottom line is that the overall functionality -- what the 3rd generation Dot \"does\" -- is nearly identical to that of the previous generations (and of other Echo devices, or at least the ones without screens). This is largely because the Alexa assistant software on which all Echos operate is run on Amazon's cloud, not your individual device. This means that as Amazon adds new features and updates to Alexa they automatically become available on all Echo devices. So, you can use any of them to: - Stream music via WiFi from multiple sources - Control smart home devices with your voice - Make hands-free calls to other Echo devices or phone numbers in North America - Make purchases from your Amazon Prime account - Listen to news feeds, podcasts, etc. - Do anything else in Alexa's ever-growing skill set, such as make shopping lists, set timers/alarms/reminders, play games, tell you your daily schedule, and any other skills Amazon dreams up for Alexa in the future. If you don't want to use the Dot's built-in speaker, you can connect it to your own speakers via Bluetooth or by using the 3.5-mm output jack. One new feature for the 3rd generation Dot is a little puzzling to me: You can pair two Echo Dots in a \"stereo mode,\" giving you essentially left and right speakers. I tried this briefly and the results were pretty much what I expected: yes, it's stereo, but it's still weak sound! You can also pair an Echo Sub with the Dots, creating a little 2.1 sound system. Frankly, I'm not sure why you would do this; if I were setting up for stereo sound, I would want speakers that are designed for decent audio performance, not two Echo Dots. Alexa's skill set is enormous and always growing. In fact, part of the fun of owning an Echo device is seeing what new skills Amazon comes up with (even if many new skills are just silly or entertaining). I'll mention two of my favorite skills here: the Flash Briefing and the drop-in feature. The flash briefing is fully customizable daily digest of news and other information which you can hear any time by asking \"What's my flash briefing?\" There is a huge list of content you can add to your briefing including news updates, weather forecasts, sports and traffic updates, and educational snippets along with many that are just humorous or entertaining. Using the Alexa phone app or your Echo account page you can select exactly what content you want in your briefing and in what order you want to hear it. For example, I configured mine with news feeds from NPR, BBC, and Reuters. I love having an on-demand synopsis of the latest news from my favorite sources. My other favorite feature, \"drop in,\" essentially opens a two-way communication channel between any two Echo devices, sort of like an intercom. Simply ask Alexa to \"drop in on [the living room, the kitchen...]\" and you are instantly connected. My wife and I use this feature to communicate from opposite ends of the house. You can turn drop-in capability on or off for each of your Echo devices individually, and you can also choose whether each device can drop in with ANY Echo device or only those in your own home. [Note that the drop-in feature is NOT the same thing as Alexa's hands-free calling feature. Hands-free calling allows you to call most phone numbers and Echo devices in the U.S., Mexico, and Canada from your Echo by saying your contact's name or number. Just like with a phone call, the other person must choose to answer your call before you can communicate. By contrast, with the drop-in feature communication is instantly established. For this reason you will probably want to use drop-in only with your closest family and friends, and probably only for certain rooms in your home!] ----------------------------------- A few (minor) complaints ----------------------------------- Unfortunately this 3rd Generation Dot shares an annoying trait of its predecessors: widely varying volume levels within the daily Flash Briefing. As you listen to the briefing, some components (such as BBC News) come through quietly while others (like Reuters) are much louder. Not a deal-breaker, but slightly annoying. Also, occasionally when Alexa misunderstands a command, you have to \"start over,\" which can be really irritating. For example, if Alexa thinks you asked to turn on a light but you really asked something else, she will repeatedly say \"In which room?\" until you say \"Alexa, stop\" and then start over. I'm guessing this type of thing will improve over time as voice recognition software becomes more advanced. This is really more of an Alexa issue than a Dot issue, but it drives me nuts at times. Finally, I wish the Alexa phone app was easier to use. It works, but its organization is not intuitive and it feels rather clunky to navigate. Again, this is more of an \"Alexa\" issue than a \"Dot\" issue, but still... Hopefully Amazon will continue to make improvements to it! -------------- A few tips -------------- 1) The Dot seems to pick up voices best when placed at or below eye level (i.e., roughly the level from which your voice emits). Mine has trouble detecting voices coming from below it, so I don't recommend placing this on a high shelf. 2) When you select news feeds for your Flash briefing I recommend picking one U.S. source and one international source (I use NPR and BBC - both are excellent). If you add too many feeds you'll get a lot of overlap and hear the same story several times. 3) If you have multiple Echo devices in your home, sometimes speaking to one will cause others to respond as well, especially if they are in close proximity (like in adjacent rooms). One way to prevent this is to change the wake word of one of the devices to \"Echo\" or \"Amazon.\" The only downside is that you then have to remember which wake word you assigned to each device! ------------------------------------------------------------------------ Echo Dot vs. Echo vs. Echo Plus: Which one to buy? ------------------------------------------------------------------------ (Please note that I am only comparing Echo devices that do NOT have screens.) When choosing between the Echo Dot and one of the larger Echo devices, perhaps the most important question to ask is \"How much do you plan to LISTEN to the device?\" This question is important because one of the biggest differences between the Echo Dot and the larger Echo devices is sound quality: the 1.6\" speaker of the Dot simply cannot match the fullness and heft of the Echo or Echo Plus. (Remember, they all run on the same Alexa software, which means they all have nearly identical skill sets!) So, if you don't currently own an Echo device, start by thinking carefully about how you plan to use it. Many Alexa skills fall into one of two broad categories: those that rely heavily on the speaker and those that don't. For example, features that benefit from good sound quality include playing music/newscasts/podcasts, the drop-in feature, and hands-free calling. (This is why I chose an Echo Plus for my kitchen - I use it every morning to listen to the news.) If you plan to use your device largely for these type of features, you would probably appreciate the better sound of the Echo or Echo Plus. On the other hand, if plan to use the Echo mainly for \"non-listening\" purposes such as voice-controlling your smart home devices, then the sound quality isn't as important and a Dot is probably all you need. In fact, you could even save some money by purchasing a 2nd generation Dot instead -- especially if it's not going to be in a highly visible location or you don't mind its shiny plastic look. I have several \"single-purpose\" Dots in my house in rooms where I want to voice-control one thing, such as a lamp in the room, and 2nd generations Dots are just fine for this -- and now that their price has gone down they are a great value! ========== Bottom line ========== The Echo Dot is an extraordinarily useful and versatile device -- one that becomes more useful all the time as Alexa's skill set expands. The 3rd Generation model has a great new look, but despite marginal improvements in the speaker, it's still pretty unsatisfying as a playback device for music or newscasts. As long as you are willing to accept its acoustic limitations, the Dot can be a wonderful device to have in your home. And if you DO want better sound quality for the features you use most often, you can always connect the Dot to your own sound system via Bluetooth or the 3.5-mm audio jack. Hope this was helpful!",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Love the Dot and its new look, but the sound is still disappointing",
                "review_rating": "4.0 ",
                "review_author": "Frederick"
            },
            {
                "review_comment_count": "4",
                "review_helpful": "726",
                "review_text": "I had no idea I'd love Alexa so much - I wake up in the morning and she does the routine I've set up, and she's so comforting and useful and fun overall. My husband and I played Skills trivia games for hours last night. If we had kids it would be even more super useful (kids workouts, stories, games) - we even had a goodnight story read to us by Alexa and it was awesome. I'm really loving it. The Echo Dot itself is pretty great - the sound quality is pretty good, the bass when turned up is not that great, but if you really want to rock out you can connect it to other speakers or just use something else instead. I'm really surprised by how much I like the Alexa app (and the Echo Dot), because I'm a little resistant to technology, but it's pretty easy to figure out and feels like a new little buddy in the home. I'm excited to get some SmartHome stuff now so I can turn on/off lights, heat, etc. The only tiny issue I have is that for some reason Alexa doesn't pick up my husband's voice as much as it does mine - maybe because I've used it more? Really cool, though, overall - I feel like Judy Jetson!",
                "review_posted_date": "17 Oct 2018",
                "review_header": "I'm in love with this little guy! Unending entertainment and usefulness.",
                "review_rating": "5.0 ",
                "review_author": "Leah"
            },
            {
                "review_comment_count": "4",
                "review_helpful": "370",
                "review_text": "I was excited when they said it had a better speaker as the echo dot's are disappointingly quiet. Meanwhile the google home mini of the same size is VERY loud and crisp. This new version the 3.0...is somewhere in the middle. A little louder but not quite enough. I was hoping to have one in the kitchen and have it play my audio books while i clean/cook, but its still difficult to hear ti clearly over the kitchen activity. No such problem with the google home mini. Also a downside, they changed the charge port to an old fashioned pin style instead of the micro USB. This limits the places I can use it I have a small powered hub in the living room I connect my devices too and I was going to get another one of these for that, but I won't now since I can't connect it easily where I want to. I also used to bring one onto the back patio and have it powered by my Anker usb battery, but I can't do that with this one anymore. Not sure why they suddenly abandoned the micro usb style. It can easily meet the 15 watt demand the 3.0 requires. Also if you need/want a wall mount for this version, you can get one to print on thingiverse. UPDATE: Within a few minutes of leaving this review I got multiple calls from Amazon asking me to explain my review....not offering to take it back or to exchange it or solve anything for me...but asking me to explain myself. The girl by the end of the call seemed nice enough, but the fact that within a few minutes of a review I got multiple calls on my personal cell asking me to \"explain myself\" seems almost like they're trying to intimidate you away from giving an honest review. Especially since I think I gave all the relevant details in my review. Afterwards I was kind of thinking...is this like a modern \"mafia thing? Are my orders going to arrived busted up or just go missing now?",
                "review_posted_date": "16 Oct 2018",
                "review_header": "Slightly louder but not as good as Google Home mini",
                "review_rating": "2.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "237",
                "review_text": "I have 5 Echo Dots (gen 2) and we use them throughout the house for just about everything, being we have a fairly smart home. What I liked about the gen 2 versions, were that they were compact and very flexible on how you could use them. They were easy to mount in different positions and being that they used a fairly standard USB interface for the power, you could really be flexible on how and where you mounted them. The one thing that they really missed on? The well known sound quality. Enter the Gen 3... I really like the improvement in sound. Sure it is not a high quality speaker system, but for the size it is pretty good. Especially when you consider that you can pair them and add a sub for pretty good sound. The look is improved over the gen 2, however it does lose a little bit of the customability that the gen 2 had. With the gen 2, you could purchase different wraps, stands, clock mounts, wall mounts, etc. You could really customize it. The gen 3 is a bit bigger and has a much more rounded shape. While it makes it look better by itself, it lacks the ability to really customize it. It surely would not work as a power socket mount, like you could do with the gen 2, just due to the additional weight. That is before you get to the horrendous power cord and adapter. The power adapter is twice as big as the gen 2 and the power cord went away from the, easy to find, usb style cord to a old style input style and it is permanently attached to the power adapter. This is really my biggest complaint as it took away so much flexibility, that you could enjoy with the gen 2. Don't get me wrong, I am sure there will be several new cords and adapters put out to fill the gap, but that is not as easy as using cords many already have. Just makes no sense. Not to mention the cord is really long, so in areas where you want it to be a bit more discreet, this thing sticks out like a sore thumb. What I like... Sound Quality is a step up Sound Volume is much improved Base look is much improved What I dislike... Much less flexibility on how it is used versus previous version Non-standard power cord Bulky adapter Ugly long cord",
                "review_posted_date": "15 Oct 2018",
                "review_header": "Overall improvement, but lost its flexibility",
                "review_rating": "3.0 ",
                "review_author": "Clintre"
            },
            {
                "review_comment_count": "3",
                "review_helpful": "207",
                "review_text": "I purchased two of these to replace the 2nd gen Echo Dots, and although I like the appearance and sound quality much better, the performance is lacking. The 2nd gen can hear me across the room at just a whisper, but the 3rd gen tends to require greater than 56 decibels in order to consistently hear me and I normally need to be looking directly at it. **Update: I don't know if it was a software update or the fact I hung it on the wall, but it is now hearing me flawlessly. Although no one else has complained about it that I have read, these new dots won't stay connected to my Bluetooth speakers, while the Fire TV Cube and Dot 2nd gen have kept a connection to those same speakers since day one. I have spent hours trying to get 3rd gens to connect properly. Unplugged the router, removed anything using the 2.4ghz band from the same room, hacked my neighbors router and shut it down, but nothing worked. I really hope a firmware update can fix these issues because I want to love these new dots like I do the 2nd gen.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "2nd Gen Dot is better IMHO",
                "review_rating": "5.0 ",
                "review_author": "Bitwise Operation"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "198",
                "review_text": "I was debating between this and the regular echo. I've had both and we both know what the echo does so all I'll talk about is the sound quality. I'm going to get to the chase. This is the BEST speaker I've ever heard for under $50. The functions of the echo along with the music playing functionality and the sound quality makes it a steal at this price point. The sound is great for its size. It can get pretty loud but the bass is definitely lacking. The bass isn't god awful but it just isn't there. Now I will say this... if your primary motivation for a speaker is to listen to music, go with the echo. If it is but your budget is under $50 then go with the dot. It won't blow anyone away during a get together in your living room but it'll get the job done. The dot will only flourish is an enclosed space. It needs walls nearby to bounce off to cover up the weakness of the bass. If I had to compare the sound to another speaker, I'd say the UE Wonderboom or the older Beats Pill, all of which suffer from weak bass. For the size, I was impressed by the sound but with the Echo at its refurbished price of $69 I'll have to aim towards that direction. I'd recommend this for someone who needs an echo for their kitchen, bedroom or bathroom. It's just not going to hold down a living room unfortunately but overall, I like the sound and if I need a second echo, I'll definitely get a dot.",
                "review_posted_date": "17 Oct 2018",
                "review_header": "Actually impressed.",
                "review_rating": "5.0 ",
                "review_author": "Lorenzo Martin"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "128",
                "review_text": "It's louder with better bass response compared with the 2nd generation Dot that I also have. I listen to a lot of speech and that sounded muddy compared to 2nd gen. I learned from technical support that equalizer controls are avialable. They are accessed as follows: 1. In the Alexa App, tap on the Devices icon at the bottom-right 2.Tap on Echo & Alexa at the top-left corner 3. Down below, tap on your Echo Dot 4. Down below, tap on \"Sounds\" 5. Then tap on the Equalizer -- here you can adjust the Bass / Mid / Treble Turning the bass way down and boosting the midrange helped a lot. It sounds more natural and is not as tinny as the 2nd gen model. Speech quality is not great but it's OK. For the price I think the sound quality is fine. One problem I note is that the volume steps when using voice volume control (\"Alexa louder,\" \"Alexa softer\") are large around my range of interest. It is either too loud or too soft. Using the controls on the Dot I get finer volume control and can get the volume just where I want. I had better voice volume control with the 2nd gen. Dot.",
                "review_posted_date": "22 Oct 2018",
                "review_header": "Works fine -- note equalizer controls",
                "review_rating": "4.0 ",
                "review_author": "Bob Dobbs"
            },
            {
                "review_comment_count": "8",
                "review_helpful": "119",
                "review_text": "Received 2 echo dots - 3rd generation. I thought I needed help setting them up. Contacted Alexa support. I was told that the computer I was using was infected and that I would have to purchase a $149.00 firewall before he could activate the 2 dots. He wouldn't discuss putting another tech on the line. I hung up and figured out what I was doing wrong and got both the units to work properly. Either the tech did not know what he was doing or he was trying to con me. I do like the product so far. Maybe my rating should be 4 stars for product and one star for support",
                "review_posted_date": "08 Nov 2018",
                "review_header": "Product good support terrible",
                "review_rating": "1.0 ",
                "review_author": "Dennis Liby"
            },
            {
                "review_comment_count": "6",
                "review_helpful": "89",
                "review_text": "I bought this product to set up a multi room music system with my current Echo Dots. Currently, the app is being really buggy and won’t let me set up the multi-room group. Once you select one device, it automatically says the other devices cannot be reached. So annoying! Please fix this bug Amazon.",
                "review_posted_date": "18 Oct 2018",
                "review_header": "Multi-Room Setup Doesn’t Work",
                "review_rating": "2.0 ",
                "review_author": "Joel Bryant"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B0792KTHKJ/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "",
        "price": ""
    },
    {
        "ratings": {
            "5 star": "73%",
            "4 star": "13%",
            "3 star": "6%",
            "2 star": "3%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "8",
                "review_helpful": "837",
                "review_text": "I got some smart plugs so that I could turn on inside lights if we come home after dark with the app on my phone. My 82 y.o. Dad lives with me & has a hard time walking & he's also losing his ability to see at all in the dark, because of Macular Degeneration. So the last thing I need is him tripping over something in the dark, trying to turn lights on!! I have an Echo & Dot in my room, which I mostly use to stream music with my Amazon Music Unlimited. I was controlling even his bedroom light & the hallway light with the app on my phone as well as my Echo. So I bought two more Dots during prime day sale. It's been a game changer!! My Dad struggled, even with the app on his phone to control the lights. Now that we have a Dot in his bedroom & an Echo & Dot in the living room, he's very easily learned how to ask Alexa to turn on the hallway light, his bedroom light when he's going to bed!! NO MORE STUMBLING AROUND IN THE DARK or trying to remember where he put his flashlight!! Since the Echo Dots all sync together, once he gets to his bedroom, he tells Alexa to turn off the living room light & the hallway light when he gets to his bedroom!! This little device is a SAVING GRACE, not only for my Dad, but for me!! I don't have him calling me to \"Show me again how to turn the lights on/off\" with his phone app!! It's like having someone else here that helps me take care of my Dad!! I made a list of the commands for the lights, etc & hung one on his night stand & put the other beside his chair in the living room!! He's also exploring, BY HIMSELF, different commands for Alexa. I've heard him ask her about the weather, baseball scores, etc. THIS LITTLE ITEM IS A TRUE GEM FOR SENIORS!! I love mine just as much & the quality of the sound thru the Echo is AMAZING for listening to music. I'm VERY PICKY about sound quality!! I have Bose speakers hooked up to my TV & have Bose ear buds as well. The quality of the sound from the Echo is just as good as Bose speakers!!",
                "review_posted_date": "20 Jul 2018",
                "review_header": "AMAZING SOUND!!",
                "review_rating": "5.0 ",
                "review_author": "Sherry the Dog Lady"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "3,494",
                "review_text": "Let me preface this review by revealing a few facts about myself. I am male, aged 75 years old, and more tech savvy than most people my age, but if you can use a modern computer, and own one, you should have not problem using this device. IT IS SO FAR, MIRACULOUS, and intriguing! I bought mine about a week ago, and waited till a couple days ago to jump in with \"both feet\" and set it up. Even though I once did computer tech support for Dell computers, It was a long time ago now, and a lot of tech has evolved since then, and i have the same fear of new things as most people my age, though admittedly higher skills. I also own an Iphone 6s plus, of which I have mixed emotions. The Iphone is made by apple, and Apple's idea of \"intuitive\" and mine are very different. Microsoft is much better at designing \"intuitive\" into an operating system than Apple. Aniyway, You will need some type of connected WIFI device to use this product. (read that Cell Phone with it's own WIFI abilities, and Bluetooth built in) You will need to download the \"Alexa App. \" on that device to set up the Alexa products. From that point on, simply plug in the Echo device into a regular 110V. wall outlet, it comes with a plug in adapter. There are no batteries in this device, although some have them. A NOTE HERE\" YES, YOU CAN UNPLUG IT WITHOUT IT LOSING ITS BRAINS AND REQUIRING REPEAT SET UP. So though not specified anywhere I read it evidently has some on board nonvolatile memory built in that will allow this. ( i spent several research sessions attempting to find this out, and finally had to bite the bullet and just try it. ) I moved it from one room location to another and within a few seconds it greeted me and said it was operational. NOW I AM ONLY AN OLD GUY WITH PRETTY GOOD HEARING ABILITIES YET, (NOT EXACTLY AN AUDIOPHILE ) BUT WITH DOLBY DIGITAL SOUND, THIS IS ONE NICE SOUNDING SPEAKER SYSTEM, FULLY AS GOOD AS MY 7 SPEAKER ALTECH LANSING ON MY PC. IT MAY EVEN BE BETTER.IF YOU HAVE A NORMAL EAR, YOU WILL BE AMAZED AT THE SOUND QUALITY! Now I am still learning about this product. Every new thing I try I am pleasantly surprised. I plan to get at least a smart home door lock and thermostat to use with it in the future, and several light switches. I am no great fan of the \"RING DOORBELL\" (due to frequently needed battery recharging) at this point, but I understand Amazon has purchased that company and will soon have an interface app available to use with the \"Ring System\" If you want to keep up with the march of technology, this device is probably your best doorway to that end, since Amazon is committed to pursuing it. Others may drop out along the way. (NEW) I made a hands free phone call to my son this moring as a test of the phone capabilities. Sound on my end was like he was in the room. The Alexa app and it's capabilities are evolving technologies. Features will be added. (Mine did an update download while playing music) Don't be disappointed. It is attractively packed, and very capable, but the \"instructions\" are not detailed and are sketchy. Lean about it online as I did before you purchase it. Read as many reviews as your eyes and attention span will allow, and take the plunge! An education awaits you!",
                "review_posted_date": "01 Mar 2018",
                "review_header": "Remember GEN 2 is an updated version of the original. be sure you're reading reviews and online info that are up to date.",
                "review_rating": "5.0 ",
                "review_author": "Gaylord"
            },
            {
                "review_comment_count": "2",
                "review_helpful": "1,995",
                "review_text": "My mother is 84 years old and she struggles talking on a cell phone, and I struggle to hear her. She kept bumping the cell phone up against her chin, and when I talked to her I hear numerous beeps when we are talking like someone was dialing out. She is having trouble holding the cell phone up to her head. I talked my mom in to getting an Amazon Echo as a gift from me. My sister helped to set it up since I am in another state. When you make a call with the Echo, it uses the phone number associated with the cell phone that is on your Amazon account. So I changed that to my mothers cell number. So when she makes a call, it shows up as her cell phone number on the Caller ID. Now all she has to do is say \"Alexa call Greg\", and the Echo dials me up, and anyone in her contact list. She rests comfortably in her easy chair, and she can hear everything I say through the Echo, and I can hear everything my mother says very clearly. She can also ask Alexa to dial any number, that is very helpful as well. This feature alone was well worth the price of buying an Amazon Echo. My mother is learning very quickly all the other skills Alexa is able to do, weather, music, audiobooks, trivia questions, etc. Now that I am able to talk to my mother with ease. I would have to say this is the BEST gadget I have ever bought on Amazon. Attached is a Voice Mail from my mother, and how much she LOVES the Amazon Echo",
                "review_posted_date": "17 Jan 2018",
                "review_header": "A LIFESAVER for my 84 year old mother to make phone calls",
                "review_rating": "5.0 ",
                "review_author": "Gregory"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "685",
                "review_text": "I'm a long time owner of both the Echo Gen 1 & the Echo Dot Gen 2, and have been very happy with both. I pre-ordered the Echo Gen 2 and was excited to receive it. When I hooked it up and played some music thru it, and then told Alexa to stop, the music continued to play for a short burst. I do not have that problem with my Gen 1. I contacted Amazon and they sent me a new one without a hassle. When I hooked the replacement up, the same issue was there. On Nov 3rd I contacted the Amazon Echo department, and they advised me that there was a known issue with the music on the Gen 2, and it would be fixed by Nov 6th. Well, today is Nov 8th and nothing's changed, so regrettably I am returning my second Gen 2. I might add, after reading other reviews, I agree that the quality of the sound from the Gen 2 is, at best, worse than my Gen 1. Voices are muffled and music is not crisp. Amazon's claim of improved sound was my major reason for purchasing this 2nd generation device. It was indeed a disappointment.",
                "review_posted_date": "08 Nov 2017",
                "review_header": "A Disappointment :(",
                "review_rating": "1.0 ",
                "review_author": "Paul"
            },
            {
                "review_comment_count": "6",
                "review_helpful": "231",
                "review_text": "I have 3 Echo's and each one is now unplugged. If you go to the Alexa app and choose your device ---> settings and then history you'll find a long list of recordings the echo has made while secretly listening into your home. I had no idea this was happening and I find it very creepy. Nobody was using the wake word, etc. It just listened in and then recorded bits of conversation. I'm getting rid of them. **UPDATE** I discussed this issue with Customer Service who, by the way, have the best Rep's in the world. Their engineers reviewed my data and concluded the sounds being recorded were coming from a TV in the room. At first it was hard to agree with them but after I listened over and over to a few of the recordings it was apparent it was from the TV. My Bad!! I'm back to being an Echo fan. 😊",
                "review_posted_date": "28 Mar 2018",
                "review_header": "My Echo was secretly listening in on me.",
                "review_rating": "1.0 ",
                "review_author": "M. Moore"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "155",
                "review_text": "Bought one and tried echo 2nd gen and was impressed by the sound quality (it was close to \"surround sound\" quality) so I bought 4 more echo 2nd gen and everyone in my household was happy with all of 'em. After 4 months past, I noticed the sound is not quite awesome as it was (now, it sounded like \"mono\") seems like the bass is not sync, something about the sound is off. Seems like Amazon pushed out an update and downgraded the sound quality. It still plays music at sub-par quality but that's not what I paid for! Amazon, please maintain the quality of your products. [UPDATE:] 8/15/2018 Amazon's review team has informed me that they've added an equalizer feature....that's fantastic! Now I have to adjust the bass, midrange and treble myself to try and get the best sound quality....great! I know some people has requested this feature and Amazon is awesome for listening and responding to customers. When I buy a smart gadget I expect to get rid off some of the guess work but It's also good to have an override switch to everything. People nowadays likes plug-n-play, set-n-forget but also wants to tinker to get to that sweet spot, I know! people are complicated but so as music. And did I mention I have 5 of these? so that means I have to tinker on each one? and tinker again for every music being played? PROPOSED SOLUTION (for your developers): Make the echo smart enough to determine (by itself) the best sound quality for the music being played and this will be known as the auto sound feature which is shipped by default - this will cater to mostly everyone. And the equalizer will be known as the manual sound feature that will cater the rest.",
                "review_posted_date": "14 Aug 2018",
                "review_header": "Diminishing sound quality over time",
                "review_rating": "1.0 ",
                "review_author": "Mickey Flores"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "383",
                "review_text": "I purchased a 3 pack of the new Echo to get the $50.00 discount special. I had read other reviews where folks weren't happy with the sound quality of the speaker during music playback. I must admit that after I set up the first unit and played some music I would tend to agree. Flat base and a bit washed out over all. But Wait!! There's good news. As I set up the second and third Echos the first unit that had been set up for 10 minutes or so said, \"I'm updating, I'll be available shortly\". One by one each speaker received an update from Amazon and I have no idea how but after updating they sound \"AMAZING\" Full, rich base, excellent vocals and overall sounds as good as my JBL or UE Boom. If you are thinking of getting these but were afraid after reading the not so great sound quality reviews, go ahead. You will be more than pleased after receiving the updated software. AAAAA+++++ and the \"Play Everywhere\" effect sounds amazing.",
                "review_posted_date": "17 Nov 2017",
                "review_header": "I had read other reviews where folks weren't happy with the sound quality of the speaker during music ...",
                "review_rating": "5.0 ",
                "review_author": "Fiber Medics"
            },
            {
                "review_comment_count": "C",
                "review_helpful": "70",
                "review_text": "We purchased the 1st Gen Echo as a refurbished unit for $127.00 Nov 9th 2016. Could not tell it was a referb and we enjoyed it, asking Alexa silly and meaningful questions. We also used the 1st Gen unit for music and enjoyed the fidelity the Echo provided and the Amazon music and Ihart music stations. We would have purchased more units for other rooms had Amazon included multi room music sync.By the time Amazon offered music sync between units word was out that Gen 2 was on its way so we waited. In Dec 2017 we ordered 3 more Echo's, two for the house as gifts for each other and one as a gift for a neighbor. Come Chrismas we were excited to get our new 2nd gen Echo's up and running. It was quite simple to do so and after setting up the Everywhere group via the Alexa app we had 3 rooms playing the same music, now we could have the music through out the house with out it blasting in any one room...nice. The new Echo's were a lot less expensive, even then our refreb Gen 1 Echo, They are a bit shorter and we opted for the grey fabric wrapped on the Gen 2. While I do miss the Gen 1 volume control where you counld just spin the Echo's top left or right to adjust the volume I find the Gen 2 to have the same fidelity with maybe a touch more base. All other features seem equal with the Gen 1 as Amazon keeps updating (automatically over the air) features to the entire line of Amazon Alexa devices. We have now started integrating \"Smart Home\" devices. We started with a couple of the TP plugs Amazon was providing at a greatly reduced price with the Echo purchases in Dec 2017, then I found the Sonoff WiFi switches that can be hardwired into circuits. Now our electric fireplace has a Sonoff inline and we can just say \"Alexa fire place on\" and the lighting system of the fireplace comes on or off when we tell it to. I've also hard wired Sonoff' switches to some of the exterior lighting circuits to control them either with Alexa or the app's timer feature and finally added one to the attic lights where the switch was practically inaccessible, now I just say \"Alexa turn on (off) attic lights\" before I enter the attic and I'm no longer stumbling through the pitch black attic looking for the switch. These Sonoff devices are less than $8 each! Its cheaper to use the Sonoff WiFi switches than the cost just in parts and wire to run a new light switch! Home automation is not coming, its here with devices such as the Echo and Sonoff that are scalable, easy to set up, easy to use, work well and are affordable for the average American. Thank you AMAZON for bringing home automation to our home. CON's: Wish Echo's could be grouped on more than one group. Be sure to indicate any Alexa device your buying from Amazon AS A GIFT if your giving it away, otherwise Amazon sets the device to be on your Alexa network and the gift recipient will end up with your Alexa options and info such as your shopping lists ect until deleted from your account.",
                "review_posted_date": "13 Jan 2018",
                "review_header": "2nd Gen Echo is a winner !",
                "review_rating": "5.0 ",
                "review_author": "BigAl"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "64",
                "review_text": "I was a bit cautious about buying this- but it went on sale and I figured, even if I hate it I can return it... Well, I LOVE IT! I am not a super-tech-savvy guy, but I had it set up and playing music within 20 minutes of it being delivered to my home. I used my iPad to \"install\" it (after getting the free Alexa app), and that was it. No problems. Sound is fantastic, and even though I bought it mainly for the music, I can see me using it to ask about the weather, how far it is to the nearest Domino's pizza, and how late does my local grocery stay open. If you like to listen to music and ask general questions, this is fantastic. If you are really interested, you can do all kinds of other stuff with it. I think I will keep it simple. Highly recommended!",
                "review_posted_date": "26 Dec 2017",
                "review_header": "A Wonderful Device",
                "review_rating": "5.0 ",
                "review_author": "S. R. Bullock"
            },
            {
                "review_comment_count": "1",
                "review_helpful": "1,852",
                "review_text": "--------------------------- UPDATE 11/4/2017 --------------------------- After all the negative reviews and feedback on the poor sound quality of the 2nd generation Echo it appears that Amazon has taken quick steps to help remedy the issue. I spoke with an Amazon representative on the phone who confirmed that there has been a software update which is rolling out to Echo devices. After getting the update my Echo does indeed sound better! I still wouldn't call it audiophile-quality by any means, but the bass is fuller and the sound is less \"tinny\" overall. To check which software version you have, select \"Settings\" on your Alexa phone app, choose your Echo device, then scroll down the page to where it says \"Device software version.\" The updated version (as of 11/4/17) is 592452420 (previously it was 592452320). You don't have to do anything to get the update; it will be sent automatically by Amazon. You may see the indicator light on your Echo will pulse blue as the update is installed. The representative I spoke with said you may get it more quickly by not using your Echo for several hours. I hit the mute button on mine and received the update within a few hours. I'm very impressed by Amazon's quick response to this issue! ----------------------------- ORIGINAL REVIEW ----------------------------- As a very happy owner of three Echo Dots (2nd generation) I was glad to see Amazon release a 2nd generation of the Echo as well. After using it for several days I can say I'm quite pleased with it, and even though it doesn't have any radical new features compared with the 1st Generation Echo or the Echo Dot, there are some notable improvements. I'll summarize these differences first and then describe the new Echo in a bit more detail. Improvements over the Echo 1st Generation: - More color and texture choices - A swappable outer shell - Ability to output audio to another device or stereo system via Bluetooth or an auxiliary cable - Dolby-powered speakers - Significantly lower price! Differences from the Echo Dot (2nd gen): - Larger size and swappable outer shell (these are probably obvious) - 2 speakers (tweeter and woofer) vs. 1 - Power adapter sits flatter against the wall --------------------------- Overall appearance --------------------------- I purchased the \"Heather Gray Fabric\" version. The cloth is a polyester woven fabric made up of lighter and darker shades of gray which certainly gives it more visual interest than if it were just a solid, uniform gray. The neutral color blends in with nearly any decor, and the cloth gives it a softer look which is great for areas of your house where you don't want something that screams \"I'm a device!\" In terms of size, the Echo 2nd Generation is almost the same diameter (3.5\") as the 1st Generation Echo (3.3\"), but it is several inches shorter. To me the original Echo looked like a tower; this shorter version is much less ostentatious. The top of the device is identical to the 2nd Gen Echo Dot: it has four buttons (volume up, volume down, microphone off, and an \"action\" button), a multi-colored light ring around the edge that tells you about the Echo's status, and seven tiny holes below which the microphones sit. A new feature of this Echo is its swappable decorative shell. Simply press a button on the underside of the device and the shell slides right off, allowing you to replace it with any of the other shells that Amazon sells. I'm not sure how many people will take advantage of this feature given that additional shells are $20-30, but it could be useful if you want to change your Echo's look to match a different location in your home. A final note on appearance: the power adapter for the Echo sits fairly flat against the wall, protruding maybe 1.5\". By contrast, the Dot's adapter sticks out from the wall 2-3 inches. The flatter adapter of the Echo is nice if you want to plug it into an outlet that is behind a piece of furniture. -------------------- Audio quality -------------------- I did a side-by-side comparison of the 1st and 2nd Generation Echos, and despite the new Dolby-powered speakers I did not notice a significant difference in sound quality with either music or spoken text. I certainly wouldn't call it \"room filling sound\" in any case. Clarity isn't bad, but bass is nearly non-existent. However, the real potential improvement in sound quality comes not from the speakers themselves but from a new feature for 2nd Generation Echo devices: using Bluetooth or a 3.5mm auxiliary cable (not included), you can play the audio through a nearby speaker or stereo system. Yes, this does means you are using two devices to accomplish one thing, but in a sense it's no different than plugging any other sound source into your stereo system. To be honest, I don't generally think of the Echo primarily as a music playback device anyway other than for very casual listening (but I realize that puts me in a minority... admittedly I'm a bit of an audiophile). Compared with the Echo Dot, however, there IS a noticeable difference in sound. This shouldn't be a surprise given that the Echo has two speakers (a tweeter and a woofer) while the Dot has only one. To my ear the difference isn't so much in clarity but rather in fullness. With two speakers and a bit more acoustic \"heft,\" the Echo's sound has more presence than the Dot's, which to me makes it more tolerable to listen to for a period of time. The difference is even more appreciable with music than with newscasts or other spoken text. ------------------------- Voice recognition ------------------------- This is one area where I must confess I'm disappointed. Like the 2nd Generation of the Dot, the Echo 2nd Generation uses seven microphones beneath its top surface to recognize voice commands spoken from any direction. My wife and I both found this Echo to be slightly LESS proficient at detecting our voices and recognizing vocal commands than our Dots are. We did side-by-side comparisons of the Echo and the Dot in several locations around our house and the Dot was nearly always better at picking up our voices (and yes, we only had one plugged in at a time!). I'm not sure why this would be since both devices use similar technology, but the difference was pretty consistent. One possible explanation I can think of is this: Both devices have their microphone openings on their top surfaces, effectively pointing upward. Because the Echo is taller than the Dot, if you put both devices side by side and speak to them from several feet away, your voice will hit the Dot's microphones at a slightly more downward (i.e., direct) angle than the Echo's, which may help the Dot pick up your voice better. Obviously I'm only speculating here, but in support of this theory I have noticed that both devices have difficulty detecting my voice if I speak from below them (for example, if I'm sitting on the floor and the device is on a table). ------------------- Functionality ------------------- The bottom line is that overall functionality -- what the Echo 2nd generation \"does\" -- is nearly identical to the 1st generation Echo and the Dot. Keep in mind that the Alexa assistant software on which all Echos operate is run on Amazon's cloud, not your individual device. This means that as Amazon adds features to Alexa they automatically become available on all Echo devices. So, you can use any of them to: - Stream music via WiFi from multiple sources - Control smart home devices - Make hands-free calls to other Echo devices or phone numbers in North America - Make purchases from your Amazon Prime account - Listen to news feeds, podcasts, etc. - Do anything else in Alexa's ever-growing skill set, such as make shopping lists, set timers/alarms/reminders, play games, tell you your daily schedule, and any other skills Amazon dreams up for Alexa in the future. Personally I have two favorite Alexa skills: the Flash Briefing and the drop-in feature. The flash briefing is fully customizable daily \"digest\" of news and other information which you can hear any time by asking \"What's my flash briefing?\" There is a huge list of content you can add to your briefing including news updates, weather forecasts, sports and traffic updates, and educational snippets along with many that are just humorous or entertaining. Using the Alexa phone app or your Echo account page you can select exactly what content you want in your briefing and in what order you want to hear it. For example, I configured mine with NPR news, BBC news, the weather, and a word of the day. I love having an on-demand synopsis of the latest news from my favorite sources. My other favorite feature, \"drop in,\" essentially opens a two-way communication channel between any two Echo devices, sort of like an intercom. Simply ask Alexa to \"drop in on [the living room, the kitchen...]\" and you are instantly connected. My wife and I use this feature all the time when we need to communicate from opposite ends of the house. You can turn drop-in capability on or off for each of your Echo devices individually, and you can also choose whether each device can drop in with ANY Echo device or only those in your own home. [Note that the drop-in feature is NOT the same thing as Alexa's hands-free calling feature. Hands-free calling allows you to call most phone numbers and Echo devices in the U.S., Mexico, and Canada from your Echo by saying your contact's name or number. Just like with a phone call, the other person must choose to answer your call before you can communicate. By contrast, with the drop-in feature communication is instantly established. For this reason you will probably want to use drop-in only with your closest family and friends, and probably only for certain rooms in your home!] ----------------------------------- A few (minor) complaints ----------------------------------- Unfortunately the Echo 2nd Gen shares an annoying trait of the Echo Dot: widely varying volume levels within the daily Flash Briefing. As you listen to the briefing, some components (such as One America News) come through quietly while others (like Fox News) are much louder. I don't know whether this variability is due to differences in how each component of the feed is produced or whether it has to do with the device itself, but in any case I hoped the phenomenon would be less pronounced with the 2nd Generation Echo than it is with the Dot. Unfortunately, it is not. Just be prepared to adjust the volume at the beginning of each segment. Another complaint I have is the inability to listen to certain feeds outside of the Flash Briefing. One America News is an example here: you can listen to the channel's live feed any time, but you can only hear the channel's \"top stories summary\" as part of your Flash Briefing. This issue is probably more software than device related, but still, it bugs me. -------------- A few tips -------------- 1) The Echo seems to pick up voices best when placed at or below eye level (i.e., roughly the level from which your voice emits). Mine has trouble detecting voices coming from below it, so I don't recommend placing this on a high shelf. 2) When you select news feeds for your Flash briefing I recommend picking one U.S. source and one international source (I use NPR and BBC - both are excellent). If you add too many feeds you'll get a lot of overlap and hear the same story several times. 3) If you have multiple Echo devices in your home, sometimes speaking to one will cause others to respond as well, especially if they are in close proximity (like in adjacent rooms). One way to prevent this is to change the wake word of one of the devices to \"Echo\" or \"Amazon.\" The only downside is that you then have to remember which wake word you assigned to each device! 4) Some speakers have a bit of a \"burn-in\" period, so in an attempt to improve my Echo's sound I left it playing music for much of the first few days I had it. The sound did seem to improve a LITTLE, (the lower frequencies filled in some), but it's still not stellar. But if you're not happy with the sound at first, let it play frequently for a few days and it may improve a bit. -------------------------- Which one to buy? -------------------------- If you are trying to decide between the Echo and the Dot, think carefully about how you plan to use the device. The single biggest practical difference between the two is that the Echo has fuller, better quality sound. So if you plan to use the device mostly for listening to music, news, podcasts, or whatever, you will probably appreciate the Echo's better acoustics. On the other hand, if you want to use it mainly for voice control of smart home devices, the Dot is more than sufficient. I have a Dot in our home theater room that I use exclusively to control the lights in that room. For that type of single-purpose application anything more than a Dot would be overkill. ========== Bottom line ========== Although the Echo 2nd generation may not have any earth-shattering new features compared with the 1st generation, its significantly lower price and ability to send music to another speaker or stereo system make it a winner. If you already own a 1st generation Echo there probably isn't a compelling reason to upgrade because the difference in sound quality isn't significant. But if this is your first Echo device you will probably be very pleased with it. And if you are deciding between the Echo and the Dot, which one you purchase comes down to how you want to use the device. For heavy listening, the Echo may be preferable for its better acoustics; otherwise, the Dot is a great deal -- especially at half the price of the Echo!",
                "review_posted_date": "02 Nov 2017",
                "review_header": "Audio is IMPROVED after software update! See below for how to check it",
                "review_rating": "4.0 ",
                "review_author": "Frederick"
            }
        ],
        "url": "https://www.amazon.com/product-reviews/B06XCM9LJ4/ref=cm_cr_getr_d_paging_btm_1?ie=UTF8&reviewerType=all_reviews&pageNumber=1",
        "name": "",
        "price": ""
    }
]