[
    {
        "ratings": {
            "5": "10k+",
            "4": "4,406",
            "3": "735",
            "2": "230",
            "1": "233"
        },
        "reviews": [
            {
                "review_text": "Unless you're living under a rock, you've heard of Google Home and its capabilities. Whether or not you are a Google Home or Alexa user will inevitably depend on which ecosystem your invested in. If you're reading this, I'm assuming you're invested in the Google ecosystem or at least not so much invested into Amazon's Alexa. Either way, both of their \"mini\" devices (the Google Home mini and Alexa Echo Dot) are similar in their size and capabilities. They offer the voice link you need to your smart assistant without the advanced sound offerings. Yes, the mini will play music, etc. but it will never sound as good as any other Google Home speaker, including the Google Home. So assuming you're looking into investing in the Google Home ecosystem (I have, and I utilize it every single day) the Google Home mini PLUS GE smart bulb is a great way to start. It's also useful for anyone looking to add a Google Home mini to their house and adding smart bulbs (side note on smart bulbs, once you start buying them, you'll continue to do so, and you'll know they get expensive). In terms of setup of the mini, all you need is to download the Google Home app and plug in the mini. The home app will autmoatically detect it and set it up. Usually the first time set up requires an update that takes about 5 minutes. From there, the app does a good job of walking you through Google Home's capabilities and adjusting settings (such as what news will play when you say \"Hey Google, good morning\"). I've been very impressed with the app in terms of teaching you what the home could do. When it first came out, it was a complicated un-user friendly mess to navigate. I think for first time smart home users, you'll appreciate the east to set it up and learn its capabilities. In terms of the GE bulb, it too is straight forward. You screw it into a light socket. From there you can set it up through the GE app or Google Home. I prefer the Google Home app because I want to be able to control my home from one app without having to link services. For example, if you set up Phillips Hue bulbs, or GE lights through GE's app, you then have to link the services within the Home app. Not a big deal, but it's an unnecessary step for a \"dumb\" smart light bulb. I say this bulb is \"dumb\" because your options are to turn it on and off and adjust the brightness. Phillips light bulbs are a little more complex in how they're controlled which necessitates (in my opinion) utilization of the Phillips Hue app at times (like changing colors). Much like the mini, the Google Home app will find the bulb and set it up. The app walks you through assigning it to a room and from there, you just say \"Hey Google\" (near your Google home mini of course) and \"turn off light [so and so]:\" And voila. Turning lights on and off via voice is absolutely not necessary but its addicting and oftentimes, convenient. Plus, you can always turn it off from your phone from bed if say, you forgot to turn off the lamp before heading to bed. As I said from the beginning, this is a good value for those just getting to dabble in the smart home convenience. Maybe you only need/want a couple lights that you can control remotely and via voice, and if so, this is a perfect solution. The only reason I didn't give it 5 stars is because even though this package is a good value, it could be better given the deep discounts of the standalone Google Home mini around the holidays. « less",
                "review_posted_date": "07 Dec 2018",
                "review_header": "Good Value for Smart Home Beginners",
                "review_rating": "4",
                "review_author": "callmeageeth",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "The Google Home Mini is a great electronic device for everyday users interested in using Google’s voice assistant. For this review we will be evaluating the Google Home Mini based on the following criteria; initial setup, sound quality, style, durability, and price. This low-tech device is perfect for any age group who wants to simply stream music, ask questions, or call friends and family hands free. For first time users, the devices setup is timeless and straightforward allowing anyone to setup, personalize, and use their device in no time. The instructions provide a simple outline to follow that eliminates any possible issues when connecting your Google Home Mini to your Wi-Fi or network connection. To initiate the setup, the device requires that you create a google play account and download the Google Home app, but this will help you personalize your specific profile. By doing so, you can connect other apps to the device such as Spotify, YouTube, Netflix, and much more as updates become readily available. These features allow you to play your favorite music, movies, or videos just by simply telling the device to do so. When you ask the Google Home Mini to play something or ask a question, the design allows the sound of the music or voice being played to fill the entire room. The upward facing speakers propel the sound and improves the sounds quality, which enhances the users experience with this device. Compared to the Amazon Echo Dot, the Google Home Mini has an overall better capability to project the sound more clearly, making it easier to hear and accessible to use for older ages. The Google assistant built into the device allows you to change the volume output from anywhere in your house just by saying “Okay google, softer”. You will find that the style of this device fits in with a wide variety of home interior designs. The simple oval shape with the option to pick from three color choices can complement the look of any room in your home. If you are known to drop things, the outer shell of the device does an excellent job protecting the hardware with its strong durability to prevent any damage from occurring. For a low-tech product with high tech qualities, the device is well worth the cost. For around 50 dollars the Google Home Mini is an excellent voice assistant for the everyday user looking to get value out of their product. « less",
                "review_posted_date": "10 Feb 2018",
                "review_header": "Review of Google Home Mini",
                "review_rating": "4",
                "review_author": "Bob",
                "review_from": [
                    "walmart.com"
                ]
            },
            {
                "review_text": "As people, we search for ways to alleviate the constant stress we face every day. Now imagine an electronic assistant aiding in your daily endeavors. Through this device, your electronic devices are enhanced, collectively, for your benefit. This device is the Google Home Mini. Keeping and maintaining a schedule has its challenges; however, the Google Mini provides remedy, with its ability to connect electronically to your Google account. You have the ability to access your schedule at any time by simply speaking into the device, which is incredibly useful for anyone with busy schedules and a tendency for forgetfulness. This lightweight, compact device can be placed in any room of your choosing, as long as there's an outlet. Once you've bought a Google Home Mini, you may decide, one isn't enough. Luckily, the Google mini is compatible with other Google home devices, which come in a variety sizes. Aesthetically pleasing, the Google mini is a welcomed addition to any home. Although internally complex, this device is simplistic in its use. By saying Hey or Ok Google, you can interact with the Google mini in anyway necessary. The range of capabilities the Google Home Mini provides is extensive. Whether that be asking about the weather, or playing your favorite show on Netflix. Through collaboration with numerous apps and other devices, you can change your thermostat, set your alarm, dim your lights, or play newfound music. If you want to make life just a bit easier, the decision is obvious. The Google Home Mini is the first step towards enhanced efficiency. By incorporating your device with other compatible devices, anxiety can become a thing of the past. Have you ever forgot to unlock your front door? The Google Home mini can lock and unlock your door. Do you need a cup of coffee before the long work day? Tell the Google Home Mini and your compatible coffee machine will begin to brew a cup. The Google Home Mini is a reliable, affordable product, designed to assist with life, home and away. With the progression of technology, there is no better way to stay up to date than by incorporating this product into your daily functions. Managing work, family, and fun is a challenge, so do yourself a favor and consider the Google Home Mini. « less",
                "review_posted_date": "12 Feb 2018",
                "review_header": "Google Home Mini Review",
                "review_rating": "5",
                "review_author": "Michael",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "Pros: It's a quality device, heavy in the hand, and it's easy to set up assuming you already have a Google account. Cons: Lots not to like. Firstly, it doesn't always respond - if voice control is the only method of interaction, you better be sure that it hears you every time. If not, then you're extending the frustration of technology into your day to day life in a new and extremely irritating way. Secondly, be aware that some users of Google's Play Music service won't be able to listen to their music through this device. Why? No reason, just a bug that has been outstanding for most of 2017 and now into 2018 too. Finally, and most alarmingly, please don't get this device if you have small children. Kids learn from the interactions of those around them. They can't differentiate between a person's voice and a computer's, therefore if they hear you issuing commands to your Google home mini, they'll learn that it's ok to talk like that. I'm genuinely worried that we're creating a generation who won't 'get' interpersonal relationships, and who treat people as objects (for this reason and others, mostly technology related). That's a bigger debate, but fundamentally, this product is of limited use, doesn't work half the time, and brings undesirable behavioural changes into our homes. And before you discount me as some old coot shaking a fist at the moon, I'm a tech professional working for one of the biggest tech companies in the world, so I understand this market better than most. « less",
                "review_posted_date": "02 Apr 2018",
                "review_header": "Phil's review of Google Home Mini",
                "review_rating": "3",
                "review_author": "Phil",
                "review_from": [
                    "Currys"
                ]
            },
            {
                "review_text": "Pros: Mmm ok , small speaker, not to bad a sound . Pretty straight forward to set up . Cons: So to the meat of it , as an early adopter to the echo system I have had pretty great reviews of the echo line , in fact until you do a side by side comparison the glaring disadvantages don’t become clear . Just let me say I only bought the Google pebble due to there being no stock of any Echo dot available until the end of this month ,so shows who bought what at Christmas! Also there was a deal if you bought 3 you got a major discount,,,,, god knows I love major discounts.)* So to the reason I actually bought the Pebble , it was to connect with my car ,something you can do pretty easily with the Echo dot or so it seems ,I have yet to do that install. On opening the Google product ,it is ergonomic indeed but does not have the finish of the echo, it also does not have an Auxiliary out jack ,something that echo has on most of its products, yes you can blue tooth to a google product (speakers or chrome on computer ) but not to any old Bluetooth speaker ( limiting to say he least ) . On trying to connect to the car via my phones hot spot ,a big no can do .it will pick up the signal sometimes but after talking to a Google Home tech that particular connection is only used for some sort of testing form googles end ,hell if I could get my head around that ,plus of course there isn’t any auxiliary connection for me to connect to my car that way and as stated the blue tooth only works with Google products(duh!!! It’s 2018 it’s supposed to be a smart assistant). On to the Home use , I had several glitches with the assistants voice, on the app there seems to be two choices but on testing which one I wanted they were the same pleasant female tones.Somehow I did manage to get a male voice but it seems arbitrary as to when either one will be talking. At this point I think I got the males voice on initial set up. I guess the main bugaboo with the Pebble is that it’s too proprietary to googles ecosystem ,something I am still scratching my head about,but as a sheepish google tech admitted,google was playing the catch up game . So at present I’m all in with The Amazon echo line , Amazon please hear me when I say don’t drop the ball ( got the echo with video ,not so good at making out what I want at a distance please fix!!!) as to connectivity for smart products , I have yet to see which is better with handling those things . Hope this helps . « less",
                "review_posted_date": "07 Feb 2018",
                "review_header": "Andrew's review of Google Home Mini",
                "review_rating": "2",
                "review_author": "Andrew",
                "review_from": [
                    "Currys"
                ]
            },
            {
                "review_text": "First off let me say that the product itself is fine. It has reasonable sound for a speaker of its size and the mic picks up your voice commands really well. But sadly that’s where it ends. If like me you are a busy family you probably have a shared calendar, shared shopping list and all the other shareable things that make sure everyone in the family knows what they are doing I will also say from the outset that we are an Apple family. We own a HomePod and find it very useful but when the wife suggested a smart speaker for the kitchen there was no way I was spending another $400 for another HomePod so purely from a price point of view I looked at the Home Mini. Google has reasonable intergration with Apple and we use Gmail accounts so I didn’t foresee any problems. Sadly this smart speaker is really designed for individuality. I tried setting up the device with our shared family calendar so in the workings we could ask what was on for the day. I also really liked the shopping list feature in the google Home app. It was so easy to add items just by telling google to add them whilst you went through the fridge and pantry. This is what went wrong though. 1. You can only have one voice recognised per gmail account so if like us you share a family calendar only one of you will be able to ask google to read it out for you. 2. Even if you turn of the voice recognition you still can’t hear calendar events as it has to be on to get personalised information 3. You can’t use the same email address in the app on different devices, eg. I installed the app on my phone using the family email account and then installed the app on my wife’s phone but it would not allow me to register the device using the family email account. 4. Because of point 3 it means you can’t view a shared shopping list so for example if you are doing a quick shop on the way home a person at home can’t add items to the list so that they appear on your list. Sadly the Google Home really should have been called the Google Me and Google Mini Me as it only offers highly personalised use and no option to help the family. If you are looking for a smart speaker to help with family organisation steer clear of this, for now at least The upside is that this is all software based and can be corrected with an update by Google to offer some form of family option. « less",
                "review_posted_date": "23 May 2018",
                "review_header": "Don’t get this for family organisation",
                "review_rating": "2",
                "review_author": "Steve",
                "review_from": [
                    "ProductReview.com.au"
                ]
            },
            {
                "review_text": "This was our third Google Home Mini purchase, which we bought after getting 2 standard Google Home assistants and 2 Home Minis about 10 months ago. We love them all! We purchased them initially because it gave us the ability to designate speaker \"groups\" for playing music in different areas of the house or throughout the entire house, which we thought would be very convenient for parties. And it is!!! The sound is great for the compact size, and for just playing music in certain rooms, the addition of the Mini with its relatively low cost allows you to have that capability in several areas without spending a ton. And it's nice that they are so portable from one location to another. We've attempted to figure out the best music service to use with the Google Home, but this will be more of a personal preference. The Google Home products work with Google Play Music, YouTube Music, Spotify, Pandora, and Deezer. Some of these have limited options you can use without purchasing a subscription, but we did find that many of the songs we asked for were not available without a subscription. So...if you're not a current subscriber or are opposed to a music subscription service, you may wish to investigate prior to making a purchase. We chose to try the Spotify free trial, which we really do enjoy. However, we have found that only one device (or device group) per Spotify user (subscription) can be using the service at a time, but this is a Spotify subscription limitation, not a Google Home issue. It's just something to be aware of if you are a novice comparing music services. Prior to purchasing Google Home products, we had not had experience using an \"Assistant\" of any kind, so I cannot compare ease of use or capabilities to other models, but the Google Home app was very easy to set up on our phones and once we did, setting up the speakers was straight forward and easy too. It has been nice to have them around for questions without having to stop what you're doing to look things up, like if you need measurement conversions from ml to cups for a recipe, or something similar, you just ask! And if you need to pause the music, you just say so instead of tracking down your phone to tap pause. It is quite convenient, especially if you have dirty hands or need to act quickly. My understanding is that there are also Roku sticks that are compatible with the Google Home/Assistant for voice controls, which we do have, but we have not attempted to use that feature. The only reason I rated the Mini at 4 stars instead of 5 is because the touch controls are different from the standard Google Home, and it would be much easier if they both operated the same way. It's not difficult to use the controls on either device, but if a customer has both types and takes a little time to catch on to new things, I can see the differences being confusing to someone who has challenges with operating electronics. Overall, we LOVE the Google Home products. It should be noted that if you're on the fence about trying this line, you can use the Home Mini on its own without the standard Google Home. This provides the option of testing the capabilities of the Google Assistant and the music services without a large initial investment so you can determine if it fits in with your lifestyle and what you want it to do. We also found that it makes a nice gift! These products have definitely met our expectations, and we would recommend giving them a try! « less",
                "review_posted_date": "27 Sep 2018",
                "review_header": "This was our third Google Home Mini purchase, which we bought after getting 2 standard Google Hom...",
                "review_rating": "4",
                "review_author": "DesignerJen",
                "review_from": [
                    "Home Depot"
                ]
            },
            {
                "review_text": "I am making a switch to the Google Home platform and the Home Mini was a nice add-on device. I have used the Amazon Echo Dot and have made a few comparisons herein. The GE Smart Bulb was also a great way to acclimate to the Google Assistant smart home capabilities. Both were well priced when on sale ($35.00 for the combined Mini and the GE C Life Bulb). GOOGLE HOME MINI REVIEW PROS: At a high level the Home Mini does everything that the Home Hub and and the Home Max deliver with Google Assistant. Sounds better than the Echo Dot (comparatively better range, richer sound). I like the appearance with the fabric cover and color options available. The Home Mini is a very affordable entry smart home hub that can integrate with Internet of Things (IoT) devices (i.e. TP-Link, Philips Hue, Wemo, etc. or anything compatible with Google Assistant. FEATURES / EXPERIENCE: You can place a call free phone call, stream music through music apps like Pandora, Spotify, YouTube Music, etc. Easy integration with Google Chromecast and use voice command to launch YouTube. Netflix, etc. to your TV. You can send the Mini audio to other speakers with Bluetooth. CONS: Touch controls are not intuitive. The Mini does not have a 3.5mm auxillary output jack like the Echo Dot. The indicator lights on top are not easy to see from a distance (unlike the light ring on the Echo Dot) SUMMARY: The Home Mini significantly lacks in sound quality and speaker capabilities compared to the Home Hub or Home Max. That should be expected with the considerable lower price point. Because of this it should supplement an anchor speaker to the Home Hub or Home Max in your Google Home platform. While the touch controls are not intuitive (tap and swipe on the side) you will likely use voice controls most of the time. I would recommend this as an affordable means to expand your Google Assistant options and start a Google smart home platform. GE SMART BULB REVIEW PROS: Hubless Bluetooth set-up makes it easy. Well priced for introduction to smart home lighting. Designed for beginners. Delivers 800 lumens to light a standard size room (i.e. bedroom). FEATURES: The Bluetooth \"C App\" allows you to create custom set-ups for waking up or for early evening hours. The bulbs can also automatically switch from more intensity in the day to softer tones at night - or vice versa. CONS: Limited options and too simplistic with the GE \"C app\". Only dimmable and not capable of changing colors. SUMMARY: Great way to get started with a smart house option that is easy to integrate. However, there are much better and more robust smart home lighting options available for integration with Google Assistant or Amazon Alexa. « less",
                "review_posted_date": "03 Jan 2019",
                "review_header": "Affordable Option to Start a Google Smart Home",
                "review_rating": "3",
                "review_author": "Rick",
                "review_from": [
                    "lowes.com"
                ]
            },
            {
                "review_text": "Description Google Mini: The Google Home Mini is a voice-controlled speaker that can be used for controlling smart devices like the enclosed light bulb alone or other brand bulbs with a hub, asking questions of Google, set up an alarm to wake up, ask for the time or weather, listening to music or even listening to the radio, which is definitely cheaper than buying a radio. Set Up for Google Mini and Bulb: Set up is very simple. Download the Google Assist app onto your phone and let it find the Google Mini with Bluetooth on. Once it is found, you can control the bulb through the Google Home Mini with voice or use the Google app on your phone if you are away from home turning it off or on both verbal and via the app. No hub is required like other bulbs. You can also dim the bulb by telling Google Mini to do it by the percentage you would like it at from 1% (use as a nightlight) and up to 100% if you want it back to normal 60W. Light Bulb: The GE C-Life bulb is an inexpensive bulb and with this you can see if you like having smart bulbs in your home. It replaces a standard 60-watt bulb. I am amazed at how much electricity I have saved by having these type bulbs throughout my home and they are VERY long-lasting compared to regular bulbs. The bulb is rated to last up to 20 years, so you don’t have to worry about changing the bulbs. C by GE app: If you want to set up the light automatically to turn on/off at a certain time of day or night time this app will let you do it. This way you can have the lights on when you come home from work before you walk in the door or are away on vacation, so it looks like someone is home. Other than that I see no need for downloading this app, but it is a really nice feature. Recommendation: I think this is a great inexpensive way to start a Smart Home. This is the way I started my Smart Home but with a MUCH more expensive starter system that had to include a hub to make it work. « less",
                "review_posted_date": "07 Dec 2018",
                "review_header": "You Light Up My Life",
                "review_rating": "5",
                "review_author": "LindaCT",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "The Google Home Mini makes so many little things easier - ask it the time, check your calendar, set a timer or an alarm, broadcast messages to other Google Homes, add items to a shopping list, play music, turn lights on / off all with voice control. To be honest, any of these things can be achieved in many different ways, but this is a hassle free, hands free and pretty cool way to do do them. Audio - the sound quality is acceptable for regular questions or commands, but below par if you are playing music. The larger Google Home devices would probably be better for music. Home Automation - will connect with many automated lights / switches and works easily most of the time. Naturally, it integrates flawlessly with the Google Chromecast Audio / Video and makes casting audio or video a breeze. Time Management - we use the 'Set A Timer' or 'Set An Alarm' function the most on the Google Home. Quick, easy and hands free. Great when you are cooking tea. Shopping List - this is a great function, you can shout out what you need with your head buried in the fridge or pantry, and it gets it right most of the time. Then when you get to the shops, you can access the list on your mobile phone. Broadcast - great to call the kids down for breakfast / lunch / tea. Granted, shouting across the house would work just as well, but this is a bit cooler. Asking a Question - behind this little box is the full knowledge of Google, and that is so handy when you find yourself wondering who sings a particular song / what day of the week the 18th of July will be on this year / or Michael Jacksons kids names. Whatever random question pops into you head can be answered accurately and quickly just by saying it out loud. Cons - - sometimes misinterprets what you say. It won't tolerate muttering, background noise, or 2 people talking - relies on good internet connection at all times Overall, it is a fun and useful toy. But it is definitely a toy, not a tool - albeit a really cool toy! « less",
                "review_posted_date": "18 Apr 2018",
                "review_header": "A Handy Little Helper",
                "review_rating": "4",
                "review_author": "Andrew",
                "review_from": [
                    "ProductReview.com.au"
                ]
            }
        ],
        "url": "https://www.google.com/shopping/product/7008326304182003253/reviews?q=google%20home&biw=1280&bih=639&prds=paur:ClkAsKraX8Po_BNHjxH-Yuazffm_I6ZTl-XFq7J9Cju-IhsWprvvBNQVbAtjPnj9S-0c283EL4MEVkciNKzFUhQXZKcjVzNzGHrLZrnO3-VSZ8ZUtWFeHIPJ5RIZAFPVH70GN1g15WffBXvfhjuFbXBgEL2GyQ,rstart:10&sa=X&ved=0ahUKEwiz2_iUuPXfAhWHhlQKHTSKCMUQqSQI-gE",
        "name": "Google Home Mini Smart Speaker - Chalk",
        "price": "$29"
    },
    {
        "ratings": {
            "5": "10k+",
            "4": "4,406",
            "3": "735",
            "2": "230",
            "1": "233"
        },
        "reviews": [
            {
                "review_text": "Pros: Very sensitive and pretty good in recognising individual voices. Excellent sound quality and loudness from such a small device. Great in turning TV's on and off, controling volume and playing Youtube vids via Chromecast with voice commands to control and voice commands to request specific videos. Very fast answers to questions calculations and conversions. Looks great (Charcoal one) small footprint and very unobtrusive. Easy to set-up and use. Like it so much I have bought a 2nd one for use in another room. Cons: The top 'tap' buttons have been permanently disabled by Google re the fact that the buttons have proved on some minis to be so sensitive that they self activate and the device uploads all voices heard and records on Google Servers. The fact that they have done this is good for security reasons but is bad for functionality as now always have to say 'OK or Hey Google' to activate rather than be able to press a button to then give a verbal command. Either an area of poor design or poor component quality re the top 'tap' buttons. But for this Google error I would have scored it 10 for overall and design instead of 8. « less",
                "review_posted_date": "26 Oct 2017",
                "review_header": "Brian's review of Google Home Mini",
                "review_rating": "4",
                "review_author": "Brian",
                "review_from": [
                    "Currys"
                ]
            },
            {
                "review_text": "This Google Smart Light Starter Kit pairs the Google Home Mini with a smart bulb for a convenient way to smarten up any room in your home that has access to WiFi. Packaged in a convenient, simple kit, these two devices give novice users a small taste of the smart device world and experienced users a small, reliable device to expand their smart home. The included bulb is a GE C-Life smart bulb, with quality that is standard for the market - not a lot of frills but useful in its limited functions. Installation is as simple as screwing in a light bulb, literally. After plugging in the Mini and going through a short set of start-up prompts using the free Google Home app, pairing the bulb with the speaker was a quick, painless process. From the app, you can adjust the light, or you can speak aloud for the brightness setting. You can also set a timer or schedule for the light to turn on and off and at your chosen brightness. Simple, useful, smart. The Mini itself is nice and louder than I expected. It catches my voice from the next room over if I speak clearly and without much interference, giving me useful answers to my questions about the day's weather, traffic on my route to work, the last day's news cycle, sports scores, etc. It sets timers and tells jokes on cue - all the useful and useless things you will come to expect from a smart device. Overall, I think this is a nice value for a starter kit. The Mini is responsive, useful, and unobtrusive, while the bulb does the job. Easy to recommend for those looking for an inexpensive way to get their foot in the door of a future smart home. Full disclosure, I received this product for my honest, unbiased review. « less",
                "review_posted_date": "07 Dec 2018",
                "review_header": "Simple, convenient gateway to smart home",
                "review_rating": "5",
                "review_author": "NJRY",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "I've owned several Amazon Echo devices and a Google Home and can say they're both useful additions to the home - having access to information and utilities like setting timers is incredibly useful in everyday life, in the kitchen, etc. I like the Home mini's aesthetics more than the Echo Dot - the fabric cover looks and feels nice, and the four LEDs to display status are nice and subdued. The speaker on the device is decent, but not great. You'll want one of the full-size versions (Google Home or Amazon Echo gen. 2) if you'd like to listen to any music on the speaker with any real fidelity. However, for listening to voice responses, podcasts, or audiobooks, the Home Mini's speaker works just fine. The size is convenient and lets you install it just about anywhere in the home. You can even get some command strips and hang it on a wall easily. That said, it's pretty stylish and you'll probably want to display it somewhere openly to add to a room. The Home Mini is backed by Google's AI technology, so it's superior to the Echo (and, likely, the upcoming Apple HomePod speaker using Siri) for answering questions and queries, but currently, the Echo has a wider range of third-party services it supports through its \"Skills\" system. Google will probably catch up eventually, but for now, its main use is answering simple questions, starting timers and setting reminders, and helping you with connected google services like Google Calendar. You can also use the speaker as a Google Cast device to cast audio to its speaker, and even connect it with other Google Cast-compatible speakers to set up a multi-room audio solution. Again, the speaker isn't great, but it'll get the job done. Overall this is a nice showing from Google, and it's good to see these smart assistant devices starting to become more affordable than ever. « less",
                "review_posted_date": "11 Dec 2017",
                "review_header": "A solid smart assistant for Google service users",
                "review_rating": "4",
                "review_author": "Argus9",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "BACKGROUND: I had been researching the smart home devices and systems but was unsure which company to use. The opportunity to evaluate the Google Home Mini with a smart bulb was too good to pass up. By the time is was over we had seven (7) different devices. FIT AND FINISH: I received the Home Mini Chalk color, an off-white, which is unobtrusive. The mini is just a few inches across. The smart bulb is a GE dimmable LED. INSTALLATION: Take the unit out of the box, install the light bulb. download the Google Home app, plug in the power, and follow the instructions in the app. OPERATION: The app is the main control point for the device and offers several customization features. Google home devices are advertised as a voice recognition devices and all devices (Home, Mini, Max, Hub) provide the same Smart Home features, although Home Hub has a display. We found the Mini great at voice recognition. You can train the Mini to recognize your voice. Even with conversations in a room it can distinguish a voice it is trained to. When you associate different personal accounts, mail, calendar, and media streaming the Mini creates a personalized response. If I ask for my schedule it give me my calendar information. My wife receives her calendar schedule. The mini will respond to other voices (it responded to a television add!!!) but will not give personalized information. The smart light offers the ability to control the light using voice commands, or to control it remotely using the Google home/assistant apps. I can turn the light on or off, or change the brightness even if I am away from home. There is a learning curve associated with how to ask for a response. There is a lot of information on the internet, but no definitive source. (See CONS below.) PROS: Fairly easy to set up and use. Provides smart home control. \"Broadcast\" function acts like a home intercom! I used the broadcast function, via Google assistant to talk with my son while I was several miles away! And with a mini in my shop my wife and I can communicate quickly. CONS: It is difficult to determine what the Mini can do. There is no easily accessible manual, list of features, or troubleshooting. To me this is a major drawback to a voice response system. Too many times I asked for something and got a response like “I’m sorry, I can’t do that yet.” The main point of contact is the Google support website chat feature. I found the chat to be helpful, but very time consuming. I even asked the chat technician where I could find the answer to a question online and he was unable to find it via publicly accessible means. Ironic I can’t Google an answer for a Google product! SUMMARY: If you aren’t sure if you want to do a smart home the Google Mini with GE light is a great start! « less",
                "review_posted_date": "28 Dec 2018",
                "review_header": "A GOOD START TO THE SMART HOME EXPERIENC",
                "review_rating": "4",
                "review_author": "Pete",
                "review_from": [
                    "lowes.com"
                ]
            },
            {
                "review_text": "Pro Easy setup Faster response Con Short range Not that bright and yellow Must be paired to either Google Home or GE’s app Limited integration This is mostly a review on the C-Life and its functionality so I won’t go to much into the Google Home Mini. I’ll just say that the Mini is a great device, with a good speaker and can be linked to various smart devices. I'm only recommending this because you’re getting a great device with the Mini and get a bonus bulb to try out. The C-Life bulbs are basic and are better suited to smaller homes or those who are not smart home enthusiasts. They’re dimmable but the light gives off a warm yellow tint, and isn’t very bright. They are only a little cheaper than the better C-Sleep bulbs. They also do not integrate with any other smart home systems like SmartThings, Wink, Apple HomeKit, or IFTTT. And even though it’s bluetooth, you can only pair with the Google Home or your phone (not both). There are some advantages of choosing the bluetooth C-Life bulbs over the standard smart bulbs (WiFi, ZigBee, or Z-Wave). It’s easier to set up, has a faster response time, and the bulbs are a bit cheaper. However they have a much shorter range and requires the controlling device (either the phone or Google Home) to be close by. According to their FAQ, multiple bulbs form a mesh that help relay the commands to each other and having multiple Google Home devices is more efficient. The setup with Google Home was very simple. You don’t need the GE app since everything can be done through the Google Home App, without needing their C-Reach Hub. Once connected, you can control it with Google Home and any device compatible with Google Assistant (phones, android TV, speakers, etc.). Through the Google Home App, you can turn on/off, dim, and setup routines and schedules. The routines settings are a little buried within the menus but you shouldn’t have to access these very often. Really it’s the Google Home App that gives these bulbs better functionality. While I recommend the Google Home Mini, I can’t say the same for the C-Life. It’s just not good enough on its own. It may get better if they come out with more products that work with other systems. « less",
                "review_posted_date": "01 Dec 2018",
                "review_header": "Google Home Mini is great. Bulb is basic.",
                "review_rating": "4",
                "review_author": "BeingHonest",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "[[ Setup ]] The setup process was very easy. Install the smart bulb and plug in the Google Home Mini in the same room. Since the bulb is Bluetooth-based, it will only work a short distance from the Google Home Mini. 1. Download the Google Home app to your iPhone, iPad or Android device. Upon opening the app, I saw a banner asking me to \"Setup 1 Device\". 2. The app walked me through setting up the Google Home Mini first. 3. The app then automatically asked me if I wanted to setup the bulb. It quickly found the bulb and added it to my Google Home profile. [[ Performance ]] I have a mix of both Amazon's Alexa and Google Home at my house and I find that the Google Home is a little better at understanding my voice commands and a little quicker at responding. I was pleasantly surprised at the sound performance of the Home Mini's speaker. It's definitely better than the Amazon Echo (2nd generation) with decent minds and highs and a tiny bit of bass. Listening to Pandora was definitely doable and sounded a lot better than my iPhone's built-in speakers. The Google Home Mini also is fast to control the included GE smart bulb, responding almost instantly to commands to turn the bulb on and off and also to adjust the brightness. However, the bulb connects via Bluetooth, which limits its range compared to other wireless connections such as WiFi, Zwave and Zigbee. Therefore, the Google Home Mini and the GE smart bulb should be located in the same room (or the next room over) to avoid communications issues. [[ Features ]] The GE smart bulb does what most smart bulbs do: turns on and off and dims from 0% to 100%. Unfortunately, the bulb only outputs a \"daylight\" color temperature only and cannot change to a warmer (or colder) white color. It is also not a multi-color bulb, so you can't change it to \"red,\" for example. The Google Home Mini can do a lot more than control this one bulb. It can give you the weather, check your calendar, control other smart home products (like Philips Hue and Samsung SmartThings), play Pandora and much more. Unfortunately, the bulb included with this kit will not work with an Amazon Echo and it requires a separate hub to work with Alexa. [[ Value ]] Whether you're just getting started with a smart home or you're converting from Alexa to Google Home (or maybe maintaining both?), this starter pack is a quick and easy way to jump into home automation. The setup process is very easy thanks to the Google Home app's awareness of the Google Home Mini and smart bulb combo and the app easily walks you through the process of getting both up and running. « less",
                "review_posted_date": "04 Dec 2018",
                "review_header": "A Great Way to Get Started on Your Smart Home",
                "review_rating": "5",
                "review_author": "TechnicallyWell",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "We have Google Home and these Google Minis are absolutely perfect for other rooms in the house where we want something a little smaller! We use it so often to check the weather and ask it other random questions that we didn't want to constantly have to be near the main unit to use it. We placed a Mini in our master bedroom upstairs and we use it every morning and every night at the very least. We also use it frequently to play music while we sort laundry on our bed with our 5 kids (that takes a while and the music makes it seem like a little less of a chore.) The sound quality has been excellent and we have had zero issues with it since we bought them. We even bought another one to give one of our daughters for her basement bedroom. She chooses her school clothes each day based on the weather forecast and we don't allow smartphone or tablets in bedrooms (for social media purposes and because our kids would probably hide away in their rooms), so this is the only way she can check the weather without having to come upstairs to ask the main Google Home about the weather forecast. I have the one in our bedroom set up to my own voice so that when I say \"Good Morning\" to it, it tells me the current temperature, the forecast for the day, and what's on my calendar. I can also opt (through the app) to have it tell me about news stories, my work commute and traffic, the stock market, and other options that I can't remember because I don't use them. (I work from home so I have no traffic commute but I bet that would be a helpful feature for those that do!) I prefer Google Home over Amazon's Alexa, but do hope Google will start coming out with more products that are compatible with Google Home. I see a LOT of products as being compatible with Alexa but Google seems to be falling a little short in that category. It's not importatn enough to me to warrant buying an Alexa as we really love playing games on our Google Home and enjoy the many features, but something to consider if you're wanting a lot of add-ons that are compatible with your smarthome product. « less",
                "review_posted_date": "10 Jan 2019",
                "review_header": "Love so much we bought more!",
                "review_rating": "5",
                "review_author": "MultiTaskingGenius",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "We purchased a Google Home Mini for a blind friend. I help her with her tech and can attest to her frustration at trying to use Web sites with a screen reader. (Imagine something reading every link and ad and heading on a Web page when you are trying to get to certain content!) She was wary of getting yet another device at first, and I made sure she knew we were happy to return this product if she didn't like it. But she has really taken to it. The Google Home Mini is the size of a donut and is really a speaker with smart capabilities when set up with your home Wi-Fi network. It has a microphone on/off switch and a USB cord output that connects to a power plug because it needs to be powered from a wall outlet. My friend put her Google Home Mini on her dining room table. It has great sound for such a small device, and can give her the time, weather, and look up local businesses' operating hours and telephone numbers (and make calls over Wi-Fi -- although the call quality isn't that great when I tested it with her). She can have it set a timer or search for a recipe from the Internet, for say, a cake or something and then read her the directions one by one when she is ready. You can say, Hey Google, play KCBS-AM San Francisco or WBBM-AM Chicago or WCBS-AM New York, or many other stations nationwide, and it will do it! It will play podcasts, such as cooking podcasts or Spanish podcasts. We are still finding out all that it can do! Two complaints: 1) You cannot setup the Google Home Mini out of the box using a computer. You need a tablet or smart phone and have to download the Google Home App to that first in order to set up the Google Home Mini. My friend doesn't have a smart phone or tablet. As a work around, I downloaded the Google Home App to my smart phone, added her Google account to my phone, and set up her Google Home Mini and chose her default news outlets and other settings. After a week or two, I deleted the app and her account from my smart phone so that her contacts and information would not be on my phone. But I really wish you could set up Google Home Mini without doing this. 2) As of this writing, Google Home Mini would not simply play audio from a YouTube clip over its speaker. It can send a YouTube clip to a TV that has a Chromecast device attached, but it'd be better if it could also just play the audio portion on the Google Home Mini speaker without having to connect to another device. But overall, I think the Google Home Mini (and the Amazon Echo) have great potential for blind and visually impaired people. Any of the features I mentioned can also be helpful to a sighted person, of course, but for a blind person or a busy parent in a house with children (little time to sit and type on a keyboard), I can really see the Google Home Mini being extra useful. « less",
                "review_posted_date": "11 Jan 2018",
                "review_header": "Many uses for blind person and sighted people too",
                "review_rating": "5",
                "review_author": "MadisonDad",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "This one is simple: If you already invested in a few Amazon products like the Fire Stick and Echo and Echo Dot/Show/Spot, then keep using those products. If you use Google products like the Play Music subscription, Chromecast and the Google Assistant, then using the Google Home might be a better solution. I previously had 3 Echo dot around my house but found my self wanting to make the most use out of my Chromecast and Music subscription. Seeing as only Google supports their own music service, I replaced the Dots with some Home Minis. Setup was very easy. Use the Google Home app and it will find the Home Mini like a Chromecast. You can then set up additional features and link other accounts. If you do home automation, this is when you link your hub and create rooms and place your switches and sensors in each rooms. The Home is better than Echo dot at understanding what you want. It also can recognize your voice a lot better that the Echo. While Amazon, has had their products for a long time, Google clearly wins when it comes to being the best assistant. The speakers on the Home mini are much louder than an Echo Dot. And I mean much much louder. The difference is incredible. I used to run the Echo do on max volume and it was pretty disappointing. With the Home mini, even at half volume, it is kind of loud. It'll do much better at playing music. I do wish that the Home Mini would take a USB-C to power but since the power supply is included, it doesn't really bother me that much. Overall, this is a good device for use with home automation and playing music and being loud in general. I prefer it a lot more over the Echo Dot and I will probably get a 4th one for the guest room. « less",
                "review_posted_date": "17 Dec 2017",
                "review_header": "Good for Home Automation",
                "review_rating": "4",
                "review_author": "David",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "After owning the full size Google Home, I was interested in the Google Home Mini for my nightstand to use as a Bluetooth speaker and alarm clock. When Black Friday came around and the price dropped to $29 I had to pick it up. Set up is a breeze with the Google Home Mini functioning in a few taps of the app. For my purposes this works perfect. A small speaker that can get reasonably loud in my bedroom. The sound isn't great, but at low volumes it's pleasant and clear. I purchased the Chromecast Audio to stream over wifi to my bedroom stereo for better sound. The voice integration works great. Now when I walk in my room I have the ability to start up the music on either the Google Home Mini or my bedroom stereo all by voice or by smart phone or tablet. I also have a Chromecast which can be operated by voice, but I think it's much better to use your smart phone or tablet. Easy to set the alarm by just telling it to set an alarm. I'm debating adding a Wemo switch to make my lights voice activated like I've done in my living room. All the other Google Assistant stuff is just an added bonus. One thing that makes the Google Home Products stand out in my mind is the ability to ask more complex questions. With Alexa I can ask fairly simple questions and she can't understand what I'm trying to ask. Google is much better with this. Another great thing is that Google regularly updates the product to add new features. Since I've had my Google Home they've added Bluetooth streaming, equalizer, new games and activities. At this price point, this product is awesome and will get better with time. What would make it better is a 3.5mm jack so I don't have to buy an additional Google product to connect it to my stereo. « less",
                "review_posted_date": "01 Dec 2017",
                "review_header": "Makes a great nightstand speaker/alarm",
                "review_rating": "5",
                "review_author": "BK78",
                "review_from": [
                    "Best Buy"
                ]
            }
        ],
        "url": "https://www.google.com/shopping/product/7008326304182003253/reviews?q=google%20home&biw=1280&bih=639&prds=paur:ClkAsKraX8Po_BNHjxH-Yuazffm_I6ZTl-XFq7J9Cju-IhsWprvvBNQVbAtjPnj9S-0c283EL4MEVkciNKzFUhQXZKcjVzNzGHrLZrnO3-VSZ8ZUtWFeHIPJ5RIZAFPVH70GN1g15WffBXvfhjuFbXBgEL2GyQ,rstart:20&sa=X&ved=0ahUKEwiz2_iUuPXfAhWHhlQKHTSKCMUQqSQI-gE",
        "name": "Google Home Mini Smart Speaker - Chalk",
        "price": "$29"
    },
    {
        "ratings": {
            "5": "10k+",
            "4": "4,406",
            "3": "735",
            "2": "230",
            "1": "233"
        },
        "reviews": [
            {
                "review_text": "Google - Smart Light Starter Kit with Google Assistant The Google smart light starter kit with Google assistant is a great entry point into the smart home movement. It comes with a Google home mini and a GE C-life dim-able led smart light bulb. If you’re just starting out or are expanding your lighting devices, this is a good bargain. The Google mini is a very clean and modern looking device that takes up little space on the night stand. The speaker is fair, but not great. (If you want to listen to music on the speaker with any real fidelity, you will want to get the full-size Google home or the Google home max.) However, for listening to voice responses, alarms, or audio books, the Home Mini's speaker works just fine. Where it really shines, is that you can now control the included light bulb with your voice. I replaced the standard light bulb in my nightstand lamp, and am able to turn it on, off, or dim it with just a voice command. Feels kind of like stepping into a Star Trek episode and telling the computer to turn the lights on. The GE C-life bulb connects to the Google mini assistant via Bluetooth, so the Google mini has to be in close proximity to the bulb for it to work, the package recommends within 50 feet. All in all, it is a good purchase and getting both devices in a starter kit really maximizes the savings. « less",
                "review_posted_date": "17 Dec 2018",
                "review_header": "Great home automation starter unit!",
                "review_rating": "4",
                "review_author": "Storyteller",
                "review_from": [
                    "lowes.com"
                ]
            },
            {
                "review_text": "Google Home Mini (Smart Light Starter Kit) The Mini is strikingly small with a neutral, somewhat boring look, but that’s okay if you plan on putting these all over the home. The Mini’s size is perfect for getting out of the way and blending into the living room or kitchen, while still packing a decent speaker and touch controls for accessing volume. It’s also very appreciated that there’s a dedicated hardware switch to turn off the microphone, whether you just want a little privacy, or a friend doesn’t feel too comfortable house sitting with it on. Setting up the Google Home Mini is simple enough: Plug it in, download the Google Home app, sign-in to your Gmail/Google account, and the app walks you through the rest. You’ll be up and running in about 5 minutes. Google Home Mini is proving to be the easiest way to have your Google Assistant be omnipresent throughout your home. It’s a smart speaker that gets out of the way and doesn’t call attention from houseguests. Over time, you just expect it to be there and you’re able to just say “Hey Google,” and a hands-free portal to the web and your home opens. After saying the trigger phrase, you can ask anything from “Who was the 21st president of the USA,” to “What’s on my calendar for tomorrow?” This kit is particular is a great way to get introduced to the amazing smart home control capabilities that Google Assistant has. The included smart light bulb shows you a hint at what’s possible throughout the house. You can go into the Home app and setup rooms, give them names, tell the app where the bulb is, and then the magic happens: “Hey Google, turn on the bedroom lamp.” Awesome. It’s a great companion that seems like it can be placed anywhere. Voice control will most likely be the chosen method of control by most, but the Google Home app is outstanding for updating settings, learning what the Mini can do, and especially, streaming music to the device. Playing music through the Mini is a pleasant and simple experience, though, the speaker is a little weak to get too loud. That said, as a “set it and forget” device that disappears into the background of your bookshelf, all while providing your family a seriously smart assistant, the Mini is a worthy purchase. « less",
                "review_posted_date": "18 Dec 2018",
                "review_header": "Making your home smarter",
                "review_rating": "5",
                "review_author": "Vingole",
                "review_from": [
                    "lowes.com"
                ]
            },
            {
                "review_text": "Smart lights and smart speakers have been becoming increasingly popular as of late - allowing all of us to live out the fantasy of living on board the starship Enterprise and being able to boss our home around. But, oddly enough, you don't see much by the way of combination packs yet. This kit seeks to change that. There's nothing particularly notable about the contents - the provided bulb is fairly basic and incapable of doing much more than dimming, and the Google Home Mini is the most compact and basic device in the Home lineup. Sufficed to say there's a lot you don't get if you're planning to convert every room to smart lighting. But it's the perfect sampler configuration to let you work out if smart lighting is something that's actually worth investing more money in. Google has gone out of their way to make the process as painless as possible as well. The mini comes out of the box ready to pair with the bulb, and the excellent Home app will guide you through setup without any kind of fuss. It only takes a few minutes to get everything up and running, and from there controlling the light is as easy as telling the Mini what you want. If you do decide to take the plunge afterwards, the bulb they provided is one of the more affordable options for smart lighting and performs very well. There are definitely better systems for those willing to pay an extra premium, but if you're used to standard bulbs I don't think you'll have any complaints about this. Best part is that even if you do decide that smart lighting isn't worth investing in, a Google Home Mini is a pretty awesome device to have. it's a halfway decent speaker, a really good alarm clock, and a white noise machine among other things. As such I have no difficulty recommending it to anyone who's curious about setting up their own smart home. « less",
                "review_posted_date": "01 Dec 2018",
                "review_header": "Great way to test the waters of smart lighting",
                "review_rating": "5",
                "review_author": "Batlacit",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "For the purposes of this review, I'm sticking solely to the lighting kit - I've previously reviewed the C-Life bulbs and quite frankly, I find their strategy of limiting controlling the lights to either a Google Home or App premise severely limiting. So this review will be written from the stance of what I believe this kit to be - a practical gateway into building a smart home. The kit comes with a chalk white Google Home mini and a single light bulb. Google's Home mini is their smallest device that also boasts the full power of Google Assistant and home automation. Depending on where you are in your smart home journey, you might find that some smart home devices work better with Google Home than others do. An important item of note is - just because something works with Google Assistant does not mean it'll work seamlessly with Google Home. For example, my GE C-Life, Wemo, Hue, Sengled lights all work with the Google Home. So too, does my Simplisafe alarm system and Logitech Harmony setup. However, the one that doesn't play nice out of the box is my Ring video doorbell. Not really surprising since Amazon bought Ring. I also have a Chamberlin garage door opener, but they want me to pay to link my accounts... no thank you. I added the smart light to my existing setup in my home office as well as the Google Home mini. I honestly have nothing but good things to say about Google's platform. The AI is intelligent and always learning, and you can also mute the microphones when company comes over. If you're feeling paranoid, you can also log into your Google account and verify nothing's been recorded when the mic is off and you can also delete your request history. I set up the bulb that came in the kit to be controlled by my Google Home mini in my office - so now, when I walk into my office, I can simply tell Google Home mini to turn on the light and it works! A key difference from Google and Amazon's management system is that Google Home currently does not support creating custom groups - but, it's totally easy to work around. For example, if I'm speaking to the Google Home we have in the family room and I tell Google to \"Turn off the lights\", it'll only turn off the lights in the family room. If you're on the fence about getting into home automation, then this is a painless way to get started. As always, if you're adding this to an existing setup, you need to do the research and see if it'll work with what you have or if you'll have to make some compromises. « less",
                "review_posted_date": "02 Dec 2018",
                "review_header": "Practical Smart Home Starter Pack",
                "review_rating": "4",
                "review_author": "cjviscito",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "We have had this google mini installed in our kitchen. Firstly to set the google mini you need to download the google home app and follow the setup instructions, this is common of many electrical products. The set up did seem to take a long time but this could of been down to my internet connectivity rather than the app itself. The google mini needs to be plugged in at all times, It would of been nice if the cable colour matched the device to blend it in more as the white cable stands out on our black worktops and the actual plug is bulky but this is personal preference and doesn't affect the product. We have been very impressed with the google minis 'understanding' it never fails to answer or perform the task requested regardless of who has asked it, woman, man, or child. As a speaker I don't think the sound quality is as good as other speakers on the market but that said other speakers don't remind you to make a packed lunch or tell you how long to cook roast parsnips for. We haven't got Spotify or googleplay which are the main music platforms supported by the voice activation but it is simple to pair your phone or table via Bluetooth to play music. You can request it plays radio stations for you without the need for a secondary device nearby if you don't use the above mentioned platforms. There is so much this device can do and we haven't even begun to fully utilise it yet, what we have done is; -Stored shopping lists on it so when you've got dirty hands cooking and use the last of something you can add it to the shopping list straight away without forgetting - Kitchen timer, you can ask it how long is left on the timer too - New and weather updates specific to you're local area or wherever else you request - Recipes - Radio - TImer My 9 year old has particularly enjoyed some of the fun features like beat boxing, trivia games and getting the answer to his maths homework. This is a fun family gadget. « less",
                "review_posted_date": "18 Jan 2018",
                "review_header": "Fun Gadget, Great product",
                "review_rating": "5",
                "review_author": "JUMA",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "It's billed as a starter kit, and that's what it is. For \"smart\" lights, this is about as barebones as you get. You can remotely dim, but not change either the temperature or the color of the light. In setting up the kit, you're prompted to use Google Home, which is appropriate for the mini, and it seems to already know that you're setting up the light as well. However, using the Google Home app on iOS, you don't have the ability in app to do anything with the bulb other than unpair it. GE does have a separate C-life app, but it was unable to find the bulb, probably because it had already paired with the Google Home setup. To try to get to any additional features that may (or may not) be available through the GE app, I would have had to reset the bulb through a complicated series of timed power cycles of the light, and I wasn't willing to do that just to try pairing with a different app. Through Google Home, you have to use voice commands to dim or brighten the light. The nice thing is that you don't need a separate hub for the light, the Google mini is all the additional hardware you'll need. On its own, the Google mini is great because it gives you access to the Google assistant and the wealth of smart home features that provides, especially if you associate it with your Google account and use the calendar. It doesn't claim to be anything more than it is, but that's a very limited set of features for a \"smart\" light. « less",
                "review_posted_date": "01 Dec 2018",
                "review_header": "Good mini, less good bulb",
                "review_rating": "4",
                "review_author": "bradcon",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "We have had this google mini installed in our kitchen. Firstly to set the google mini you need to download the google home app and follow the setup instructions, this is common of many electrical products. The set up did seem to take a long time but this could of been down to my internet connectivity rather than the app itself. The google mini needs to be plugged in at all times, It would of been nice if the cable colour matched the device to blend it in more as the white cable stands out on our black worktops and the actual plug is bulky but this is personal preference and doesn't affect the product. We have been very impressed with the google minis 'understanding' it never fails to answer or perform the task requested regardless of who has asked it, woman, man, or child. As a speaker I don't think the sound quality is as good as other speakers on the market but that said other speakers don't remind you to make a packed lunch or tell you how long to cook roast parsnips for. We haven't got Spotify or googleplay which are the main music platforms supported by the voice activation but it is simple to pair your phone or table via Bluetooth to play music. You can request it plays radio stations for you without the need for a secondary device nearby if you don't use the above mentioned platforms. There is so much this device can do and we haven't even begun to fully utilise it yet, what we have done is; -Stored shopping lists on it so when you've got dirty hands cooking and use the last of something you can add it to the shopping list straight away without forgetting - Kitchen timer, you can ask it how long is left on the timer too - New and weather updates specific to you're local area or wherever else you request - Recipes - Radio - TImer My 9 year old has particularly enjoyed some of the fun features like beat boxing, trivia games and getting the answer to his maths homework. This is a fun family gadget. « less",
                "review_posted_date": "06 Jan 2018",
                "review_header": "Great product",
                "review_rating": "5",
                "review_author": "Fobbie16",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "It was a choice between this and the other well known one and I chose this because of the speaker sound quality which I must say is pretty good considering its size. Nice even bass and clear treble. It also goes very loud but I find the clarity distorts slightly if I do that but it's loud enough anyway even if not on full. You tap the sides to raise/lower the volume. A long press on the side can pause/stop playback. You can also tell the AI to lower the volume by xx% or pause playback etc. The AI (Google Assistant) is still learning and like all similar smart speakers it will take a while for you it to learn how to respond more accurately and what you can say to it to get a more accurate response. It can be a little bit frustrating having to repeat yourself a few times but I must say it seems fairly intuitive and quickly learns. More schemes are being added to it so you can add more connected gadgets. It doesn't have as many as its rival but it's slowly getting there. You can switch off the mic on this so that's great for us security minded people. I have yet to link another speaker via bluetooth but have it linked to my Chromecasts and a cheap wifi plug with no issues at all. I would like it if the AI could be switched to only recognising my voice and no other and possib ly changing its name so that my phone and tablet don't spring to life when they hear the 'OK Google' phrase (the facilities may be there already but I haven't found them yet). I have now started telling it good morning which will give me a rundown of my schedule and the day's news highlights. I also tell it good night and enjoy hearing it say something silly like 'good night, up the stairs to Bedfordshire' or something equally amusing. On the whole I'm glad I bought it and would consider getting another for other rooms. « less",
                "review_posted_date": "30 Aug 2018",
                "review_header": "Living up to expectations",
                "review_rating": "5",
                "review_author": "sweenytoddler01",
                "review_from": [
                    "ebay.com"
                ]
            },
            {
                "review_text": "How much you like your Google Home Mini depends on how you plan to use it. I've had two Echo Dots for a year and this Google Home Mini for several weeks. I use my devices for home automation and to answer questions. Amazon Echo devices are way ahead of Google Home devices in the automation arena. Yes you can tell both to turn on and off or dim lights, but I can tell my Echo Dots to turn in \"scenes\" I've setup with my Philips Hue lights. Google Home doesn't seem to support this. Same for the automation I've setup with my Logitech Harmony to control my TV, blu-ray and AV system. Amazon Echo devices cleanly support my Harmony macros and channel favorites, etc. I haven't seen that Google Home supports Harmony macros, but it does allow me to do some things like increase or decrease TV volume. Also, Echo supports Bluetooth speakers, so it's easy to improve the soung. It appears my Google Home Mini only supports Chromecast devices, which I have none. Google Home is better at answering questions and understanding me in noisy rooms, as well as setting up and differentiating multiple people. (Echo devices used to be really bad at answering questions, but the gap is really small now.) Also seems like Google Home is slightly better suited to calling people and local businesses, but I haven't deeply explored this area. I only use my phone to make calls, since I'm not that excited about sharing my contacts with either Amazon or Google. Overall, Amazon Echo is a better fit for me, but Google Home might be better for you if you aren't focused on home automation. « less",
                "review_posted_date": "07 Nov 2017",
                "review_header": "Good but Not Great",
                "review_rating": "4",
                "review_author": "ChuckFromDallas",
                "review_from": [
                    "Bed Bath & Beyond"
                ]
            },
            {
                "review_text": "We have had this google mini installed in our kitchen. Firstly to set the google mini you need to download the google home app and follow the setup instructions, this is common of many electrical products. The set up did seem to take a long time but this could of been down to my internet connectivity rather than the app itself. The google mini needs to be plugged in at all times, It would of been nice if the cable colour matched the device to blend it in more as the white cable stands out on our black worktops and the actual plug is bulky but this is personal preference and doesn't affect the product. We have been very impressed with the google minis 'understanding' it never fails to answer or perform the task requested regardless of who has asked it, woman, man, or child. As a speaker I don't think the sound quality is as good as other speakers on the market but that said other speakers don't remind you to make a packed lunch or tell you how long to cook roast parsnips for. We haven't got Spotify or googleplay which are the main music platforms supported by the voice activation but it is simple to pair your phone or table via Bluetooth to play music. You can request it plays radio stations for you without the need for a secondary device nearby if you don't use the above mentioned platforms. There is so much this device can do and we haven't even begun to fully utilise it yet, what we have done is; -Stored shopping lists on it so when you've got dirty hands cooking and use the last of something you can add it to the shopping list straight away without forgetting - Kitchen timer, you can ask it how long is left on the timer too - New and weather updates specific to you're local area or wherever else you request - Recipes - Radio - TImer My 9 year old has particularly enjoyed some of the fun features like beat boxing, trivia games and getting the answer to his maths homework. This is a fun family gadget. « less",
                "review_posted_date": "10 Nov 2017",
                "review_header": "Fun gadget",
                "review_rating": "5",
                "review_author": "Bejaph89",
                "review_from": [
                    "John Lewis"
                ]
            }
        ],
        "url": "https://www.google.com/shopping/product/7008326304182003253/reviews?q=google%20home&biw=1280&bih=639&prds=paur:ClkAsKraX8Po_BNHjxH-Yuazffm_I6ZTl-XFq7J9Cju-IhsWprvvBNQVbAtjPnj9S-0c283EL4MEVkciNKzFUhQXZKcjVzNzGHrLZrnO3-VSZ8ZUtWFeHIPJ5RIZAFPVH70GN1g15WffBXvfhjuFbXBgEL2GyQ,rstart:30&sa=X&ved=0ahUKEwiz2_iUuPXfAhWHhlQKHTSKCMUQqSQI-gE",
        "name": "Google Home Mini Smart Speaker - Chalk",
        "price": "$29"
    },
    {
        "ratings": {
            "5": "10k+",
            "4": "4,406",
            "3": "735",
            "2": "230",
            "1": "233"
        },
        "reviews": [
            {
                "review_text": "I am not going to repeat my reviews or \"Mini\"-related evaluations already posted. In short, the Google Mini is a fully functional smart home device that really only lacks in audio capability, and other limitations related to available pre-programmed skill sets, noted elsewhere. It's good, but doesn't really improve on its competitor, except as a direct link to search functions. There it does excel. The C by GE smart bulb is a fully functional smart bulb, which is can be dimmed [solely] via either the App or a Google Home device command. Within that limitation, it functions exceedingly well. A nominal 60W-incandescent bulb equivalent - the bulb's box and online give different output levels,in same general range - it yields roughly 800 lumens. This bundled bulb is slightly warm, though apparently is also available as a Daylight (colder, more blue) variation. One absolute major advantage to LED bulbs that can be dimmed, even over CFLs, is that the dimmed percentage is directly proportionate to the current drawn, at least to a minimum threshold (I'm guessing around 5%). That is, down to whatever the 'trigger threshold is, the power consumption drops by the same amount, so if set to 10% brightness, it only uses 1/10th of the power as full brightness. At a rated 9.5 W consumption, dimmed to 10%, the bulb would only draw .0.95 Watt, or 1 kWh every 1050 hours. Obviously an extreme example, but using at short intervals at reduced %-age,m will significantly reduce operating cost, and at least in theory, should increase the life-span of the bulb. For example, installed in my laundry room, during daytime I only run at 15-20% to augment daylight, and even after dark, for that limited space, find 50% usually sufficient. However, if one already has Google Home devices, this bundle is redundant, unless the intent is to expand the 'network' of Home devices to another, non-contiguous space, for example to a garage or work-shed in range of one's router or WiFi mesh. Otherwise, one should simply buy the bulb(s) separately. Note that there are other brands of bulbs that available that are also controllable without a 'hub', by either Google Home and/or the main competitor system devices. « less",
                "review_posted_date": "02 Jan 2019",
                "review_header": "Bundled Google-Home dedicated Smart Bulbd with Min",
                "review_rating": "4",
                "review_author": "Mike",
                "review_from": [
                    "lowes.com"
                ]
            },
            {
                "review_text": "The Google Home Mini is great and works perfectly. The speaker is decent for it’s size and you won’t have any issues hearing it in under most conditions. The mini is responsive to your voice and you can just talk normally to interact with it. The GE C-Life smart bulb that comes packaged with it connects to the google mini via Bluetooth. I was able to connect it to my Google Home (not mini) that I had already and set up was easy and straight forward. It is recommended that the bulb be close to the google mini for the pairing to take hold. I had them about 25 feet apart and I didn’t have any issues. The GE bulb is a warm color and that is the only color that it projects. Their other bulbs, the C-Sleep will go from Warm to Cool, but again, this one will not. I find that to be a minor annoyance, but I am sure there is a marketing reason for that. This set up will allow you to dim the light and turn it off and on. I haven’t found a way to set up a schedule in the google assistant app, but if you use the C by GE app then you have more control over that, but Google home mini is the recommended way to use this since they are paired together in this package. I have not had any issues with connectivity at all, and the light has always responded to my commands. This is a good way to get started out if you don’t already have a Google device. The distance limitations though of 50 feet, you might want to think about other smart light solutions if you are planning on doing a whole house. « less",
                "review_posted_date": "06 Dec 2018",
                "review_header": "Great google device, decent smart bulb",
                "review_rating": "4",
                "review_author": "jago",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "---SETUP--- This device requires two items to set up, the included Google Assistant (a Wifi speaker) and the included WiFi light bulb. The lightbulb is installed like any regular light bulb and works with or without WiFi. The Google Assistant needs to be plugged into the wall with the included adapter and requires the download of the Google Home app to complete set up. ---FEATURES--- The key feature of this starter kit is that it turns individual, compatible WiFi light bulbs into smart lights that can be controlled with your voice. Included are one Google Assistant speaker and a regular sized light bulb. ---PERFORMANCE--- The performance of both the speaker and the light bulbs were very responsive. After I learned the specific commands that Google recognizes for the lights, I was able to get them to do what I wanted. ---EXPECTATIONS--- The product meets my expectations. I was able to dim the lights from 1% to a full bright of 100%. The particular light bulb included (760 lumens) only goes to a very bright yellow. I own two other WiFi light bulbs (800 lumens) that are also a bright yellow but all together installed on the same ceiling fan, they didn’t look any different in terms of brightness. The previously installed light bulbs were all white lights, but since these are going in a theatre room, the yellow with dimmable option works better for me. ---VALUE--- The price for the starter kit in terms of value is very good. Even if you don’t end up liking the way the WiFi lights work, which I didn’t think I would but now I can’t stop dimming them constantly because I can, you still get a Google Assistant speaker, which on its own can tell you the weather, the time, be an alarm clock, and do all sorts of other things you ask it to, like search up definitions of words while you’re reading a book. ---APPROVAL--- I highly recommend this product for people who are trying to dip their toes into what a smart home could be for them. It’s an easy and cheap way to see what smart homes are all about and you can start growing your setup over time. « less",
                "review_posted_date": "06 Dec 2018",
                "review_header": "Cheap Entry to Smart Home Setup",
                "review_rating": "5",
                "review_author": "Trobadour",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "The Google Home Mini and GE light bulb kit represent a relatively inexpensive way to test out \"smart\" home tech to see if you're going to like it. My house is already pretty well integrated (or inundated!) with smart things but I decided to give this a try to see if it's something my parents and in-laws--who are all technophobes--might be comfortable using. The setup is fairly straight forward and went off without any complications. I stayed away from the GE app setup based on other reviews and the fact I wanted to be able to have control of this bulb when away from home. Unlike all of my other smart stuff, the GE bulb is not WiFi connected, but rather uses Bluetooth so placement is key. It will only connect to Google-branded devices, so keep that in mind. In theory, the bulbs are supposed to be able to create their own mesh-type network to extend placement options, but I only have the one so I can't comment on that functionality. On the plus side, there's no need to have a separate hub so that helps keep your costs (and clutter) down. Anyway, the Home Mini works like any other Google Home speaker, just in a smaller package. The sound quality is acceptable for what it is, just don't expect room-filling sound. The bulb can be controlled by voice to turn on or off or you can dim from 100% to 1%. The color temperature is not adjustable, it just is what it is. The light is pleasant enough but it sometimes leaves me wishing it was a tad brighter. All in all, this is a solid entry-level device kit that works pretty well. For me, it's a little too basic, but it's exactly what my parents and in-laws would be comfortable using. « less",
                "review_posted_date": "07 Dec 2018",
                "review_header": "Inexpensive cost of entry to \"smart\" home tech",
                "review_rating": "4",
                "review_author": "Chadwick",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "Relatively easy setup (I'm an IT professional, so easy for me) LIKE: Recognizes voice as mine, Amazon's Echo Dot recognizes any without distinction. *DING* plus a star . . . LIKE: Form factor is nice & like the mostly hidden lights behind the material. LIKE: Speaker is better than Amazon's Echo Dot (volume & bass, anyway) although really, if you want good sound, you're not going to use the device by itself anyway . . . ah well, *DING* plus a star. LIKE: Connected immediately to YouTube (I pay for red) when signing in with my existing google account and it immediately picked up my preferences. *DING, DING* plus 2 stars! (Amazon Music has proven fairly restrictive & often shifted prime songs in and out of their basic Prime inclusion: trying to force an additional prime music subscription, which I refuse to do, considering I already pay for Prime. So YouTube has been my go-to for the last year or so & glad it's already on board.) LIKE: Had light bulbs and plug switches connected to Kasa's TP-Link and already controlling them with Amazon's Echo Dot . . . with sign in connection established between Google Home & Kasa's TP-Link, all were immediately available for control . . . plus I could rename each device specific to Google Home. *DING* plus a star. DISLIKE: Can't change the wake phrase. You're stuck with OK Google or Hey Google. *DING* minus 1/2 star. (Echo has 4 options, one of them is \"computer\" . . . which is what I like) DISLIKE: AI voice limited to male & female with no real variations: I don't particularly like or dislike either voice. DISLIKE: ABSOLUTELY HAD to install Google Home on my phone or iPad (would rather I didn't HAVE to do that, no option for Windows 10, but oh well *DING* minus 1/2 star). SUMMARY: If you're big into Amazon, stick with Echo, it's roughly equivalent in ability. If you're not really into Amazon, Google Home is probably your better bet. For either, if you're new to the whole AI automation thing, you should start with the Home Mini (or Echo Dot) & a few outlet plugs and/or controllable light bulbs in the bedroom. Set up a morning routine & go from there . . . a LOT of really great stuff. Certainly more to come, as this whole AI thing is just getting started. Remember this thing is sitting there listening to everything 24/7 . . . so if you're into conspiracy theories or nefarious activities . . . you might want to think twice about providing an audio channel into your home space. I'm not personally worried at this point, but am definitely going to keep my ears open for what is going on in the home consumer AI space . . . « less",
                "review_posted_date": "22 Dec 2017",
                "review_header": "Comparable to Amazon's Echo Dot (Alexa) . . .",
                "review_rating": "4",
                "review_author": "PervisStoop",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "I haven’t owned my “Hey Google” starter kit but just a few days now and already I couldn’t live without it! It comes with a smart bulb that will fit in your lamp. You can turn it on or off without even moving from that comfortable spot!! I want to a bulb for every light fixture in my house! The bulb seems like it’s a very expensive piece and one that saves energy too. Set up was so easy and it doesn’t take a rocket scientist or someone with a computer degree to set up. Just follow the instructions, which are easy to follow along. I set it up on my phone and tablet. The actual google device is incredible, I can have it to set an alarm to wake me up, tell me jokes, play music for me, tell me the weather and everything. Even change the volume on the speaker. One thing that I really want to mention is how loud the device is. To me it’s as loud as I need. So volume wise is great. The device picks up my voice and my family’s to and understand usually everything we say. There’s no lag or pause when I ask for the light to be turned on. She is “very smart”! I love the look of the device to, it’s small and modern look, looks nicely on my nightstand. Also comes with usb cord. Also seems like a sturdy built I have faith my bulb will last for years and years and even the device it’s self. No issues with the bulb, has a nice hue and bright. What else was so awesome to learn was this bulb can also be dimmed! I’m so blown away by this technology. This starter kit has spoiled me so much, with my nightstand light that one is not enough I need all my bulbs in the whole house replaced! I truely believe here home needs this starter kit! It’s not only spoiled me but mad my life so much easier! « less",
                "review_posted_date": "19 Nov 2018",
                "review_header": "Tell me a joke or turn off my light",
                "review_rating": "5",
                "review_author": "southern",
                "review_from": [
                    "Target"
                ]
            },
            {
                "review_text": "Pros: Aesthetically pleasing, compact and stylish compared to Alexa. Having read reviews, I was concerned about the volume levels for playing music, however was pleasantly surprised. Whilst also purchased Google Chromecast for this reason, the volume levels is more than adequate when listening in the room and room beside. Cons: Bought Google for a present as mum uses Spotify. Did not realise you are only able to access a limited selection of songs via device only (in this instance linked to tablet) and unable to ask Google mini to play a particular song (like you can on the adverts) as need Spotify Premium. Really disappointed with this as purchased thinking it would be set up to access music by voice. Spotify Premium is pretty expensive for mum to sign up for on a monthly basis. Also mum has asked Google numerous questions and the response has been \"unable to respond at this time\". Overall, whilst it looks good and sounds good, it can not be used as had hoped so a disappointing present. « less",
                "review_posted_date": "19 Jan 2018",
                "review_header": "Nicola's review of Google Home Mini",
                "review_rating": "2",
                "review_author": "Nicola",
                "review_from": [
                    "Currys"
                ]
            },
            {
                "review_text": "I had the echo dot for over a year before I bought the google home mini. I bought it because sometimes I'll ask Alexa questions that I'll have to google because it doesn't know the answer. But as time went on Alexa has been improved and can answer a whole lot more than when I originally bought it. I ask both of them the same questions and they pretty much give me the same answers. Maybe google will give a little more details but so far there has only been a couple of questions that google knew over Alexa. But if you have prime Alexa is the choice hands down. They have tons of free music and if you have a fire stick or tv tons of free movies as well. So if you don't have prime, google is the way to go. It can connect to bluetooth devices, control smart devices, deliver custom news feeds, set up calendars, make lists, tell jokes, sing songs and play games just the same as the echo dot. I like the Alexa app and the google home app is pretty good also. The big difference is amazon prime. I don't subscribe to any google services other than gmail and youtube but it seems like you can utilize the google drive to upload music and play it through the google mini. I have done this with Alexa. I have bought albums on Amazon and some have digital mp3's of the album that you can stream at anytime off of the dot. You can favorite playlists on Amazon and both can play from pandora and spotify just the same. So there you go if you have prime the Amazon devices are for you if not google will allow you to do all the same things as the Alexa devices. « less",
                "review_posted_date": "14 Jan 2018",
                "review_header": "google home mini vs alexa echo dot",
                "review_rating": "4",
                "review_author": "TheMaxxx",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "Another promising but ultimately poor product by Google. They had an opportunity to give this some decent features above and beyond what you can already do with your phone but failed miserably. On top of this they are continuing down the path of a business model based almost entirely on trying to possess and monetise your personal information. ***A quick warning on the setup. The setup screen claims you can use the device for basic Google commands only if you don't want to allow it full access to your location and web search history etc etc but this is false! If you don't allow Google access to all these things your Home Mini device will not work and keeps repeating \"Actually, there are some basic settings that need your permission first. Just go into the Google Home app on your phone for more details\". This is false advertising and should be listed on the outside of the box but it is not. There are a lot of unhappy campers online with this same complaint. In short, don't buy this unless you are happy for Google to monitor everything you do beyond what it actually needs to perform basic voice command responses. Cons: -Can't recognise a song playing (on the radio for example) unless it (the Home Mini) is playing it. Really! Shazam can do this as can the Google app on my phone. -Sound quality is pretty poor up above about 60% volume. I didn't buy this for it's music playing capability and don't recommend you do either unless you have a tin ear. -Doesn't keep the listening channel open long enough. You ask a question and get an answer but can't ask a follow up without saying \"hey google\" again every time. Get's really tiresome. It really wouldn't be that hard to let the user customise this and allow a 5 second window for quick follow up questions. -Allows you to set a reminder using a verbal command but the reminder will only appear on your device and not via the Home Mini. At the time of the reminder the Home Mini will not do anything! -Can't properly use most if not all the streaming music services unless you have an account with them. Pros: Not many at this stage. It's a bit easier to use than picking up your phone and consuming the battery I suppose. I look forward to a time when Google and Apple have some real competition so that they start making decent customer focused products again that don't rely on you selling your soul for access. « less",
                "review_posted_date": "26 May 2018",
                "review_header": "Google is on the fast track to nowhere...",
                "review_rating": "2",
                "review_author": "Quindarious",
                "review_from": [
                    "ProductReview.com.au"
                ]
            },
            {
                "review_text": "Pros: Excellent piece of kit. Pros -Without Chromecast/Spotify You can enjoy podcasts, stream the radio, fun facts, jokes, play a quiz game, pretty much have Wikipedia available to answer all your questions -With Chromecast/Spotify You can link to a TV or Stereo system to stream music via bluetooth/wifi. You have all the music you can think of simply by requesting \"Hey Google, Play Wooly Bully, by Sam the Sham and the Pharos\" Podcasts, audiobooks, ambient sleep sounds, weather updates. Or like me, you wake up in the dead of the night in the dark, \"Hey Google, what's the time?\" Cons: Not being able to link to a Stereo for better sound without additional purchases of items like ChromeCast.",
                "review_posted_date": "10 Feb 2018",
                "review_header": "Oliver's review of Google Home Mini",
                "review_rating": "5",
                "review_author": "Oliver",
                "review_from": [
                    "Currys"
                ]
            }
        ],
        "url": "https://www.google.com/shopping/product/7008326304182003253/reviews?q=google%20home&biw=1280&bih=639&prds=paur:ClkAsKraX8Po_BNHjxH-Yuazffm_I6ZTl-XFq7J9Cju-IhsWprvvBNQVbAtjPnj9S-0c283EL4MEVkciNKzFUhQXZKcjVzNzGHrLZrnO3-VSZ8ZUtWFeHIPJ5RIZAFPVH70GN1g15WffBXvfhjuFbXBgEL2GyQ,rstart:40&sa=X&ved=0ahUKEwiz2_iUuPXfAhWHhlQKHTSKCMUQqSQI-gE",
        "name": "Google Home Mini Smart Speaker - Chalk",
        "price": "$29"
    },
    {
        "ratings": {
            "5": "10k+",
            "4": "4,406",
            "3": "735",
            "2": "230",
            "1": "233"
        },
        "reviews": [
            {
                "review_text": "How do I start this one... It is a really cool gadget, with a real potential for helping around the house but it has a very limited usage in our house. We got the buy one get one free so actually we got 2 in the house. It was very easy to set up, install the google home app on your phone or tablet, we have android and iOS so we got them all the app, then connect your GHM to your wifi and you are pretty much done. If you have a google account, set it up, record you voice for voice recognition... to be fair, it’s easy, just follow what is asked on your app. Then it sets itself so you don’t have to worry about it. My favourite feature is the “hey google good morning” I get my good morning and then it tells me the weather, the news and what is on my calendar. You can add extra or cut things out, in any order you want. It is a hit with the kids, they just say “I am bored” and here is the game show, a series of questions like a game show! They love it. My son really loves it, he talks to google often, ask questions to get answers, he asks the time, the weather every morning. I like the hands free features, just say what you need or want and it will do it. I often listen to some European radio when I am in the kitchen and instead of typing the radio I am looking for, I just say it. I have created a shortcut so I just say “play my radio” and it does it using tunein. I don’t have an account with YouTube red or Spotify so I can’t listen to music on it. It is a shame that I cannot access my own library on my computer. I can use it as a wireless speaker from my phone, but I cannot use voice control, which defy the purpose. There are many apps in the US, but here not so much. As for the automated home system I found it is still too expensive to say yeah I’ll get all my lights turned into smart ones. I almost forgot about the ability you have to get your, Netflix and Stan account linked, so you can tell google what you want to watch on you tv using the chromecast. So my view is simple, there is a lot we can do with it, it’s cheaper than the big one, does exactly the same things, the sound is good. But the fact that the third party apps are still desirable in Australia, the connected products aren’t very affordable yet and appart from that, it’s a good gadget that I hope in the near future will be a lot better. « less",
                "review_posted_date": "19 Mar 2018",
                "review_header": "This isn’t a clear cut",
                "review_rating": "4",
                "review_author": "jpcntti",
                "review_from": [
                    "ProductReview.com.au"
                ]
            },
            {
                "review_text": "The Google Home Mini is really a convenient little device. I'm not going to explain everything it can do but I will touch on key overall features. First off it can operate a lot of smart devices with either voice or through the Google Home app available free through the Play Store via android. It can tell you weather, a joke, play music or create events, it can start Netflix. And once linked to your android account it will post and open things on your phone as far as adding alarms and calendar events. It must be connected to your WiFi for it to work properly. The small statue of the Google Mini means it will fit just about anywhere and it looks nice, it shouldn't be an eyesore for you. Also the speaker is very responsive and picks up voice with ease. Now for the smart light bulb that comes with this set. It is so awesome and handy to have. I have the bulb in my light fixture outside. It is so convenient to be able to control the light from the Google Home app on my phone from the warmth of my car. When I get home most evenings it is dark, all I have to do it turn the light on by the app from my phone. This is so handy because I normally have my hands full of stuff that needs to go into the house, and no room for a flashlight. Also with having pets I can watch my step with the light on, and not worry about stepping in something I shouldn't. « less",
                "review_posted_date": "03 Dec 2018",
                "review_header": "So Convenient",
                "review_rating": "5",
                "review_author": "Abazabba",
                "review_from": [
                    "Target"
                ]
            },
            {
                "review_text": "When the home AI units came out, I had to decide whether to set our home up with Amazon Alexa or Google Home. At the time, Alexa seemed to be the more robust choice. I was already a Prime member, I owned Kindles, so the choice seemed obvious. I set my home up with the Alexa ecosystem. I think I may have made the wrong choice. As you would expect, set up of the Google Home device was easy. The user interface is visually pleasing and fairly intuitive. You can program it for multiple users that have different voices, so that each person can have their own setups individual to them. One of the frustrations I have with Alexa is that if you don’t phrase something EXACTLY, it doesn’t understand. For example, if I said “Alexa, turn off living room lampS,” it wouldn’t understand which light I meant. I set up the item as singular “lamp” so that’s the only way it understands the command. This Google Home unit came with a Smart Light Bulb. When I was testing the Home unit, I asked it to turn on the light as I titled it, just like I would have Alexa. Then I asked it to dim the light, without actually specifying the lamp. With Alexa, I would have had to say the commend in full (“Alexa, dim bedroom lamp.”). With Google, it seemed to understand what I wanted without specifying, AND it understood what I was saying as if I was having a conversation with it. Other than the clunky, “Hey Google,” to get its attention, it seemed to understand me. Alexa is very set in her ways, which can be annoying. Our phones are Androids, and I have an Android-based smart watch, which all have Google Assistant. It may be advantageous for me to switch from Alexa to Home at some point, but for now, it’s a bit cost prohibitive. If you haven’t set your Smart Home up yet, I would advise to really look at Google Home vs. Amazon Alexa. « less",
                "review_posted_date": "31 Dec 2018",
                "review_header": "A Better Ecosystem than Alexa",
                "review_rating": "5",
                "review_author": "CMCMom29",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "I recommend the Google Home Mini for anyone. I have always wanted one but the price was never in my price range but for the whole month of December in 2017, the Google Home devices were on sale. Before buying this item, I read a lot of reviews on the original Google Home and the Google Home Mini because I did not want to buy it without other buyers’ opinion on both of the items. I am so glad I read reviews because I would have bought the original Google Home because ‘bigger is better’ but in this case the Google Home Mini would meet my needs. The Google Home Mini is much cheaper than the original and I feel as if the Google Home Mini is much easier to access. It is so much smaller than the original so it is much easier to make space for it throughout your home. The set-up takes about five minutes to complete. So much easier than any other device I have had to set-up. It plays my favorite songs and bands when I ask it to play them. It answers questions that I ask in a split of a second. It plays games such as Mad Gabs, Trivia Games and so much more. You will never get bored when talking to the Google Home Mini. The only thing that is negative is that it does not work when there is no WIFI or when the WIFI is not working very well. I have loved having the Google Home Mini in my college dorm because it will help me with whatever questions I have and it plays music for me as soon as I say “OK Google”. I recommend this device for anyone who is looking for a cheap smart device because it fits my everyday needs. « less",
                "review_posted_date": "04 Feb 2018",
                "review_header": "Great Device",
                "review_rating": "5",
                "review_author": "Madison",
                "review_from": [
                    "walmart.com"
                ]
            },
            {
                "review_text": "A gadget obsessed friend of mine convinced me to get a Google Home Mini, which were on sale prior to Xmas (and even cheaper in the post-Xmas sales (sigh)). Because I use the Google Assistant voice app on my Android phone from time to time, I understood what it would involve. But after I started with it, I found it much more useful than I originally expected. You set it up using the \"Google Home App\" on an Android phone (or other phones or tablets). My idea was to put it in my bedroom. I am annoyed, when I wake up during the night (and being old, that happens a lot), at having to peer at my clock radio to find out the time. So even if I could just say \"OK Google, what's the time\" and be told ('It is 4:44am'), then I was ahead. In fact it does this, and much more besides. It will play the radio for me, just by asking, and it defaults to my favourite station. It will tell me what's on during my day, using the events I've added in my calendar. Just by saying \"OK Google, good morning\", it tells me the time, the weather, the events for my day, and then plays the news from the radio. I can stay in bed and not even open my eyes, if it turns out the world has ended during the night! (Just kidding). It shuts up when I say \"OK Google stop\". I registered for a free Spotify account, which I linked to the Home Mini, so if I say \"OK Google, play some music by Burt Bacharach\", it will do this via Spotify, and also play similar songs. Saying, \"OK Google, what's this song?\" will pause the music, and the Home unit will tell the name of the track, and who it's by. It will also set reminders, just by asking, add items to a Google shopping list, and set an alarm. I was so entranced by the device, I got a wi-fi light-globe (LIFX), so it will turn on and off a bed-side light, dim or brighten it, or change its' colour, all by just asking. it can do even more things that I have not yet gotten around to working out. It uses a soothing woman's voice that has an Australian accent. Anyway, it has proved itself really useful. I think the clock radio will be put away, with this taking its place. It's an amazingly versatile and helpful tool. It does not get every spoken request correct, but it does mostly. My main problem was it getting conflicted with the Google Assistant app on my phone, but I was happy to turn it off on the phone; actually making it manually interactive on the phone, which I find satisfactory. Highly recommended device, with lots of future potential. « less",
                "review_posted_date": "03 Jan 2018",
                "review_header": "Flexible and useful home assistant",
                "review_rating": "5",
                "review_author": "Cavitation",
                "review_from": [
                    "ProductReview.com.au"
                ]
            },
            {
                "review_text": "The Google Home Mini is not what I would consider a \"quality speaker\". It's got a slightly louder, deeper sound than the Echo Dot but it's not something I would use to listen to music for long periods of time - think of it more as a podcast engine rather than for high-fidelity sound. The real reason you should buy this, and without question I would recommend this, is for what it really offers: a window into all the amazing tasks the Google Assistant has to offer. It can do all the things Siri and Alexa can, but it also does so much more - its natural language processing makes it so much more flexible to make requests and queries, and it taps into the biggest knowledge base available - Google! This means it answers questions so much more readily than the other two major voice assistants can. Today I asked, very poorly, \"Hey Google - how long does it go between World Cups?\" Despite the fact that this sentence literally makes no sense, Google understood I was asking what the timeframe was between World Cups and told me the answer. It's brilliant, and it gets smarter every single day. At the time of my review, it makes great speakerphone calls, it sends broadcast messages to all your other Google devices, and it can understand up to three commands given in a single sentence. That's pretty amazing. And when you buy multiple Google Home products - we have two Minis and a normal Home - they all play music or news simultaneously in a sort of surround sound mode. And we use our Google Homes to control our home devices like our TV entirely by voice! An incredible device, and definitely an accessible gateway into the smart home future. « less",
                "review_posted_date": "18 Jun 2018",
                "review_header": "Sound not the greatest, but brains are everything",
                "review_rating": "4",
                "review_author": "MizuNoHane",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "I bought on it sale to see what it could do. Having had experience only with Apple’s fairly ignorant Siri, I was initially skeptical. Well, I’m not anymore. This sets up so easily with the Google Home app on your smartphone. It connects easily to your WiFi network. It’s voice recognition rarely fails. Questions you ask it usually produce useful results, though it will occasionally go off on a slightly unrelated tangent. It controls my Philips Smart TV quite well, with the frustration being that it can’t turn it on or off. It won’t play YouTube music to itself since I don’t have a paymium account but it will to the TV. That’s a slight bummer since I have to use a remote to turn the TV on or off. I bought a second one after being pleased with the first. It can’t control a Samsung UHD TV without a ChromeCast 4K that I haven’t got yet. That makes the nice smart features of the TV redundant, but is probably worth it so this little device can control it that way. After seeing how nice this is, I’ll probably be getting more smart devices for my home so this can control them. My only concern might be how vulnerable ones home might become to external hacking. « less",
                "review_posted_date": "09 Dec 2018",
                "review_header": "Great mini assistant; surprisingly useful",
                "review_rating": "5",
                "review_author": "Appledog",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "Let me start by saying that I have a number of Alexa devices, including 3 of the 1st gen Echo, and couple of 1st gen of the Dot, a couple of 2d gen Dot, and a Spot. I’ve been pretty happy with them as we’ve built our Smart Home capabilities, but was interested in trying out the Google Home Mini after getting a recommendation from someone in the family. When the right sale price came along, we took the opportunity to pick one up at Best Buy. The Google Home Mini is an attractive, small smart speaker; it is really much nicer looking than both the 1st and 2d gen Echo Dot (I don’t have a 3d gen, so can’t do a side-by-side). It is very responsive; in fact, I’d say it is slightly more responsive than any of the Echo products. It “speaks” clearly, but I think the voice sounds a little more artificial than that of the Echo. In the “smarts” department, I haven’t asked it anything it stumbled over yet. I wouldn’t recommend it as a primary means to listen to music, but then I don’t find playing music on the Echo devices to be very appealing, either. They’re both fine for short periods of listening. Overall, I’m glad to have had the opportunity to try the Google Home Mini, but I don’t find enough value added to want to abandon our Echo devices. Honestly, if Google had been first out of the gate with a smart speaker, I would probably feel the same way about abandoning their products. It’s good to have choices, and I think you just have to decide which “universe” you’re most comfortable in - Google’s or Amazon’s. I don’t think you can go wrong with either at this point. « less",
                "review_posted_date": "21 Dec 2018",
                "review_header": "Good product, but it won’t make me leave the Echo",
                "review_rating": "4",
                "review_author": "GadgetGirl",
                "review_from": [
                    "Best Buy"
                ]
            },
            {
                "review_text": "I really enjoy the Google Smart Light Starter Kit. It has been a great addition to our home and is the first \"smart\" home product we have installed. I like how the Google Home Mini is included in the kit allowing you full access to everything that product offers with the added convenience of easily adjusting the lighting in a room. It took me about five minutes to get everything up and running which included the time needed to install the Google Home app since I didn't already have it. Instead of wasting energy with our large overhead light, I am able to adjust the lamp with the included GE C-Life smart light . The bulb is great because the dimness can be adjusted a simple command to the Google Home Mini. I work from home a lot, so I like being able to be across the room on my laptop but adjust the light or turn it on as the outside light changes. It's also nice to be able to turn off the lamp as I'm heading to bed at night without having to cross the room to turn it on or off. I put the GE smart light on a basic lamp and love how the bulb allows it to now be a dimmable lamp. It's a next generation version of the old sound activated lamp controllers. The smart light says it has a life expectancy of over 13 years, so I look forward to being able to use this for many years to come. The Google Smart Light Starter Kit is an excellent product and I look forward to adding these to other rooms in my home. « less",
                "review_posted_date": "17 Nov 2018",
                "review_header": "Great Light Kit and Smart Home Upgrade",
                "review_rating": "5",
                "review_author": "vcf81",
                "review_from": [
                    "Target"
                ]
            },
            {
                "review_text": "Pros: Great functionality for such a small device and there are regular special promotions to buy one which makes it cheaper to get. To my surprise despite the small size its actually louder than I was expecting. If you are an audiophile then don't expect high fidelity audio in such a small form factor. However its perfectly adequate for background listening to music. Of course the real USP is the built in Artificial Intelligence assistant which helps to increase productivity, organises your shopping list (which you can share with your partner), your calendar and you can ask it questions at any time. Cons: Can't read emails yet. 1 in 5 attempts it doesn't recognise my voice. Background sounds do impact on the microphone's ability to hear you. Don't expect to have the tv on loud and expect the Assistant to hear you word for word. « less",
                "review_posted_date": "13 Aug 2018",
                "review_header": "Terry's review of Google Home Mini",
                "review_rating": "4",
                "review_author": "Terry",
                "review_from": [
                    "Currys"
                ]
            }
        ],
        "url": "https://www.google.com/shopping/product/7008326304182003253/reviews?q=google%20home&biw=1280&bih=639&prds=paur:ClkAsKraX8Po_BNHjxH-Yuazffm_I6ZTl-XFq7J9Cju-IhsWprvvBNQVbAtjPnj9S-0c283EL4MEVkciNKzFUhQXZKcjVzNzGHrLZrnO3-VSZ8ZUtWFeHIPJ5RIZAFPVH70GN1g15WffBXvfhjuFbXBgEL2GyQ,rstart:50&sa=X&ved=0ahUKEwiz2_iUuPXfAhWHhlQKHTSKCMUQqSQI-gE",
        "name": "Google Home Mini Smart Speaker - Chalk",
        "price": "$29"
    }
]